Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__10.theming/*.po
Languages: fr

source: Theme the portal
fr: Personnaliser le portail

source: Customize the appearance of the user portal
fr: Personnaliser l'apparence du portail utilisateur

source: The portal is customizable from the webadmin: `Domains` > Choose a top level domain > `Features`
fr: Le portail est personnalisable depuis l'interface d'administration web : `Domaines` > Choisissez un domaine de premier niveau > `Fonctionnalités`

source: Options for the Portal customization
fr: Options de personnalisation du portail

source: Show the list of public apps to visitors
fr: Afficher la liste des applications publiques aux visiteurs

source: Visitors will see a 'public apps' page when ending up on the portal instead of just the login form.
fr: Les visiteurs verront une page 'applications publiques' lorsqu'ils arriveront sur le portail, au lieu du simple formulaire de connexion.

source: Show other domain's apps
fr: Afficher les applications d'autres domaines

source: All apps from all domains will be visible on the portal. Default value is `true`.
fr: Toutes les applications de tous les domaines seront visibles sur le portail. La valeur par défaut est `true`.

source: Custom title
fr: Titre personnalisé

source: Choose a Title for the Portal
fr: Choisissez un titre pour le portail

source: Custom logo
fr: Logo personnalisé

source: Choose a image. Accept .svg, .png and .jpeg. Prefer a monochrome .svg with `fill: currentColor` so that the logo adapts to the themes.
fr: Choisissez une image. Les formats .svg, .png et .jpeg sont acceptés. Privilégiez un fichier .svg monochrome avec `fill : currentColor` afin que le logo s'adapte aux thèmes.

source: Default color theme
fr: Couleur par défaut du thème

source: Choose a color theme. Users are allowed to choose another one in their settings.
fr: Choisissez une couleur pour le thème. Les utilisateurs peuvent en choisir une autre dans leurs paramètres.

source: * App tiles display theme * simple = display apps icons * descripitive = display apps icons and a descpriction of the application * periodic = display tiles with name apps.
fr: * Affichage des vignettes d'applications * simple = affiche les icônes des applications * descriptif = affiche les icônes des applications et une description de l'application * récurrent = affiche les vignettes avec le nom des applications.

source: Search engine URL
fr: URL du moteur de recherche

source: This is an optional feature, allowing to display a search bar in the portal (for example if you like to use your YunoHost portal as your browser's home page). This should be an URL with an empty query string such as `https://duckduckgo.com/?q=, with q=` as duckduckgo's empty query parameter
fr: Il s'agit d'une fonctionnalité optionnelle qui permet d'afficher une barre de recherche dans le portail (par exemple si vous souhaitez utiliser votre portail YunoHost comme page d'accueil de votre navigateur). Il doit s'agir d'une URL avec une chaîne de requête vide, telle que `https://duckduckgo.com/?q=, avec q=` comme paramètre de requête vide de duckduckgo.

source: Custom user intro
fr: Personnalisation de l'interface utilisateur

source: You can use HTML, basic styles will be applied to generic elements.
fr: Vous pouvez utiliser le langage HTML, les styles de base seront appliqués aux éléments génériques.

source: Custom public intro
fr: Personnalisation de l'interface publique

source: * Custom CSS stylesheet
fr: * Feuille de style CSS personnalisée

source: This is for advanced admins willing to customize the appearance of the portal.
fr: Ceci est destiné aux administrateurs avancés souhaitant personnaliser l'apparence du portail.
