Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__10.providers__10.isp/*.po
Languages: fr

source: Internet service providers
fr: Fournisseurs d'accès à Internet

source: <Tabs defaultValue="europe" values={[ {label: 'Africa', value: 'africa'}, {label: 'Asia', value: 'asia'}, {label: 'Europe', value: 'europe'}, {label: 'North America', value: 'northamerica'}, {label: 'South America', value: 'southamerica'}, {label: 'Oceania', value: 'oceania'}, ]}>
fr: <Tabs defaultValue="europe" values={[ {label :'Afrique', value : 'africa'}, {label :'Asie', value : 'asia'}, {label :'Europe', value : 'europe'}, {label :'Amérique du Nord', value : 'northamerica'}, {label :'Amérique du Sud', value : 'southamerica'}, {label :'Océanie', value : 'oceania'}, ]}>

source: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email)| [Hairpinning](http://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | Fixed IP | | :--------: | :------: | :---: | :-----: | :-----: | :-----: | | **Orange** | Livebox2 | non | **non** | **non** | **non** | | **Moov** | | | | | | | **MTN** | | | | | |
fr: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email)| [Hairpinning](http://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | IP Fixe | | :--------: | :------: | :---: | :-----: | :-----: | :-----: | | **Orange** | Livebox2 | non | **non** | **non** | **non** | | **Moov** | | | | | | | **MTN** | | | | | |

source: <TabItem value="southko" label="South Korea" default>
fr: <TabItem value="southko" label="Corée du Sud" default>

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | --------------------------- | ------------------------ | --- | --- | ------- | | **LG U+ (HelloVision)** | Yes (Without ISP Router) | No | - | Partial | | **KT (SkyLife, Qook&Show)** | Yes | No | - | Partial | | **SKT (SK Broadband)** | Yes | No | - | Partial |
fr: | Fournisseur d'accès | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | -------------------------- - | ------------------------ | --- | --- | ------- | | **LG U+ (HelloVision)** | Oui (sans routeur FAI) | Non | - | Partiel | | **KT (SkyLife, Qook&Show)** | Oui | Non | - | Partiel | | **SKT (SK Broadband)** | Oui | Non | - | Partiel |

source: | Service provider | Box/modem/router | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | -------------------------- | -------- | --- | -------------------------- | --- | ------- | | **CHT (Chunghwa Telecom)** | Multiple | Yes | Yes (Need hidden settings) | No | Partial |
fr: | Fournisseur d'accès | Boîtier/modem/routeur | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ------------------------- - | -------- | --- | -------------------------- | --- | ------- | | **CHT (Chunghwa Telecom)** | Multiple | Oui | Oui (paramètres cachés nécessaires) | Non | Partiel |

source: <TabItem value="belnl" label="Belgium (nl)">
fr: <TabItem value="belnl" label="Belgique (nl)">

source: | Service provider | Box/modem/router | [Poort 25 openen mogelijk](/admin/email)| [Hairpinning](http://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | vaste IP | | :----------: | :---: | :---: | :-----: | :-----: | :-----: | | **Proximus** | BBox2 | ja | **nee** | **nee** | **nee** | | | BBox3 | ja | **nee** | **nee** | **nee** | | **Scarlet** | BBox2 | ja | **nee** | **nee** | **nee** |
fr: | Fournisseur d'accès | Boîtier/modem/routeur | [Ouverture du port 25 possible](/admin/email)| [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | [DNS inversé](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | IP fixe | | :----------: | :---: | :---: | :-----: | :-----: | :-----: | | **Proximus** | BBox2 | oui | **non** | **non** | **non** | | | BBox3 | oui | **non** | **non** | **non** | | **Scarlet** | BBox2 | oui | **non** | **non** | **non** |

source: **Proximus** zou niet openstaan voor self-hosting. Het openen van de poorten zou moeilijker zijn om SPAM te voorkomen. Het loont de moeite om een vpn te gebruiken.
fr: **Proximus** ne serait pas ouvert à l'auto-hébergement. L'ouverture des ports serait plus difficile afin d'éviter le spam. Il vaut mieux utiliser un VPN.

source: <TabItem value="belfr" label="Belgium (fr)">
fr: <TabItem value="belfr" label="Belgique (fr)">

source: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email)| [Hairpinning](http://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | IP fixe | | :----------: | :----------: | :---: | :-----: | :-----: | :-----: | | **Proximus** | BBox2 | oui | **non** | **non** | **non** | | | BBox3 | oui | **non** | **non** | **non** | | **Scarlet** | BBox2 | oui | **non** | **non** | **non** |
fr: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email)| [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) | IP fixe | | :----------: | :----------: | :---: | :-----: | :-----: | :-----: | | **Proximus** | BBox2 | oui | **non** | **non** | **non** | | | BBox3 | oui | **non** | **non** | **non** | | **Scarlet** | BBox2 | oui | **non** | **non** | **non** |

source: <TabItem value="fin" label="Finland">
fr: <TabItem value="fin" label="Finlande">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ---------------- | ------------------------------------------------------- | --------------------------- | -------- | | DNA | No | Yes | No | No. Only for business. | | Elisa | No | Yes | Not available for consumers | No. Only for Business. | | Telia | No | Yes | Not available for consumers | No. Only for Business. |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ---------------- | --------------- ---------------------------------------- | -------------------------- - | -------- | | ADN | Non | Oui | Non | Non. Uniquement pour les entreprises. | | Elisa | Non | Oui | Non disponible pour les particuliers | Non. Uniquement pour les entreprises. | | Telia | Non | Oui | Non disponible pour les particuliers | Non. Uniquement pour les entreprises. |

source: Regulations in Finland prohibit the use of Port 25 for consumers.
fr: La réglementation finlandaise interdit l'utilisation du port 25 pour les consommateurs.

source: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email) | [Hairpinning](http://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) personnalisable | [IP fixe](/admin/tutorials/domains/dns_dynamicip) | [Non listé sur le DUL](https://en.wikipedia.org/wiki/Dialup_Users_List) | | -------------------- | ------------------------ | -------------------------------- | ------------------------------------------------------- | ------------------------------------------------------------------------------- | ------------------------------------------------- | ----------------------------------------------------------------------- | | OVH | Personnel<br/>ou Box OVH | ✔ | ✔ | ✔ | ✔ | … | | Free | Freebox | ✔ | ✔ | ✔ (sauf IPv6, pas de support, et buggué sur certaines plages d'adresses ipv4) | ✔ | ✘ | | SFR | Neufbox | ✔ | ✔/✘ | … | ✔/✘ | … | | Orange | Livebox | ✘ | ✔ (depuis la Livebox 4) | ✘ (XXX.pro.dns-orange.fr disponible sur les abonnements orange pro) | ✘ (en option depuis la Livebox 3 et sur les abonnements orange pro) | … | | Bouygues<br/>Télécom | Bbox | ✔ | ✔ | ✘ | … | … | | Darty | Dartybox | ✔ | ✔ | ✘ | … | … |
fr: | Fournisseur d’accès | Box/modem/routeur | [Port 25 ouvrable](/admin/email) | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | [Reverse DNS](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) personnalisable | [IP fixe](/admin/tutorials/domains/dns_dynamicip) | [Non listé sur le DUL](https://en.wikipedia.org/wiki/Dialup_Users_List) | | -------------------- | ------------------------ | -------------------------------- | ------------------------------------------------------- | ------------------------------------------------------------------------------- | ------------------------------------------------- | ----------------------------------------------------------------------- | | OVH | Personnel<br/>ou Box OVH | ✔ | ✔ | ✔ | ✔ | … | | Free | Freebox | ✔ | ✔ | ✔ (sauf IPv6, pas de support, et buggué sur certaines plages d'adresses ipv4) | ✔ | ✘ | | SFR | Neufbox | ✔ | ✔/✘ | … | ✔/✘ | … | | Orange | Livebox | ✘ | ✔ (depuis la Livebox 4) | ✘ (XXX.pro.dns-orange.fr disponible sur les abonnements orange pro) | ✘ (en option depuis la Livebox 3 et sur les abonnements orange pro) | … | | Bouygues<br/>Télécom | Bbox | ✔ | ✔ | ✘ | … | … | | Darty | Dartybox | ✔ | ✔ | ✘ | … | … |

source: <TabItem value="hun" label="Hungary">
fr: <TabItem value="hun" label="Hongrie">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ------------------------------------- | ------------------ | ------------------------------------------------------- | ------------------------ | ---------- | | DIGI Távközlési és Szolgáltató Kft. | No. Business only. | No | No. Business only | No. Business only | | Telekom Magyarország | No | No | No | No |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ------------------------------------ - | ------------------ | ------------------------------------------------------- | -------------------- ---- | ---------- | | DIGI Távközlési és Szolgáltató Kft. | Non. Entreprises uniquement. | Non | Non. Entreprises uniquement | Non. Entreprises uniquement | | Telekom Magyarország | Non | Non | Non | Non |

source: DIGI allows non-business users to subscribe to their business plan, for roughly the same price as the regular plan. Fix IP is an additional subscription for business plan users.
fr: DIGI permet aux utilisateurs non professionnels de souscrire à leur forfait professionnel, pour un prix à peu près équivalent à celui du forfait standard. Fix IP est un abonnement supplémentaire destiné aux utilisateurs du forfait professionnel.

source: <TabItem value="irl" label="Ireland">
fr: <TabItem value="irl" label="Irlande">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ---------------- | ------------------------------------------------------- | ------------------------ | -------- | | Whizzy Internet | Yes | Yes | Yes | Yes |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ---------------- | ---------------- --------------------------------------- | ------------------------ | -------- | | Whizzy Internet | Oui | Oui | Oui | Oui |

source: <TabItem value="swe" label="Sweden">
fr: <TabItem value="swe" label="Suède">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ------------------ | ------------------------------------------------------- | ------------------------ | ------------------ | | Telia | No. Business only. | Yes | No. Business only. | No. Business only. | | Bredbandsbolaget | No. Business only. | Yes | No. Business only. | No. Business only. | | Ownit | Yes | N/A? | ? | Yes |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ----------------- - | ------------------------------------------------------- | ------------------------ | -------------- ---- | | Telia | Non. Entreprises uniquement. | Oui | Non. Entreprises uniquement. | Non. Entreprises uniquement. | | Bredbandsbolaget | Non. Entreprises uniquement. | Oui | Non. Entreprises uniquement. | Non. Entreprises uniquement. | | Ownit | Oui | N/A ? | ? | Oui |

source: Ownit reserves port 3 and 4 of their router to TV. With a simple call to their hotline, explaining that you want to selfhost, they can reassign one of the ports to be in bridge mode. It means that your server will have its own public fixed IP address, in addition to the modem's.
fr: Ownit réserve les ports 3 et 4 de son routeur à la télévision. Il suffit d'appeler leur service d'assistance téléphonique et d'expliquer que vous souhaitez héberger vous-même votre serveur pour qu'ils réattribuent l'un des ports en mode pont. Cela signifie que votre serveur disposera de sa propre adresse IP publique fixe, en plus de celle du modem.

source: <TabItem value="che" label="Switzerland">
fr: <TabItem value="che" label="Suisse">

source: NB: Most of non-business IP provided by ISP are blocklisted.
fr: NB : La plupart des adresses IP non professionnelles fournies par les FAI sont bloquées.

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ---------------- | ------------------------------------------------------- | ------------------------ | -------- | | Sunrise | Yes | No | - | - | | Swisscom | Yes | No | No | No | | VTX | Yes | No | - | - |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ---------------- | ---------------- --------------------------------------- | ----------------------- - | -------- | | Sunrise | Oui | Non | - | - | | Swisscom | Oui | Non | Non | Non | | VTX | Oui | Non | - | - |

source: <TabItem value="gbr" label="UK">
fr: <TabItem value="gbr" label="Royaume-Uni">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ---------------- | ------------------------------------------------------- | -------------------------- | -------- | | BT Internet | Yes | - | - | No | | Virgin Media | - | - | No | No | | ZEN Internet | Yes | - | Yes | Yes | | PlusNet | Yes | No | Yes, if you raise a ticket | Small one off Charge |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ---------------- | --------------- ---------------------------------------- | -------------------------- | -------- | | BT Internet | Oui | - | - | Non | | Virgin Media | - | - | Non | Non | | ZEN Internet | Oui | - | Oui | Oui | | PlusNet | Oui | Non | Oui, si vous ouvrez un ticket | Petit supplément à payer |

source: <TabItem value="northamerica">
fr: <TabItem value="Amérique du Nord">

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------- | ---------------- | ------------------------------------------------------- | ------------------------ | ---------------- | | Telus | No. Extra charge | - | - | No. Extra charge | | TekSavvy | Yes | No | - | No. Extra charge |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ---------------- | ---------------- | ------------------------------------------------------ - | ------------------------ | ---------------- | | Telus | Non. Frais supplémentaires | - | - | Non. Frais supplémentaires | | TekSavvy | Oui | Non | - | Non. Frais supplémentaires |

source: <TabItem value="usa" label="USA" default>
fr: <TabItem value="usa" label="États-Unis" default>

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ----------------- | ------------------------------------- | ------------------------------------------------------- | ------------------------ | ---------------------------------- | | Cox | No. Only for business class customer. | No | No | Yes, as a business class customer | | Charter | No. Only for business class customer. | No | No | Yes, as a business class customer | | DSLExtreme | Yes | No | No | Yes, extra charge. | | AT&T | No. Only for business class customer. | unknown. | unknown. | unknown. | | Xfinity (Comcast) | No. Only for business class customer. | unknown. | unknown. | Yes, as a business class customer |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | ----------------- | ----------------------------- -------- | ------------------------------------------------------- | ------------------------ | ------- --------------------------- | | Cox | Non. Uniquement pour les clients professionnels. | Non | Non | Oui, en tant que client professionnel | | Charter | Non. Uniquement pour les clients professionnels. | Non | Non | Oui, en tant que client professionnel | | DSLExtreme | Oui | Non | Non | Oui, moyennant un supplément. | | AT&T | Non. Uniquement pour les clients professionnels. | Inconnu. | Inconnu. | Inconnu. | | Xfinity (Comcast) | Non. Uniquement pour les clients professionnels. | Inconnu. | Inconnu. | Oui, en tant que client professionnel |

source: <TabItem value="southamerica">
fr: <TabItem value="Amérique du Sud">

source: <TabItem value="brazil" label="Brazil" default>
fr: <TabItem value="brazil" label="Brésil" default>

source: | Service provider | Port 25 openable | [Hairpinning](http://en.wikipedia.org/wiki/Hairpinning) | Customizable reverse DNS | Fixed IP | | ---------------------- | ------------------- | ------------------------------------------------------- | ------------------------ | -------- | | Global Village Telecom | No. Only for Fix IP | No | No | Yes, extra charge. |
fr: | Fournisseur de services | Port 25 ouvrable | [Hairpinning](https://fr.wikipedia.org/wiki/Hairpinning) | DNS inversé personnalisable | IP fixe | | --------------------- - | ------------------- | ------------------------------------------------------ - | ------------------------ | -------- | | Global Village Telecom | Non. Uniquement pour les adresses IP fixes | Non | Non | Oui, frais supplémentaires. |

source: <TabItem value="oceania">
fr: <TabItem value="océanie">
