Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__05.methods/*.po
Languages: fr, gl

source: Choose your self-hosting mode
fr: Choisir son mode d'auto-hébergement
gl: Elixe o modo de auto-hospedarte

source: You can host yourself at home (on a small computer), or on a remote server. Each solution has their pros and cons:
fr: Vous pouvez vous auto-héberger à la maison (sur un petit ordinateur), ou sur un serveur distant. Chaque solution a ses avantages et inconvénients :
gl: Podes facelo na túa casa (nunha pequena computadora), ou nun servidor remoto. Cada opción ten vantaxes e inconvintes:

source: At home, for instance on an ARM board or an old computer
fr: À la maison, par exemple sur une carte ARM ou un ancien ordinateur
gl: Na casa, por exemplo nunha placa ARM ou unha computadora antiga

source: You can host yourself at home with an ARM board or a re-purposed regular computer, connected to your home router/box.
fr: Vous pouvez vous héberger chez vous, sur une carte ARM ou un vieil ordinateur, connecté à votre box internet.
gl: Podes auto hospedar no teu fogar cunha placa ARM ou reutilizando unha computadora normal, conectadas ao rúter/modem.

source: - **Pros**: you will have physical control of the machine and only need to buy the hardware; - **Cons**: you will have to [manually configure your internet box](/admin/get_started/post_install/port_forwarding) and [might be limited by your ISP](/admin/get_started/providers/isp/).
fr: - **Avantages** : vous aurez un contrôle physique sur la machine et avez seulement besoin d'acheter le matériel initial ; - **Inconvénients** : il vous faudra [configurer manuellement votre box internet](/admin/get_started/post_install/port_forwarding) et serez possiblement [limité par certains aspects de votre fournisseur d'accès à Internet](/admin/get_started/providers/isp/).
gl: - **Vantaxes**: tes control físico sobre a máquina e só precisas mercar o hardware; - **Contras**: tes que [configurar manualmente o rúter](/admin/get_started/post_install/port_forwarding) e [poderías ter limitacións por parte do teu ISP](/admin/get_started/providers/isp/).

source: At home, behind a VPN
fr: À la maison, derrière un VPN
gl: Na casa, detrás dunha VPN

source: A VPN is an encrypted tunnel between two machines. In practice, it makes it "as if" you were directly, locally, connected to your server machine, but actually from somewhere else on the Internet. This allows you to still host yourself at home, while bypassing possible limitations of your ISP. See also [the Internet Cube project](https://internetcu.be/) and [the FFDN](https://www.ffdn.org/).
fr: Un VPN est un tunnel chiffré entre deux machines. En pratique, cela permet de faire « comme si » une machine était connectée depuis ailleurs. Ceci permet de s'auto-héberger à la maison tout en contournant les limitations du fournisseur d'accès à Internet. Voir aussi [le projet Brique Internet](https://labriqueinter.net/) et [la FFDN](https://www.ffdn.org/).
gl: Unha VPN é un túnel cifrado entre dúas máquinas. Na práctica serve para facer "como se" estiveses directamente, localmente, conectada ao teu servidor, pero en realidade desde calquera parte da internet exterior. Isto permíteche seguir auto hospedando na casa e ao mesmo tempo evitar as posibles limitacións do teu ISP (provedor de internet). Mira o [proxecto Internet Cube](https://internetcu.be/) e [o FFDN](https://www.ffdn.org/).

source: - **Pros**: you will have physical control of the machine, and the VPN hides your traffic from your ISP and allows you to bypass its limitations; - **Cons**: you will have to pay a monthly subscription for the VPN.
fr: - **Avantages** : vous aurez un contrôle physique sur la machine, et le VPN permettra de cacher votre trafic vis-à-vis de votre FAI ainsi que de contourner ses limitations ; - **Inconvénients** : il vous faudra payer des frais mensuels pour le VPN.
gl: - **Vantaxes**: tes control físico sobre a máquina e a VPN oculta o teu tráfico do teu ISP e permite evitar as súas limitacións; - **Contras**: tes que pagar unha subscrición ao provedor da VPN.

source: On a remote server (VPS or dedicated server)
fr: Sur un serveur distant (VPS ou serveur dédié)
gl: Nun servidor remoto (VPS ou servidor dedicado)

source: You can rent a virtual private server or a dedicated machine from [associative](https://db.ffdn.org/) or [commercial](/admin/get_started/providers/servers) "Cloud" providers.
fr: Vous pouvez louer un serveur privé virtuel ou une machine dédiée à des hébergeurs [associatifs](https://db.ffdn.org/) ou [commerciaux](/admin/get_started/providers/servers).
gl: Podes alugar un servidor virtual privado o unha máquina dedicada dunha [asociación](https://db.ffdn.org/) ou un provedor [comercial](/admin/get_started/providers/servers) da "Nube".

source: - **Pros**: your server and its internet connectivity will be fast; - **Cons**: you will have to pay a monthly subscription and won't have physical control of your server.
fr: - **Avantages** : votre serveur sera rapide et la connectivité internet sera bonne ; - **Inconvénients** : il vous faudra payer des frais mensuels pour la machine, et vous n'aurez pas de contrôle physique dessus.
gl: - **Vantaxes**: o teu servidor e a súa conexión a internet serán máis rápidos; - **Contras**: tes que pagar unha subscrición e non tes control físico sobre o teu servidor.

source: Summary
fr: Résumé
gl: Resumo

source: <th style={styleNone}>At home<br/><small>(e.g. ARM board, old computer)</small></th> <th style={styleNone}>At home<br/>behind a VPN</th> <th style={styleNone}>On a remote server<br/>(VPS or dedicated)</th>
fr: <th style={styleNone}>À la maison<br/><small>(par ex. carte ARM, ancien ordinateur)</small></th> <th style={styleNone}>À la maison<br/>derrière un VPN</th> <th style={styleNone}>Sur un serveur distant<br/>(VPS ou serveur dédié)</th>
gl: <th style={styleNone}>No fogar<br/><small>(ex. placa ARM ou computadora antiga)</small></th> <th style={styleNone}>No fogar<br/>detrás dunha VPN</th> <th style={styleNone}>Nun servidor remoto<br/>(VPS ou dedicado)</th>

source: <td style={styleNone}>Hardware cost</td> <td style={styleMeh} colspan="2">About 50€<br/><small>(e.g. a Raspberry Pi)</small></td> <td style={styleGood}>None</td>
fr: <td style={styleNone}>Coût du matériel</td> <td style={styleMeh} colspan="2">Environ 50€<br/><small>(par ex. un Raspberry Pi)</small></td> <td style={styleGood}>Aucun</td>
gl: <td style={styleNone}>Custo do hardware</td> <td style={styleMeh} colspan="2">Sobre 50€<br/><small>(ex. Raspberry Pi)</small></td> <td style={styleGood}>Ningún</td>

source: <td style={styleNone}>Monthly cost</td> <td style={styleGood}>Negligible<br/><small>(electricity)</small></td> <td style={styleMeh}>Around 5€<br/><small>(VPN)</small></td> <td style={styleMeh}>Starting at ~3€<br/><small>(VPS)</small></td>
fr: <td style={styleNone}>Coût mensuel</td> <td style={styleGood}>Négligeable<br/><small>(électricité)</small></td> <td style={styleMeh}>Environ 5 €<br/><small>(VPN)</small></td> <td style={styleMeh}>À partir d'environ 3 €<br/><small>(VPS)</small></td>
gl: <td style={styleNone}>Custo mensual</td> <td style={styleGood}>Mínimo<br/><small>(electricidade)</small></td> <td style={styleMeh}>Sobre 5€<br/><small>(VPN)</small></td> <td style={styleMeh}>Desde ~3€<br/><small>(VPS)</small></td>

source: <td style={styleNone}>Physical control of the machine</td> <td style={styleGood}>Yes</td> <td style={styleGood}>Yes</td> <td style={styleDanger}>No</td>
fr: <td style={styleNone}>Contrôle physique de la machine</td> <td style={styleGood}>Oui</td> <td style={styleGood}>Oui</td> <td style={styleDanger}>Non</td>
gl: <td style={styleNone}>Control físico sobre a máquina</td> <td style={styleGood}>Si</td> <td style={styleGood}>Si</td> <td style={styleDanger}>Non</td>

source: <td style={styleNone}>Manual port routing required</td> <td style={styleMeh}>Yes</td> <td style={styleGood}>No</td> <td style={styleGood}>No</td>
fr: <td style={styleNone}>Routage manuel des ports requis</td> <td style={styleMeh}>Oui</td> <td style={styleGood}>Non</td> <td style={styleGood}>Non</td>
gl: <td style={styleNone}>Xestión manual do enrutamento</td> <td style={styleMeh}>Si</td> <td style={styleGood}>Non</td> <td style={styleGood}>Non</td>

source: <td style={styleNone}>Possible ISP limitations</td> <td style={styleDanger}>Yes<br/><small>(see <Link to="/admin/get_started/providers/isp">here</Link>)</small></td> <td style={styleGood}>Bypassed by VPN</td> <td style={styleGood}>Typically no</td>
fr: <td style={styleNone}>Limitations possibles du FAI</td> <td style={styleDanger}>Oui<br/><small>(voir <Link to="/admin/get_started/providers/isp">ici</Link>)</small></td> <td style={styleGood}>Contourné par VPN</td> <td style={styleGood}>Généralement non</td>
gl: <td style={styleNone}>Posibles limitacións por ISP</td> <td style={styleDanger}>Si<br/><small>(le <Link to="/admin/get_started/providers/isp">isto</Link>)</small></td> <td style={styleGood}>Evitadas coa VPN</td> <td style={styleGood}>Normalmente non</td>

source: <td style={styleNone}>Internet connectivity</td> <td style={styleMeh} colspan="2">Depends on home connectivity</td> <td style={styleGood}>Typically pretty good</td>
fr: <td style={styleNone}>Connectivité Internet</td> <td style={styleMeh} colspan="2">Dépend de la connexion du domicile</td> <td style={styleGood}>Généralement assez bonne</td>
gl: <td style={styleNone}>Conectividade a internet</td> <td style={styleMeh} colspan="2">Depende da conectividade no fogar</td> <td style={styleGood}>Normalmente bastante boa</td>
