Repository: YunoHost/doc
Catalog: i18n/docs/admin/50.troubleshooting__05.fail2ban/*.po
Languages: fr, it

source: IP address unban
fr: Débannir une adresse IP
it: Sbannare un indirizzo IP

source: **Fail2Ban** is an intrusion prevention software that protects computer servers against brute-force attacks. It monitors certain logs and will ban IP addresses that show brute-force-like behavior.
fr: **Fail2Ban** est un logiciel de prévention des intrusions qui protège les serveurs informatiques contre les attaques de brute-force. Il surveille certains journaux et bannira les adresses IP qui montrent un comportement de brute-forcing.
it: **Fail2Ban** è un programma di prevenzione delle intrusioni che protegge i server contro gli attacchi di forza bruta (brute-force), controllando alcuni log e bannando (cioè impedendo ulteriori connessioni) gli indirizzi IP che mostrano questo tipo di comportamento.

source: In particular, **Fail2Ban** monitors `SSH` connection attempts. After 5 failed SSH connection attempts, Fail2Ban will ban the IP address from connecting via SSH for 10 minutes. If this address fails several times, it might get banned for a week.
fr: En particulier, **Fail2Ban** surveille les tentatives de connexion `SSH`. Après 5 tentatives de connexion échouées sur SSH, Fail2Ban banniera l’adresse IP pendant 10 minutes. Si cette adresse récidive plusieurs fois, elle peut être bannie pendant une semaine.
it: In particolare, **Fail2Ban** controlla tentativi di connessione su `SSH`. Dopo cinque tentativi di connessione falliti, Fail2Ban banna l'indirizzo IP impedendogli la connessione SSH per 10 minuti. Se la cosa si ripete altre volte viene bannato per una settimana.

source: Unban an IP address
fr: Débannir une adresse IP
it: Togliere il ban ad un indirizzo

source: To unblock an IP address, you must first access your server by some means (for example from another IP address or from another internet connection than the banned one).
fr: Pour débloquer une adresse IP, vous devez d’abord accéder à votre serveur par un moyen quelconque (par exemple à partir d’une autre adresse IP ou d’une autre connexion internet que celle bannie).
it: Per sbloccare un indirizzo è necessario innanzitutto accedere al server con qualche mezzo (ad esempio da un altro indirizzo IP o da un'altra connessione diversa da quella bannata).

source: Then, look at the **Fail2Ban’s log** to identify in which `jail` the IP address has been banned:
fr: Ensuite, regardez le **journal de Fail2Ban** pour identifier dans quelle `prison` ou `jail` l’adresse IP a été bannie :
it: Dopo di che controlla il **log di Fail2Ban** per trovare in quale `jail` è stato bannato l'indirizzo IP:

source: Here, the `11.22.33.44` IP address has been banned in the `sshd` and `recidive` jails.
fr: Ici, l’adresse IP `11.22.33.44` a été bannie dans les jails `sshd` et `recidive`.
it: In questo esempio l'indirizzo `11.22.33.44` è stato bannato nel `jail` `sshd` e `recidive`.

source: Then deban the IP address with the following commands:
fr: Puis débanissez l’adresse IP avec les commandes suivantes :
it: Quindi togli il ban con il seguente comando:

source: Whitelist an IP address
fr: Passer une adresse IP en liste blanche / whitelist
it: Aggiungere un indirizzo IP alla whitelist

source: If you don’t want a "legitimate" IP address to be blocked by **YunoHost** anymore, then you have to fill it in the whitelist of the `jail` configuration file.
fr: Si vous ne voulez plus qu’une adresse IP « légitime » soit bloquée par **YunoHost**, alors il faut la renseigner dans la liste blanche ou whitelist du fichier de configuration de la `prison`.
it: Se vuoi impedire che un indirizzo IP "legittimo" venga bloccato da **YunoHost** ancora devi compilare la whitelist del file di configurazione della `jail`.

source: When updating the **Fail2Ban** software, the original `/etc/fail2ban/jail.conf` file is overwritten. So it is on a new dedicated file that we will store the changes. They will thus be preserved over time.
fr: Lors d’une mise à jour du logiciel **Fail2Ban**, le fichier d’origine `/etc/fail2ban/jail.conf` est écrasé. C’est donc dans un nouveau fichier que nous allons stocker les modifications. Elles seront ainsi conservées dans le temps.
it: Aggiornando **Fail2Ban** il file `/etc/fail2ban/jail.conf` originale verrà sovrascritto quindi dovremo scrivere questi cambiamenti su un nuovo file che verrà mantenuto.

source: 1. Start by creating the new jail configuration file which will be called `yunohost-whitelist.conf`:
fr: 1. Commencez par créer le nouveau fichier de configuration des prisons qui s’appelera `yunohost-whitelist.conf` :

source: 2. Edit this new file with your favorite editor:
fr: 2. Éditez ce nouveau fichier avec votre éditeur préféré :

source: 3. Paste the following content into the file and adapt the IP address `XXX.XXX.XXX.XXX`:
fr: 3. Coller le contenu suivant dans le fichier et adapter l’adresse IP `XXX.XXX.XXX.XXX` :

source: 4. Save the file and reload the Fail2Ban configuration:
fr: 4. Sauvegardez le fichier et rechargez la configuration de Fail2Ban :

source: Congratulations, no more risks of banning yourself from your own YunoHost server!
fr: Félicitations, plus de risques de se bannir de son propre serveur YunoHost !
it: Congratulazioni, non corrererai più il rischio di essere bannato dal tuo server YunoHost!
