Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__05.domains__dns_local_network/*.po
Languages: fr

source: Local network access to your server
fr: Accéder au serveur par le réseau local

source: After completing your server installation, it is possible that your domain will not be accessible through the local network. This is an issue known as [hairpinning](http://en.wikipedia.org/wiki/Hairpinning) - a feature that is not well supported by some internet routers.
fr: Une fois l'installation de votre serveur terminée, il est possible que votre domaine ne soit pas accessible via le réseau local. Il s'agit d'un problème connu sous le nom de [hairpinning](http://en.wikipedia.org/wiki/Hairpinning), une fonctionnalité qui n'est pas bien prise en charge par certains routeurs Internet.

source: To solve this issue you can:
fr: Pour résoudre ce problème, vous pouvez :

source: - configure your router's DNS - or alternatively - your `/etc/hosts` files on your clients workstation
fr: - configurez le DNS de votre routeur - ou bien - vos fichiers `/etc/hosts` sur le poste de travail de vos clients

source: Find the local IP address of your server
fr: Trouvez l'adresse IP locale de votre serveur

source: First you need to find out the local IP of your server
fr: Vous devez d'abord trouver l'adresse IP locale de votre serveur.

source: - either using the tricks listed [here](/admin/get_started/post_install/find_ip) - or if in the webadmin, in the Diagnosis section, under Internet Connectivity, IPv4, click on 'Details' and you should find an entry for 'Local IP' - or using the command line on the server : `hostname -I`
fr: - soit en utilisant les astuces répertoriées [ici](/admin/get_started/post_install/find_ip) - soit, dans l'interface d'administration Web, dans la section Diagnostic, sous Connectivité Internet, IPv4, cliquez sur 'Détails' et vous devriez trouver une entrée pour 'IP locale' - soit en utilisant la ligne de commande sur le serveur : `hostname -I`

source: Configure DNS on your Internet router
fr: Configurez le DNS sur votre routeur Internet

source: The goal here is to create a network wide redirection handled by your router. The idea is to create a DNS redirection to your server's IP. You should access your router's configuration and look for DNS configuration, then add a redirection to your server's IP (e.g. redirect `yunohost.local` to `192.168.1.21`).
fr: L'objectif ici est de créer une redirection à l'échelle du réseau gérée par votre routeur. L'idée est de créer une redirection DNS vers l'adresse IP de votre serveur. Vous devez accéder à la configuration de votre routeur et rechercher la configuration DNS, puis ajouter une redirection vers l'adresse IP de votre serveur (par exemple, rediriger `yunohost.local` vers `192.168.1.21`).

source: Configure [hosts](https://en.wikipedia.org/wiki/Host_%28Unix%29) file on client workstation
fr: Configurer le fichier [hosts](https://en.wikipedia.org/wiki/Host_%28Unix%29) sur le poste de travail client

source: Modifying hosts file should be done only if you cannot alter your box's DNS or router, because hosts file will only impact the workstation where the file was modified.
fr: La modification du fichier hosts ne doit être effectuée que si vous ne pouvez pas modifier le DNS ou le routeur de votre ordinateur, car le fichier hosts n'aura d'impact que sur le poste de travail où il a été modifié.

source: - Windows hosts file is located at: `%SystemRoot%\system32\drivers\etc\` > You MUST activate hidden and system file display to see the hosts file. - UNIX systems (GNU/Linux, macOS) hosts file is located at: `/etc/hosts` > You MUST have root privileges to modify the file.
fr: - Le fichier hosts de Windows se trouve à l'emplacement suivant : `%SystemRoot%\system32\drivers\etc\` > Vous DEVEZ activer l'affichage des fichiers cachés et système pour voir le fichier hosts. - Le fichier hosts des systèmes UNIX (GNU/Linux, macOS) se trouve à l'emplacement suivant : `/etc/hosts` > Vous DEVEZ disposer des privilèges root pour modifier le fichier.

source: Add a line at the end of the file containing your server private IP followed by a space and your domain name
fr: Ajoutez une ligne à la fin du fichier contenant l'adresse IP privée de votre serveur, suivie d'un espace et de votre nom de domaine.
