Repository: YunoHost/doc
Catalog: i18n/docs/admin/20.users__groups_and_permissions/*.po
Languages: fr

source: <TabItem value="web" label="From the web interface">
fr: <TabItem value="web" label="Depuis la webadmin">

source: <TabItem value="cli" label="From the command line">
fr: <TabItem value="cli" label="Depuis la ligne de commande">

source: Users groups and permissions
fr: Groupes et permissions

source: You can access the *groups and permissions* management interface from the webadmin by going into the 'Users' section and clicking the corresponding button:
fr: Vous pouvez accéder à l'interface de gestion des *groupes et des permissions* depuis l'admin web en allant dans la section "Utilisateurs" et en cliquant sur le bouton correspondant :

source: Managing groups
fr: Gestion des groupes

source: The group mechanism can be used to define groups of users which then can be used to restrict permissions for applications and other services (such as mail or XMPP). Note that it is *not* mandatory to create a group to do so: you can also restrict access to an app or service on a user-per-user basis.
fr: Le mécanisme de groupe peut être utilisé pour définir des groupes d'utilisateurs qui peuvent ensuite être utilisés pour restreindre les autorisations pour les applications et autres services (tels que l'email ou XMPP). Notez qu'il n'est *pas* obligatoire de créer un groupe pour ce faire : vous pouvez également restreindre l'accès à une application ou à un service de manière individuelle.

source: Using groups is however useful for semantics, for example if you host multiple groups of friends, associations or businesses on your server, you might want to create groups like `association1` and `association2` and add members of each association to the relevant group.
fr: L'utilisation de groupes est cependant utile pour la sémantique, par exemple si vous hébergez plusieurs groupes d'amis, des associations ou des entreprises sur votre serveur, vous pouvez créer des groupes comme `association1` et `association2` et ajouter les membres de chaque association au groupe concerné.

source: It's also possible to define mail aliases for a group, such that mails sent to `groupe@domain.tld` will be dispatched to all members of the group.
fr: Il est également possible de définir des alias mail pour un groupe, afin que les mails envoyés à `groupe@domain.tld` soient redirigés vers tous les membres du groupe.

source: Default groups
fr: Groupes par défaut

source: By default, these special groups are created:
fr: Par défaut, deux groupes spéciaux sont créés :

source: The content of those groups cannot be changed, only the permissions given to them.
fr: Vous ne pouvez pas changer le contenu de ces groupes, seulement les permissions qui leur sont accordées.

source: List existing groups
fr: Lister les groupes existants

source: The existing groups are listed at the top of the *groups and permissions* page.
fr: Les groupes existants sont listés en haut de la page *groupes et autorisations*.

source: To list the currently existing groups in CLI :
fr: Pour obtenir la liste des groupes existants en ligne de commande :

source: Creating a new group
fr: Créer un nouveau groupe

source: To create a new group, simply click on the "New Group" button at the top of the page. You may only choose a name formed with letters (uper- and lowercase) and spaces. The group is created empty and without any permission.
fr: Pour créer un nouveau groupe, il suffit de cliquer sur le bouton "Nouveau groupe" en haut de la page. Vous ne pouvez choisir qu'un nom formé de lettres (majuscules et minuscules) et d'espaces. Le groupe est créé vide et sans aucune permission.

source: In CLI, to create a new group called `yolo_crew`
fr: Dans la ligne de commande, pour créer un nouveau groupe appelé `yolo_crew`, il faut utiliser

source: Updating a group
fr: Mettre à jour un groupe

source: Let's add a first to this group: in the group panel, click the button "add a user" and scroll to the desired user, then click on it.
fr: Ajoutons un premier utilisateur à ce groupe : dans le panneau du groupe, cliquez sur le bouton "Ajouter un utilisateur" et faites défiler jusqu'à l'utilisateur souhaité, puis cliquez dessus.

source: To remove a user, click on the cross next to their username, in the group panel.
fr: Pour supprimer un utilisateur, cliquez sur la croix à côté de son nom d'utilisateur, dans le panneau du groupe.

source: In CLI, use the following command to add `charlie` and `delphine`to the `yolo_crew` group:
fr: En ligne de commande, utilisez la commande suivante pour ajouter `charlie` et `delphine` au groupe `yolo_crew` :

source: (similarly, `remove` can be used to remove members from a group)
fr: (De même, `remove` peut être utilisé pour retirer des membres d'un groupe.)

source: Now in the group list we should see:
fr: Dans la liste des groupes, nous devrions voir :

source: Deleting groups
fr: Supprimer un groupe

source: To delete a group, click on the red cross on the top right of the group panel. You will be asked for confirmation.
fr: Pour supprimer un groupe, cliquez sur la croix rouge en haut à droite du panneau du groupes. Une confirmation vous sera demandée.

source: To delete the group `yolo_crew` in CLI, you may run
fr: Pour supprimer le groupe `yolo_crew` en ligne de commande, vous pouvez exécuter :

source: Managing permissions
fr: Gestion des permissions

source: The permission mechanism allow to restrict access to services (for example mail, XMPP...) and apps, or even specific parts of the apps (for example the administration interface of WordPress).
fr: Le mécanisme de permissions permet de restreindre l'accès aux services (par exemple mail, XMPP...) et aux applications, ou même à des parties spécifiques des applications (par exemple l'interface d'administration de WordPress).

source: List permissions
fr: Liste des permissions

source: The groups page lists the permissions given to each group, including the special groups `all_users` and `visitors`.
fr: La page des groupes liste les permissions données à chaque groupe, y compris les groupes spéciaux `all_users` et `visitors`.

source: To list permissions and corresponding accesses in CLI:
fr: Pour répertorier les permissions et les accès correspondants en ligne de commande :

source: Here, we find that all registered users can use email, XMPP, and access the WordPress blog. However, nobody can access the WordPress admin interface.
fr: Ici, nous constatons que tous les utilisateurs enregistrés peuvent utiliser le mail, XMPP, et accéder au blog WordPress. Cependant, personne ne peut accéder à l'interface d'administration de WordPress.

source: More details can be displayed by adding the `--full` option which will display the list of users corresponding to groups allowed, as well as urls associated to a permission (relevant for web apps).
fr: Plus de détails peuvent être affichés en ajoutant l'option `--full` qui affichera la liste des utilisateurs correspondant aux groupes autorisés, ainsi que les adresses web associées à une permission (pertinent pour les applications web).

source: Add accesses to group or users
fr: Ajouter des permissions à un groupe ou un utilisateur

source: To add a permission to a group, simply click the "+" button in the group panel, scroll to the desired permission, then click on it.
fr: Pour ajouter une permission à un groupe, il suffit de cliquer sur le bouton "+" dans le panneau du groupe, de faire défiler jusqu'à la permission souhaitée, puis de cliquer dessus.

source: Note that you can also allow a single user, by using the specific panel at the bottom of the page.
fr: Notez que vous pouvez également autoriser un seul utilisateur, en utilisant le panneau spécifique en bas de la page.

source: To allow a group to access the WordPress admin interface in CLI:
fr: Pour permettre à un groupe d'accéder à l'interface d'administration de WordPress via la ligne de commande :

source: And now we may see that both the YoloCrew and Alice have access to the WordPress admin interface:
fr: Et maintenant, nous pouvons voir que YoloCrew et Alice ont tous deux accès à l'interface d'administration de WordPress :

source: Note that, for example, if we want to restrict permission for email so that only Bob is allowed to email, we should also remove `all_users` from the permission, by deleting it from the `all_users` group panel, or in CLI:
fr: Pour permettre seulement à Bob d'accéder aux emails en ligne de commande :

source: Note that some permissions may be "protected", meaning that you won't be able to add/remove the visitor group to this permission. Generally, this is because it would make no sense (or is a security risk) to do so.
fr: Notez que certaines permissions peuvent être « protégées », ce qui signifie que vous ne pourrez pas les ajouter/enlever du groupe Visiteurs. Ce mécanisme est généralement là car ajouter/enlever la permission n'a pas de sens (ou est un risque de sécurité).

source: The webadmin will issue a warning if you set a permission that is superseded by a wider permission.
fr: La webadmin émettra un avertissement si vous définissez une permission qui est remplacée par une permission plus large.

source: Hide/display specific tiles in the user portal
fr: Montrer/cacher les tuiles dans le portail utilisateur

source: Since YunoHost 4.1, you can choose to hide/display specific tiles in the SSO.
fr: Depuis YunoHost 4.1, il est possible de montrer/cacher certaines tuiles dans le portail.

source: In the webadmin, you can do so by going in the corresponding app view, go in `Manage label and tiles` and check/uncheck the option `Display the tile in the user portal` for the corresponding permission.
fr: Depuis la webadmin, vous pouvez changer cela en allant dans la vue de l'application à manipuler, puis dans `Gérer les étiquettes et les tuiles`, et cocher/décocher l'option `Montrer la tuile dans le portail utilisateur` pour la permission correspondante.

source: In command line, this may be done with:
fr: En ligne de commande, le même genre de chose peut être fait avec :

source: Each group can use mail aliases, but their configuration is only available from the CLI so far. For example, the `admins` group is configured with aliases such as `admins@domain.tld`, `root@domain.tld` ... : mail sent to these addresses will be dispatched to all members of the `admins` group.
fr: Chaque groupe peut utiliser des alias de mail, bien que leur configuration se fasse actuellement uniquement depuis la CLI. Par défaut, le groupe `admins` dispose ainsi de `admins@domain.tld`, `root@domain.tld` ... : les messages envoyés à ces adresses sont redirigés vers tous les membres du groupe `admins`.

source: The command `yunohost user group info` will list them.
fr: L'utilisation de la commande `yunohost user group info` permet de lister tous les alias pour le groupe renseigné.

source: To add a new mail, use the action `add-mailalias` or `remove-mailalias` to delete it.
fr: Il est possible de les ajouter avec l'action `add-mailalias` ou de les enlever avec `remove-mailalias`.
