Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__20.install_on__virtualbox/*.po
Languages: fr

source: <FAIcon icon="fa-list-alt"/> Pre-requisites
fr: <FAIcon icon="fa-list-alt"/> Pré-requis

source: (FIXME: this bit is currently broken...) Optionally, you can [download the project's public key](https://forge.yunohost.org/keys/yunohost_bookworm.asc) to check the authenticity of the images.
fr: (À CORRIGER : cette partie ne fonctionne pas actuellement...) Vous pouvez également [télécharger la clé publique du projet](https://forge.yunohost.org/keys/yunohost_bookworm.asc) pour vérifier l'authenticité des images.

source: <FAIcon icon="fa-rocket"/> Launch the graphical install
fr: <FAIcon icon="fa-rocket"/> Lancer l'installation graphique

source: You should see a screen like this:
fr: Vous devriez voir un écran comme celui-ci :

source: <Figure caption="Preview of the ISO menu" src="/img/softwares/virtualbox_3.png"/>
fr: <Figure caption="Aperçu du menu ISO" src="/img/softwares/virtualbox_3.png"/>

source: <TabItem value="classic" label="Classic installation on a whole disk">
fr: <TabItem value="classic" label="Installation classique sur un disque entier">

source: Once you have validated the keyboard layout, the installation will be launched and will completely erase the data on your hard disk!
fr: Une fois que vous aurez validé la disposition du clavier, l'installation sera lancée et effacera complètement les données présentes sur votre disque dur !

source: 1. Select `Graphical install` 2. Select your language, your location, your keyboard layout, and eventually your timezone. 3. The installer will then download and install all required packages.
fr: 1. Sélectionnez `Installation graphique`. 2. Sélectionnez votre langue, votre emplacement géographique, la disposition de votre clavier et, éventuellement, votre fuseau horaire. 3. Le programme d'installation téléchargera et installera ensuite tous les paquets requis.

source: <TabItem value="expert" label="Installation in expert mode">
fr: <TabItem value="expert" label="Installation en mode expert">

source: The YunoHost project simplified the classic installation as much as possible in order to avoid as many people as possible being lost with questions that are too technical or related to specific cases.
fr: Le projet YunoHost a simplifié autant que possible l'installation standard afin d'éviter que le plus grand nombre possible de personnes ne se perdent dans des questions trop techniques ou liées à des cas spécifiques.

source: With the expert mode installation, you have more possibilities, especially concerning the exact partitioning of your storage media. You can also decide to use the classic mode and [add your disks afterwards](/admin/tutorials/external_storage).
fr: Avec l'installation en mode expert, vous disposez de plus de possibilités, notamment en ce qui concerne le partitionnement précis de vos supports de stockage. Vous pouvez également choisir d'utiliser le mode classique et [ajouter vos disques ultérieurement](/admin/tutorials/external_storage).

source: Summary of the steps in expert mode
fr: Résumé des étapes en mode expert

source: Regarding partitioning
fr: Concernant le partitionnement

source: In general, we recommend against partitioning `/var`, `/opt`, `/usr`, `/bin`, `/etc`, `/lib`, `/tmp` and `/root` on separate partitions. This will prevent you from having to worry about full partitions that could crash your machine, cause app installations to fail, or even corrupt your databases.
fr: En général, nous déconseillons de partitionner `/var`, `/opt`, `/usr`, `/bin`, `/etc`, `/lib`, `/tmp` et `/root` sur des partitions distinctes. Cela vous évitera d'avoir à vous soucier des partitions pleines qui pourraient planter votre machine, entraîner l'échec de l'installation d'applications ou même corrompre vos bases de données.

source: For performance reasons, it is recommended to mount your fastest storage (SSD) on the root `/`.
fr: Pour des raisons de performances, il est recommandé de monter votre stockage le plus rapide (SSD) à la racine `/`.

source: If you have one or more hard drives to store data, you can choose to mount it on one of these folders depending on your usage.
fr: Si vous disposez d'un ou plusieurs disques durs pour stocker des données, vous pouvez choisir de les monter dans l'un de ces dossiers en fonction de votre utilisation.

source: If you want flexibility and don't want to (re)size partitions, you can also choose to mount on `/mnt/hdd` and follow this [tutorial to mount all these folders with `mount --bind`](/admin/tutorials/external_storage).
fr: Si vous souhaitez bénéficier d'une certaine flexibilité et ne souhaitez pas (re)dimensionner les partitions, vous pouvez également choisir de monter sur `/mnt/hdd` et suivre ce [tutoriel pour monter tous ces dossiers avec `mount --bind`](/admin/tutorials/external_storage).

source: About encryption
fr: À propos du chiffrement

source: Be aware that if you encrypt all or part of your disks, you will have to type the passphrase every time you restart your server, which can be a problem if you are not on site. There are however solutions (quite difficult to implement) that allow you to type the passphrase via SSH or via a web page (search for "dropbear encrypted disk").
fr: Sachez que si vous chiffrez tout ou partie de vos disques, vous devrez saisir la phrase secrète à chaque redémarrage de votre serveur, ce qui peut poser problème si vous n'êtes pas sur place. Il existe toutefois des solutions (assez difficiles à mettre en œuvre) qui vous permettent de saisir la phrase secrète via SSH ou via une page web (recherchez "dropbear encrypted disk").

source: About RAID
fr: À propos du RAID

source: Keep in mind that:
fr: Gardez à l'esprit que :

source: - the disks in your RAIDs must be of different brands, wear and tear or batches (especially if they are SSDs) - a RAID 1 (even without a spare) is more reliable than a RAID 5 from a probability point of view - hardware raids are dependent on the raid card, if the card fails you will need a replacement to read and rebuild the array
fr: - les disques de vos RAID doivent être de marques, d'usure ou de lots différents (en particulier s'il s'agit de SSD) - un RAID 1 (même sans disque de secours) est plus fiable qu'un RAID 5 d'un point de vue probabiliste - les RAID matériels dépendent de la carte RAID. Si la carte tombe en panne, vous aurez besoin d'une carte de remplacement pour lire et reconstruire la grappe

source: For testing and debugging purposes
fr: À des fins de test et de débogage

source: In a virtual machine
fr: Dans une machine virtuelle

source: Installing YunoHost in a VirtualBox is usually intended for testing or development. It is not convenient to run an actual server on the long-term, because the machine it's installed on probably won't be up 24/7, and because Virtualbox adds an additional layer of complexity in exposing the machine to the Internet.
fr: L'installation de YunoHost dans VirtualBox est généralement destinée à des fins de test ou de développement. Il n'est pas pratique d'utiliser un serveur réel à long terme, car la machine sur laquelle il est installé ne sera probablement pas disponible 24 heures sur 24, 7 jours sur 7, et parce que Virtualbox ajoute une couche supplémentaire de complexité en exposant la machine à Internet.

source: - An x86 computer with [VirtualBox installed](https://www.virtualbox.org/wiki/Downloads) and enough RAM capacity to be able to run a small virtual machine with 1024MB RAM and 8GB capacity (at least)
fr: - Un ordinateur x86 avec [VirtualBox installé](https://www.virtualbox.org/wiki/Downloads) et une capacité de RAM suffisante pour pouvoir exécuter une petite machine virtuelle avec 1024 Mo de RAM et une capacité de 8 Go (au minimum).

source: <FAIcon icon="fa-download"/> Download the YunoHost image
fr: <FAIcon icon="fa-download"/> Télécharger l'image YunoHost

source: If your host OS is 32 bits, be sure to download the 32-bit image.
fr: Si votre système d'exploitation hôte est en 32 bits, assurez-vous de télécharger l'image 32 bits.

source: Create a new virtual machine
fr: Créer une nouvelle machine virtuelle

source: It's okay if you can only have 32-bit versions, just be sure that you downloaded the 32-bit image previously.
fr: Si vous ne pouvez disposer que de versions 32 bits, ce n'est pas grave, mais assurez-vous d'avoir téléchargé au préalable l'image 32 bits.

source: Tweak network settings
fr: Modifier les paramètres réseau

source: This step is important to properly expose the virtual machine on the network
fr: Cette étape est importante pour exposer correctement la machine virtuelle sur le réseau.

source: Go to **Settings** > **Network**:
fr: Allez dans **Configuration** > **Réseau** :

source: - Select `Bridged adapter` - Select your interface's name: **wlan0** if you are connected wirelessly, or **eth0** otherwise.
fr: - Sélectionnez `Accès par pont` - Sélectionnez le nom de votre interface : **wlpXsX** si vous êtes connecté sans fil, ou **enpXsX** dans le cas contraire.

source: <FAIcon icon="fa-plug"/> Boot up the virtual machine
fr: <FAIcon icon="fa-plug"/> Démarrer la machine virtuelle

source: Start the virtual machine after selecting the YunoHost image.
fr: Démarrez la machine virtuelle après avoir sélectionné l'image YunoHost.

source: If you encounter the error "VT-x is not available", you probably need to enable Virtualization in the BIOS of your computer.
fr: Si vous rencontrez l'erreur "VT-x n'est pas disponible", vous devez probablement activer la virtualisation dans le BIOS de votre ordinateur.

source: 1. Select `Expert graphical install`. 2. Select your language, location, keyboard layout and possibly your timezone. 3. Partition your disks. This is where you can set up a RAID or encrypt all or part of the server. 4. Specify a possible HTTP proxy to use for the installation of the packages 5. Specify on which volumes grub should be installed
fr: 1. Sélectionnez `Installation graphique avancée`. 2. Sélectionnez votre langue, votre emplacement géographique, la disposition de votre clavier et éventuellement votre fuseau horaire. 3. Partitionnez vos disques. C'est ici que vous pouvez configurer un RAID ou chiffrer tout ou partie du serveur. 4. Spécifiez un éventuel proxy HTTP à utiliser pour l'installation des paquets. 5. Spécifiez sur quels volumes grub doit être installé.

source: | Path | Contents | |--------|---| | `/home` | User folders accessible via SFTP | | `/home/yunohost.backup/archives` | YunoHost backups to be placed ideally elsewhere than on the disks that manage the data | | `/home/yunohost.app` | Heavy data from YunoHost applications (nextcloud, matrix...) | | `/home/yunohost.multimedia` | Heavy data shared between several applications | | `/var/mail` | User mail |
fr: | Chemin | Contenu | |--------|---| | `/home` | Dossiers utilisateur accessibles via SFTP | | `/home/yunohost.backup/archives` | Sauvegardes YunoHost à placer idéalement ailleurs que sur les disques qui gèrent les données | | `/home/yunohost.app` | Données lourdes provenant des applications YunoHost (nextcloud, matrix, ...) | | `/home/yunohost/multimedia` | Données volumineuses partagées entre plusieurs applications | | `/var/mail` | Courrier électronique des utilisateurs |

source: If the YunoHost installer fails and you can't solve the issue, know that it's also possible to install Debian and then install YunoHost on top. See [these instructions](/admin/get_started/install_on/on_top_of_debian).
fr: Si l'installateur YunoHost échoue et que vous ne parvenez pas à résoudre le problème, sachez qu'il est également possible d'installer Debian, puis d'installer YunoHost par-dessus. Consultez [ces instructions](/admin/get_started/install_on/on_top_of_debian).
