Repository: YunoHost/doc
Catalog: i18n/docs/admin/42.security/*.po
Languages: fr

source: 🔒 Security
fr: 🔒 Sécurité

source: When thinking and discussing security — whether in the context of YunoHost or any other system —, please keep in mind that security is not a binary state, but an ongoing practice. The term "security" is essentially meaningless without specifying what exactly we are securing against. The 'threats' to consider depend on your context, and can range from automated attacks from bots roaming the Internet, to sophisticated state actors like the NSA, or supply chain vulnerabilities (e.g., compromised software dependencies), or basic risks such as your own users employing overly simple passwords, or your worst enemy from elementary school 20 years ago trying to hack into your server...
fr: Lorsque vous réfléchissez et discutez de la sécurité, que ce soit dans le contexte de YunoHost ou de tout autre système, gardez à l'esprit que la sécurité n'est pas un état binaire, mais une pratique continue. Le terme "sécurité" n'a essentiellement aucun sens sans préciser ce contre quoi nous nous protégeons exactement. Les 'menaces' à prendre en compte dépendent de votre contexte et peuvent aller des attaques automatisées de robots parcourant Internet à des acteurs étatiques sophistiqués comme la NSA, en passant par les vulnérabilités de la chaîne d'approvisionnement (par exemple, les dépendances logicielles compromises) ou les risques élémentaires tels que vos propres utilisateurs utilisant des mots de passe trop simples, ou votre pire ennemi de l'école primaire il y a 20 ans essayant de pirater votre serveur ...

source: YunoHost is developped with security in mind, and designing good tradeoff between security and usability. Here's a non-exhaustive list of security aspects that the project is implementing: - a firewall based on `nftables` to restrict incoming traffic to relevant ports ; - `fail2ban`, a software that automatically rejects traffic from malicious IPs trying to brute force SSH and other services ; - using [Mozilla's recommendations for NGINX, Postfix, Dovecot, SSH ciphers etc.](https://wiki.mozilla.org/Security/Server_Side_TLS) ; - checking that user password/passphrase are not too simple when definining them ; - hashing user passwords (salted SHA512 in LDAP for example) ; - being vigilant on UNIX file/dir permissions accross the whole system ; - apps are typically ran using a dedicated user, and with [restricted capabilities](https://man7.org/linux/man-pages/man7/capabilities.7.html) ; - auto-redacting sensitive informations from YunoHost operation logs and when sharing them with Yunopaste ; - ...
fr: YunoHost est développé dans un souci de sécurité, en recherchant un bon compromis entre sécurité et facilité d'utilisation. Voici une liste non exhaustive des aspects liés à la sécurité que le projet met en œuvre : - un pare-feu basé sur `nftables` pour limiter le trafic entrant aux ports concernés ; - `fail2ban`, un logiciel qui rejette automatiquement le trafic provenant d'adresses IP malveillantes qui tentent de forcer SSH et d'autres services ; - l'utilisation des [recommandations de Mozilla pour NGINX, Postfix, Dovecot, les chiffrements SSH, etc.](https://wiki.mozilla.org/Security/Server_Side_TLS) ; - la vérification que les mots de passe/phrases de passe des utilisateurs ne sont pas trop simples lors de leur définition ; - le hachage des mots de passe des utilisateurs (SHA512 salé dans LDAP par exemple) ; - être vigilant sur les permissions des fichiers/répertoires UNIX sur l'ensemble du système ; - les applications sont généralement exécutées à l'aide d'un utilisateur dédié et avec des [capacités restreintes](https://man7.org/linux/man-pages/man7/capabilities.7.html) ; - supprimer automatiquement les informations sensibles des journaux d'exploitation de YunoHost et lors de leur partage avec Yunopaste ; - ...

source: In addition, the project has mid-term goals to implement: - [password self-reset for users](https://github.com/YunoHost/issues/issues/878) ; - [automatic warnings about vulnerabilities](https://github.com/YunoHost/yunohost/pull/2077) <small>(via the Diagnosis, not via the forum or social media)</small> ; - supporting [OIDC](https://github.com/YunoHost/yunohost/pull/2149) and [2FA](https://github.com/YunoHost/issues/issues/238) ; - better support for SSH keys, in particular [making them configurable from the webadmin](https://github.com/YunoHost/issues/issues/175) ; - further constrain and limit application capabilities to only what they need (cf. packaging v3) ; - ...
fr: En outre, le projet a des objectifs à moyen terme afin de mettre en œuvre : - [la réinitialisation automatique du mot de passe pour les utilisateurs](https://github.com/YunoHost/issues/issues/878) ; - [l'alerte automatique en cas de vulnérabilité](https://github.com/YunoHost/yunohost/pull/2077) <small>(via le Diagnostic, et non via le forum ou les réseaux sociaux)</small> ; - la prise en charge de [OIDC](https://github.com/YunoHost/yunohost/pull/2149) et [2FA](https://github.com/YunoHost/issues/issues/238) ; - une meilleure prise en charge des clés SSH, en particulier [en les rendant configurables depuis l'administrateur web](https://github.com/YunoHost/issues/issues/175) ; - restreindre et limiter davantage les capacités des applications à ce dont elles ont besoin (cf. packaging v3) ; - ...

source: <FAIcon icon="fa-shield"/> To discuss security flaws in YunoHost, contact the [project's security team](/community/security_team).
fr: <FAIcon icon="fa-shield"/> Pour discuter des failles de sécurité dans YunoHost, contactez l'équipe de sécurité du projet.

source: Basic security advices
fr: Conseils de sécurité de base

source: Security is not a one-time setup, it's an active, ongoing practice. Here are some basic practice that you should implement:
fr: La sécurité n'est pas une configuration ponctuelle, c'est une pratique active et continue. Voici quelques pratiques de base que vous devriez mettre en œuvre :

source: Using stupidly simple passwords is arguably the number one reason why servers get "hacked". You and your users using reasonably complex passwords/passphrases is the basis of any good security.
fr: L'utilisation de mots de passe stupidement simples est sans doute la principale raison pour laquelle les serveurs sont "piratés". L'utilisation de mots de passe/phrases de passe raisonnablement complexes par vous-même et vos utilisateurs est la base de toute bonne sécurité.

source: 1. as an admin, forget traditional passwords. *[Use reasonably complex **passphases**](https://imgs.xkcd.com/comics/password_strength_2x.png)*. Learn about password managers. 2. keep your server and apps **reasonably up to date**. Consider using the [unattended upgrades](https://apps.yunohost.org/app/unattended_upgrades) app for automatic upgrades ; 3. be aware that **each app you install is an additional "attack surface"**. Ideally, check the security reputation of every app you install. **Do not** just install random apps and then forget about them. Uninstall apps that you no longer use ; 4. only create accounts for people that you have some amount of trust into, in particular that they will use **decent passwords/passphrases** and decent security hygiene in general ; 5. **regularly check the forum and social media** (e.g. [YunoHost's Mastodon account](https://toot.aquilenet.fr/@yunohost)) to stay informed when vulnerabilities are discovered or important fixes are released.
fr: 1. En tant qu'administrateur, oubliez les mots de passe traditionnels. *[Utilisez des **phrases de passe** raisonnablement complexes](https://imgs.xkcd.com/comics/password_strength_2x.png)*. Renseignez-vous sur les gestionnaires de mots de passe. 2. Maintenez votre serveur et vos applications **raisonnablement à jour**. Envisagez d'utiliser l'application [unattended upgrades](https://apps.yunohost.org/app/unattended_upgrades) pour les mises à jour automatiques ; 3. Sachez que **chaque application que vous installez constitue une "surface d'attaque" supplémentaire**. Idéalement, vérifiez la réputation en matière de sécurité de chaque application que vous installez. **Ne vous contentez pas** d'installer des applications au hasard pour ensuite les oublier. Désinstallez les applications que vous n'utilisez plus ; 4. ne créez des comptes que pour les personnes en qui vous avez une certaine confiance, en particulier celles qui utilisent des **mots de passe/phrases de passe décents** et qui ont une bonne hygiène de sécurité en général ; 5. **Consultez régulièrement le forum et les réseaux sociaux** (par exemple, [le compte Mastodon de YunoHost](https://toot.aquilenet.fr/@yunohost)) pour rester informé lorsque des vulnérabilités sont découvertes ou que des correctifs importants sont publiés.

source: The following sections describe possible ways to further harden the security of your server.
fr: Les sections suivantes décrivent les moyens possibles pour renforcer davantage la sécurité de votre serveur.

source: SSH authentication via key
fr: Authentification via une clé SSH

source: By default, the SSH authentication uses the administration password. Deactivating this kind of authentication and replacing it by a key mechanism is advised.
fr: Par défaut, l'authentification SSH utilise le mot de passe d'administration. Il est conseillé de désactiver ce type d'authentification et de le remplacer par un mécanisme à clé.

source: **On your client**:
fr: **Sur votre client** :

source: If you run into permissions issues, set `username` as owner of the dir `~/.ssh` with `chown`. Be careful, for security reasons this directory should be in mode `700`. If you are on Ubuntu 16.04 you should run `ssh-add` to initialize the SSH agent.
fr: Si vous rencontrez des problèmes d'autorisations, définissez `username` comme propriétaire du répertoire `~/.ssh` avec `chown`. Attention, pour des raisons de sécurité, ce répertoire doit être en mode `700`. Si vous utilisez Ubuntu 16.04, vous devez exécuter `ssh-add` pour initialiser l'agent SSH.

source: Type your admnistration password and your key will be copied onto your server.
fr: Saisissez votre mot de passe administrateur et votre clé sera copiée sur votre serveur.

source: **On your server**, editing the SSH configuration file to deactivate password authentication is handled by a system setting:
fr: **Sur votre serveur**, la modification du fichier de configuration SSH pour désactiver l'authentification par mot de passe est gérée par un paramètre système :

source: Never close your current SSH connection before checking that your alterations work. Test your new configuration by opening a new terminal or window. That way, you can undo your alterations if anything goes wrong.
fr: Ne fermez jamais votre connexion SSH actuelle avant d'avoir vérifié que vos modifications fonctionnent. Testez votre nouvelle configuration en ouvrant un nouveau terminal ou une nouvelle fenêtre. Ainsi, vous pourrez annuler vos modifications si quelque chose ne fonctionne pas.

source: Using a custom port for SSH
fr: Utilisation d'un port personnalisé pour SSH

source: To prevent SSH connection attempts by robots that scan the internet for any server with SSH enabled, you can change the SSH port. This is handled by a system setting, which takes care of updating the SSH and Fail2Ban configuration.
fr: Pour empêcher les tentatives de connexion SSH par des robots qui scannent Internet à la recherche de serveurs sur lesquels SSH est activé, vous pouvez modifier le port SSH. Cette opération est gérée par un paramètre système qui se charge de mettre à jour la configuration SSH et Fail2Ban.

source: Note that changing the port is still useful even if you've disabled password authentication, because that significantly reduces noise from brute force attempts in SSH logs.
fr: Notez que changer de port reste utile même si vous avez désactivé l'authentification par mot de passe, car cela réduit considérablement le bruit provenant des tentatives de "brute force" dans les journaux SSH.

source: If you manually modify anything in the SSH server configuration (`/etc/ssh/sshd_config`), YunoHost's regen-conf mechanism will no longer automatically update this file. For this reason, always use the YunoHost admin tools to make changes to the systems configuration files!
fr: Si vous modifiez manuellement quoi que ce soit dans la configuration du serveur SSH (`/etc/ssh/sshd_config`), le mécanisme regen-conf de YunoHost ne mettra plus automatiquement à jour ce fichier. Pour cette raison, utilisez toujours les outils d'administration YunoHost pour apporter des modifications aux fichiers de configuration du système !

source: **For subsequent SSH connections**, you need to add the `-p` option followed by the SSH port number.
fr: **Pour les prochaines connexions SSH**, vous devez ajouter l'option `-p` suivie du numéro de port SSH.

source: Hardening cipher used by NGINX, SSH, Dovecot, Postfix
fr: Durcissement du chiffrement utilisé par NGINX, SSH, Dovecot, Postfix

source: The default TLS configuration for services tends to offer good compatibility to support old devices. You can tune this policy for specific services like SSH and NGINX. By default, the NGINX configuration follows the [intermediate compatibility recommendation](https://wiki.mozilla.org/Security/Server_Side_TLS#Intermediate_compatibility_.28default.29) from Mozilla. You can choose to switch to the 'modern' configuration which uses more recent security recommendations, **at the cost of decreasing compatibility**, which may be an issue for your users and visitors using older devices. More details about compatibility can be found on [this page](https://wiki.mozilla.org/Security/Server_Side_TLS#Modern_compatibility).
fr: La configuration TLS par défaut pour les services offre généralement une bonne compatibilité avec les anciens appareils. Vous pouvez ajuster cette politique pour des services spécifiques tels que SSH et NGINX. Par défaut, la configuration NGINX suit les [recommandations de compatibilité intermédiaire](https://wiki.mozilla.org/Security/Server_Side_TLS#Intermediate_compatibility_.28default.29) de Mozilla. Vous pouvez choisir de passer à la configuration 'moderne' qui utilise des recommandations de sécurité plus récentes, **au détriment d'une compatibilité réduite**, ce qui peut poser problème pour vos utilisateurs et visiteurs utilisant des appareils plus anciens. Vous trouverez plus de détails sur la compatibilité sur [cette page](https://wiki.mozilla.org/Security/Server_Side_TLS#Modern_compatibility).

source: Changing the compatibility level is not definitive and can be reverted if it doesn't fit with your environment.
fr: La modification du niveau de compatibilité n'est pas définitive et peut être annulée si elle ne convient pas à votre environnement.

source: **On your server**, change the policy for NGINX
fr: **Sur votre serveur**, modifiez la politique pour NGINX.

source: **On your server**, change the policy for SSH
fr: **Sur votre serveur**, modifiez la politique pour SSH.

source: Disabling the YunoHost API
fr: Désactivation de l'API YunoHost

source: YunoHost administration is accessible through an **HTTP API**, which is the API used by the webadmin. This may be an additional, unecessary attack surface if you are not planning to use it. In this case, you can disable the corresponding service entirely via command line:
fr: L'administration de YunoHost est accessible via une **API HTTP**, qui est l'API utilisée par l'administrateur web. Cela peut constituer une surface d'attaque supplémentaire et inutile si vous ne prévoyez pas de l'utiliser. Dans ce cas, vous pouvez désactiver complètement le service correspondant via la ligne de commande :

source: This will completely disable both YunoHost's API and the web administration panel that relies on it. Proceed only if you are comfortable with exclusively using the command line from now on.
fr: Cela désactivera complètement l'API de YunoHost et le panneau d'administration web qui en dépend. Ne continuez que si vous êtes à l'aise avec l'utilisation exclusive de la ligne de commande à partir de maintenant.

source: As `yunohost-api` is now disabled and not running, Diagnosis will report an error. This error can be ignored using:
fr: Comme `yunohost-api` est désormais désactivé et ne fonctionne plus, le Diagnostic signalera une erreur. Cette erreur peut être ignorée à l'aide de :
