Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__05.domains__dns_subdomains/*.po
Languages: fr

source: Subdomains
fr: Sous-domaines

source: DNS and subdomains for the applications
fr: DNS et sous-domaines pour les applications

source: YunoHost allows the use of subdomains. If one owns a domain name `mydomain.com`, one first needs to create the subdomains in the DNS configuration (with one's registrar like Gandi).
fr: YunoHost permet l'utilisation de sous-domaines. Si l'on possède un nom de domaine `mydomain.com`, il faut d'abord créer les sous-domaines dans la configuration DNS (auprès de son fournisseur de nom de domaine/registrar, tel que Gandi).

source: Configuration example with Gandi
fr: Exemple de configuration avec Gandi

source: The DNS configuration needs an A record with an IPv4 address, an AAAA record with an IPv6 address, and various CNAME records, one for each desired subdomain.
fr: La configuration DNS nécessite un enregistrement A avec une adresse IPv4, un enregistrement AAAA avec une adresse IPv6 et divers enregistrements CNAME, un pour chaque sous-domaine souhaité.

source: If your DNS configuration looks like:
fr: Si votre configuration DNS ressemble à ceci :

source: then you can access `agenda.mydomain.com`, `blog.mydomain.com` and `rss.mydomain.com` subdomains.
fr: vous pouvez alors accéder aux sous-domaines `agenda.mydomain.com`, `blog.mydomain.com` et `rss.mydomain.com`.

source: Install an application on a subdomain
fr: Installer une application sur un sous-domaine

source: To install an application on a subdomain in YunoHost, for example `blog.mydomain.com`, the configuration is done in the administration panel. One first add the subdomain to the available domains list. The creation of a subdomain in YunoHost will create the corresponding configuration files for NGINX (the web server used in YunoHost).
fr: Pour installer une application sur un sous-domaine dans YunoHost, par exemple `blog.mydomain.com`, la configuration s'effectue dans le panneau d'administration. Il faut d'abord ajouter le sous-domaine à la liste des domaines disponibles. La création d'un sous-domaine dans YunoHost créera les fichiers de configuration correspondants pour NGINX (le serveur web utilisé dans YunoHost).

source: Then, in the applications>install panel, one follows the classic installation process by choosing the desired subdomain as domain (for example `blog.mydomain.com`). One needs to choose the path `/` (in place of `/wordpress` for example). A warning message will appear telling that it won't be possible to install other application to this subdomain. After validation, the installation starts.
fr: Ensuite, dans le panneau applications>installation, on suit le processus d'installation classique en choisissant le sous-domaine souhaité comme domaine (par exemple `blog.mydomain.com`). Il faut choisir le chemin `/` (à la place de `/wordpress` par exemple). Un message d'avertissement apparaîtra indiquant qu'il ne sera pas possible d'installer d'autres applications sur ce sous-domaine. Après validation, l'installation commencera.

source: The application is then available at `blog.mydomain.com` (and not `mydomain.com/wordpress`).
fr: L'application est alors disponible à l'adresse `blog.mydomain.com` (et non `mydomain.com/wordpress`).

source: Moving an application to a subdomain
fr: Déplacer une application vers un sous-domaine

source: What happens if the application is already installed? For example, one wants to move `mydomain.com/wordpress` to `blog.mydomain.com`. It depends on the application. Some applications allow the change of domain. In that case, one can proceed to the change through the administration panel: Applications > the_app_name > change URL. If the application doesn't allow URL change, then there is no easy way to do it. The best solution is to reinstall the application.
fr: Que se passe-t-il si l'application est déjà installée ? Par exemple, vous souhaitez déplacer `mydomain.com/wordpress` vers `blog.mydomain.com`. Cela dépend de l'application. Certaines applications permettent de changer de domaine. Dans ce cas, vous pouvez procéder au changement via le panneau d'administration : Applications > nom_de_l'application > changer l'URL. Si l'application ne permet pas de changer l'URL, il n'y a pas de moyen simple de le faire. La meilleure solution est de réinstaller l'application.

source: Reinstalling an application
fr: Réinstaller une application

source: First, save the application data through the backup process. Then uninstall the application with the administration panel. Then reinstall the application to the desired domain. Finally, restore the backup.
fr: Commencez par sauvegarder les données de l'application via le processus de sauvegarde. Désinstallez ensuite l'application à l'aide du panneau d'administration. Réinstallez ensuite l'application sur le domaine souhaité. Enfin, restaurez la sauvegarde.
