Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__20.install_on__wsl/*.po
Languages: fr

source: <FAIcon icon="fa-list-alt"/> Pre-requisites
fr: <FAIcon icon="fa-list-alt"/> Pré-requis

source: Experimental, for people who like cyberfrankensteins
fr: Expérimental, pour ceux qui aiment les cyberfrankensteins

source: On WSL
fr: Sur WSL

source: This setup is mainly meant for local testing by advanced users. Due to limitations on WSL's side (changing IP address, notably), selfhosting from it can be tricky and will not be described here.
fr: Cette configuration est principalement destinée aux tests locaux par des utilisateurs avancés. En raison des limitations de WSL (notamment le changement d'adresse IP), l'auto-hébergement à partir de celui-ci peut s'avérer délicat et ne sera pas décrit ici.

source: - Windows 10 and above - Administration rights - Windows Subsystem for Linux, installed from the Optional Features menu of Windows - *Recommended:* Windows Terminal (Preview) app, installed from the Microsoft Store. Much better than the standard Terminal, as it offers shortcuts to the WSL distros.
fr: - Windows 10 et versions ultérieures - Droits d'administration - Sous-système Windows pour Linux, installé à partir du menu Fonctionnalités facultatives de Windows - *Recommandé :* application Windows Terminal (Preview), installée à partir du Microsoft Store. Bien meilleure que le terminal standard, car elle offre des raccourcis vers les distributions WSL.

source: WSL is a nice feature of Windows 10, making Linux pseudo-distributions available through command line. Let's say pseudo, because even though they are not really like virtual machines, they rely on virtualization capacities that make their integration with Windows almost seamless. Docker for Windows can now rely on WSL instead of Hyper-V, for example.
fr: WSL est une fonctionnalité intéressante de Windows 10 qui permet d'utiliser des pseudo-distributions Linux via la ligne de commande. Nous parlons ici de pseudo-distributions, car même si elles ne sont pas vraiment comparables à des machines virtuelles, elles s'appuient sur des capacités de virtualisation qui rendent leur intégration à Windows presque transparente. Docker pour Windows peut désormais s'appuyer sur WSL plutôt que sur Hyper-V, par exemple.

source: Bear in mind, this setup itself is *not* a container of any kind. If something breaks, there is no rollback capability. You may need to delete the Debian distro altogether and restore it whole.
fr: Gardez à l'esprit que cette configuration *n'est en aucun cas* un conteneur de quelque sorte que ce soit. Si quelque chose ne fonctionne plus, il n'y a aucune possibilité de restauration. Vous devrez peut-être supprimer complètement la distribution Debian et la restaurer dans son intégralité.

source: Install Debian
fr: Installer Debian

source: Let's install YunoHost into its own distro, not altering the default one. In a PowerShell terminal:
fr: Installons YunoHost dans sa version telle qu'elle est distribuée, sans la modifier et en gardant celle par défaut. Et cela dans un terminal PowerShell :

source: You can now access it: run `wsl.exe -d YunoHost`
fr: Vous pouvez désormais y accéder en exécutant : `wsl.exe -d YunoHost`

source: It is under Debian 9 Stretch, so let's upgrade it:
fr: Il s'agit de Debian 9 Stretch, donc mettons-la à jour :

source: Prevent WSL from tweaking configuration files
fr: Empêcher WSL de modifier les fichiers de configuration

source: Edit `/etc/wsl.conf` and put the following code in it:
fr: Modifiez le fichier `/etc/wsl.conf` et ajoutez-y le code suivant :

source: Force the use of iptables-legacy
fr: Forcer l'utilisation d'iptables-legacy

source: YunoHost now uses nftables, these instructions might be out of date.
fr: YunoHost utilise désormais nftables, ces instructions sont peut-être obsolètes.

source: Somehow the YunoHost post-installation does not like `nf_tables`, the new software replacing `iptables`. We can still explicitely use the good ol' `iptables` though:
fr: Pour une raison quelconque, la post-installation de YunoHost n'apprécie pas `nf_tables`, le nouveau logiciel qui remplace `iptables`. Nous pouvons toutefois continuer à utiliser explicitement le bon vieux `iptables` :

source: Install Systemd
fr: Installer Systemd

source: Debian on WSL does not have `systemd`, a service configuration software. This is a key element for YunoHost, and for any decent Debian distro (seriously MS, what the heck). Let's install it:
fr: Debian sur WSL ne dispose pas de `systemd`, un gestionnaire de configuration de services. Il s'agit d'un élément clé pour YunoHost, et pour toute distribution Debian digne de ce nom (sérieusement MS, c'est quoi ce caillon). Installons-le :

source: 1. Install dotNET runtime:
fr: 1. Installez le runtime dotNET :

source: 2. Install [Genie](https://github.com/arkane-systems/genie):
fr: 2. Installez [Genie](https://github.com/arkane-systems/genie) :

source: Install YunoHost
fr: Installer YunoHost

source: Access the command line
fr: Accéder à la ligne de commande

source: Always call `genie -s` while starting your distro.
fr: Appelez toujours `genie -s` lors du démarrage de votre distribution.

source: Backup and restore the distro
fr: Sauvegarder et restaurer la distribution

source: Make your first distro backup
fr: Effectuez votre première sauvegarde de la distribution

source: As said before, there is no rollback capability. So let's export your fresh distro. In PowerShell:
fr: Comme indiqué précédemment, il n'existe aucune fonctionnalité de restauration. Exportons donc votre nouvelle distribution. Dans PowerShell :

source: In case of crash, delete and restore the whole distro
fr: En cas de panne, supprimez et restaurez l'intégralité de la distribution
