Repository: YunoHost/doc
Catalog: i18n/docs/admin/40.backups__15.clone_filesystem/*.po
Languages: it

source: YunoHost's backup tool only backs up useful files and relies on restore scripts to reinstall the dependencies of your applications. In other words, YunoHost's mechanism amounts to reinstalling and then reincorporating the data.
it: Lo strumento di backup di YunoHost salva solamente i files utili e si basa su degli script di ripristino per reinstallare le dipendenze dei vostri programmi installati. In altre parole, il ripristino di YunoHost prevede in un primo tempo la reinstallazione del sistema e in seguito il ripristino dei dati.

source: Making full system images can be a complementary or alternative way to backup your machine. The advantage is that your system can be restored to the exact state it was in at the time of the backup.
it: Realizzare un'immagine completa può essere un metodo, complementare o alternativo, per un backup del vostro server. Il vantaggio sta nel fatto che il vostro server può essere ripristinato nella stessa configurazione presente al momento del backup.

source: Depending on your type of installation, you can either create a snapshot or clone the storage medium by removing it from your server (turned off).
it: In base a quale tipo di installazione avete, potrete creare uno snapshot oppure clonare il supporto che ospita il sistema (mentre è spento).

source: Creating a snapshot
it: Eseguire uno snapshot

source: A snapshot allows you to freeze an image of the file system. Snapshots are very useful when doing an update or testing, because they allow you to easily go back in case of a glitch. On the other hand, apart from some very high availability clusters, snapshots do not really protect you against hardware failures or disasters (cf. OVH fire in Strasbourg in 2021).
it: Lo snapshot permette di congelare l'immagine del file system. Gli snapshot sono molto comodi in caso di aggiornamenti frequenti o di prove, perché vi permettono di tornare facilmente sui vostri passi in caso di problemi. Purtroppo, a meno di non avere un cluster ad altissima affidabilità, gli snapshot non vi proteggono efficacemente contro i guasti hardware o catastrofi (come l'incendio di OVH a Strasburgo nel 2021).

source: In general, snapshots are quite disk space saving, the principle is that your file system will store the differences that occurred since your snapshot. Thus, only the modifications consume space.
it: Generalmente gli snapshot non occupano molto spazio sull'hard disk, si basano sul principio del backup differenziale, salvano cioè solo le variazioni dei file avvenute dopo la creazione del primo snapshot. Di conseguenza solo le modifiche prendono spazio.

source: Remember to delete the old snapshots to avoid wasting your storage space by storing all the differences since that date!
it: Ricordatevi di cancellare i vecchi snapshot, eviterete di consumare inutilmente spazio con backup differenziali troppo datati!

source: You can use this method with most VPS (often paying), virtual machine managers or if you have installed YunoHost with an advanced filesystem like btrfs, ceph or ZFS, you can also create snapshots via the command line
it: Potete usare questo sistema con la maggior parte dei fornitori VPS (quasi sempre a pagamento), nei programmi di gestione di macchine virtuali oppure, se avete installato YunoHost con un filesystem avanzato quale btrfs, ceph o ZFS potrete creare gli snapshot da riga di comando.

source: Below, some documentation for the most known suppliers:
it: Sotto la documentazione per i provider più conosciuti:

source: Select the virtual machine and click `Snapshots`, then specify the snapshot name and click `OK`. ![The snapshot button is located at the top right](/img/softwares/virtualbox-snapshot2.webp)
it: Seleziona la macchina virtuale e clicca su `Snapshot`, poi indica il nome dello snapshot e clicca `OK`. ![Il bottone per gli snapshot button si trova in alto a destra](/img/softwares/virtualbox-snapshot2.webp)

source: To restore, select the virtual machine, click on `Snapshots` then `Restore Snapshot option`.
it: Per ripristinare, selezionate la macchina virtuale, cliccate su`Snapshots` poi scegliete `Restore Snapshot option`.

source: Then click on `Restore Snapshot`.
it: Infine cliccate su `Restore Snapshot`.

source: Below we consider that `/pool/volume` is the volume to snapshot.
it: Nell'esempio seguente `/pool/volume` è il volume da salvare.

source: Create a read-only snapshot
it: Creare uno snapshot in sola lettura

source: List snapshots
it: Elencare gli snapshots

source: Restore a snapshot
it: Ripristinare uno snapshot

source: Delete a snapshot
it: Cancellare uno snapshot

source: Be careful not to delete the original volume
it: Attenzione a non cancellate il volume originale

source: See [this tutorial](https://www.linux.com/training-tutorials/how-create-and-manage-btrfs-snapshots-and-rollbacks-linux-part-2/) for more info
it: Seguite [questo tutorial](https://www.linux.com/training-tutorials/how-create-and-manage-btrfs-snapshots-and-rollbacks-linux-part-2/) per maggiori informazioni

source: Below we consider that `pool/volume` is the volume to snapshot.
it: Nell'esempio seguente `pool/volume` è il volume che vogliamo salvare

source: Create a snapshot
it: Creare uno snapshot

source: Create a cold image of the file system
it: Creare una immagine a freddo del server

source: You can clone your media (SD card, ssd disk, VPS volume...) to create a disk image. This image before compression will be the exact size of your media, that's why this method applies rather to machines of less than 64GB.
it: Potete clonare il supporto del vostro server (scheda SD, disco SSD, volume di un VPS...) al fine di creare una immagine del disco. L'immagine creata, prima che venga compressa, sarà della stessa dimensione del vostro supporto e di conseguenza questa procedura è consigliata per supporti di capacità inferiore a 64GB.

source: Unless you can read a snapshot, this method requires you to stop the server while you create the image. With a VPS, you have to restart in rescue mode from your provider's interface.
it: Questo metodo comporta lo spegnimento del server per il tempo necessario alla creazione dell'immagine, eccetto nel caso che possiate usare uno snapshot come origine. Se il server YunoHost è ospitato su un VPS dovrete riavviarlo in modalità rescue dall'interfaccia del vostro provider.

source: This can be done with [USBimager](https://bztsrc.gitlab.io/usbimager/) (Note: make sure you download the 'Read-write' version! Not the 'Write-only' version!). The process then consists of the "reverse" of the SD card flashing process:
it: Questo può essere fatto con il programma [USBimager](https://bztsrc.gitlab.io/usbimager/) (N.B.: assicuratevi di scaricare la versione 'Read-write'! Non la versione 'Write-only'!). Il processo poi prosegue "all'opposto" della copia sulla scheda SD:

source: More details in [USBimager documentation](https://gitlab.com/bztsrc/usbimager/#creating-backup-image-file-from-device)
it: Maggiori informazioni [nella documentazione di USBimager](https://gitlab.com/bztsrc/usbimager/#creating-backup-image-file-from-device)

source: It is possible to achieve the same thing with `dd` if you are comfortable with the command line:
it: Se siete avezzi al terminale potete ottenere lo stesso risultato con il comando `dd`

source: (replace `/dev/mmcblk0` with the real name of your SD card or hard drive)
it: dove `/dev/mmcblk0` sarà il vostro supporto (scheda SD o disco).
