Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__40.post_install__15.port_forwarding/*.po
Languages: fr

source: Make your server accessible from outside your home
fr: Rendre accessible son serveur depuis l'extérieur

source: Configure port-forwarding
fr: Configurer la redirection des ports

source: If you are self-hosting at home and without a VPN, you will probably want to forward ports on your home router ("Internet box") if you want your server to be reachable from outside your local network. The sketch below tries to briefly summarize the role and necessity of port forwarding when setting up a server at home.
fr: Si vous vous auto-hébergez à la maison et sans VPN, il vous faut rediriger les ports de votre routeur ("machin-box") si vous souhaitez que votre serveur puisse être contacté depuis l'extérieur de votre réseau local. Le schéma ci-dessous tente d'expliquer brièvement le rôle de la redirection des ports lors de la mise en place d'un serveur à la maison.

source: <Figure caption="Illustration of the importance of port-forwarding" src="/img/portForwarding_en.png" />
fr: <Figure caption="Illustration de l’importance de la redirection des ports" src="/img/portForwarding_en.png" />

source: 0. Diagnose ports opened
fr: 0. Diagnostiquer les ports ouverts

source: The diagnosis tool can be used to verify that all necessary ports are exposed to the Internet.
fr: L'outil de diagnostic peut être utilisé pour vérifier que tous les ports nécessaires sont exposés sur Internet.

source: 1. Access your box/router administration interface
fr: 1. Accéder à l'interface d'administration de votre box/routeur

source: Your box/router admin interface is usually reachable via [http://192.168.0.1](http://192.168.0.1) or [http://192.168.1.1](http://192.168.1.1). Then, you will probably need to authenticate yourself the credentials given by your internet server provider.
fr: L'interface d'administration est généralement accessible via [http://192.168.0.1](http://192.168.0.1) ou [http://192.168.1.1](http://192.168.1.1). Ensuite, il vous faudra peut-être vous authentifier avec les identifiants fournis par votre fournisseur d'accès à Internet (FAI).

source: 2. Find the local IP of your server
fr: 2. Trouver l'IP locale de votre serveur

source: Identify the *local* IP of your server using one of the method listed [on the corresponding page](/admin/get_started/post_install/find_ip).
fr: Identifiez quelle est l'IP *locale* de votre serveur en utilisant l'une des méthodes listées sur [la page correspondante](/admin/get_started/post_install/find_ip).

source: A local IP address typically looks like `192.168.xx.yy`, or `10.0.xx.yy`.
fr: Une adresse IP locale ressemble généralement à `192.168.xx.yy`, ou `10.0.xx.yy`.

source: The local IP address needs to be static, so that the port forwards that you are going to configure in the next step will always reach your server. You should go into your box/router and make sure that the local IP address of your server is static instead of dynamic.
fr: L'adresse IP locale doit être statique afin que les redirections de port que vous allez configurer à l'étape suivante puissent toujours atteindre votre serveur. Vous devez accéder à votre box/routeur et vous assurer que l'adresse IP locale de votre serveur est statique et non dynamique.

source: 3. Forwarding ports
fr: 3. Rediriger les ports

source: In your router admin interface, look for something like "router configuration" or "port forwarding". The naming differs among the various kinds of router models.
fr: Dans l'interface d'administration de votre box/routeur, il vous faut trouver une catégorie comme "Configuration du routeur", ou "Redirections de ports". Le nom diffère suivant le type / marque de la box.

source: Opening the ports listed below is necessary for the various services available in YunoHost to work. For each of them, the 'TCP' forwarding is needed. Some interfaces refer to 'external' and 'internal' ports: these are the same in our case.
fr: Il vous faut ensuite rediriger chacun des ports listés ci-dessous vers l'IP locale de votre serveur pour que les différents services de YunoHost fonctionnent. Pour chacun d'eux, une redirection 'TCP' est nécessaire. Certaines interfaces font référence à un port « externe » et un port « interne » : dans notre cas il s'agit du même.

source: If you use both a modem and a router, then you need to do the following:
fr: Si vous utilisez à la fois un modem et un routeur, vous devez procéder comme suit :

source: 1. first on the modem (the box closest to the internet) create rules to forward the above ports to your router; 2. then on the router (the box between the modem and your devices) create rules to forward the above ports to the static IP address for your server.
fr: 1. Commencez par créer des règles sur le modem (le boîtier le plus proche d'Internet) afin de rediriger les ports ci-dessus vers votre routeur. 2. Créez ensuite des règles sur le routeur (le boîtier situé entre le modem et vos appareils) afin de rediriger les ports ci-dessus vers l'adresse IP statique de votre serveur.

source: <FAIcon icon="fa-exclamation-triangle"/> Many internet service providers (ISP) block outgoing traffic on port 25 by default, to fight spam. Port 25 is however necessary if you want your server to be able to send email. In other extreme cases, some ISP may not even allow to use port 80/443 (web) freely... Depending on the ISP, it might be possible to open them in the admin interface... Check [this page](/admin/get_started/providers/isp/) for more info.
fr: <FAIcon icon="fa-exclamation-triangle"/> Certains fournisseurs d'accès à Internet bloquent le port 25 (mail SMTP) par défaut pour combattre le spam. Le port 25 est pourtant nécessaire si vous souhaitez que votre serveur puisse envoyer de emails. Dans certains cas extrême , votre FAI peut même ne pas vous laisser utiliser librement les port 80/443 (web). En fonction de votre FAI, il peut être possible d'ouvrir ces ports dans l'interface... Voir [cette page](/admin/get_started/providers/isp/) pour plus d'informations.
