Repository: YunoHost/doc
Catalog: i18n/docs/admin/80.advanced__40.torhiddenservice/*.po
Languages: fr

source: Configure Tor Hidden Service
fr: Configurer le service caché Tor

source: Using YunoHost as a Tor Hidden Service
fr: Utilisation de YunoHost comme service caché Tor

source: This tuto is not finished ! Some data could leak with this setup like the main domain of your YunoHost, so it's not a "Hidden Service". See [The official Tor hidden service documentation](https://www.torproject.org/docs/tor-hidden-service.html.en).
fr: Ce tuto n'est pas terminé ! Certaines données pourraient fuiter avec cette configuration, comme le domaine principal de votre YunoHost, ce n'est donc pas un "service caché". Consultez [la documentation officielle sur les services cachés Tor](https://www.torproject.org/docs/tor-hidden-service.html.en).

source: Installing Tor
fr: Installation de Tor

source: Configuring our hidden service
fr: Configurer notre service caché

source: Edit `/etc/tor/torrc`, and add these lines:
fr: Modifiez `/etc/tor/torrc` et ajoutez les lignes suivantes :

source: Restart Tor
fr: Redémarrer Tor

source: Get your Tor Hidden Service hostname
fr: Obtenez le nom d'hôte de votre service caché Tor

source: Your domain looks like *random123456789.onion*
fr: Votre domaine devrait ressembler à *random123456789.onion*

source: Add the .onion domain to YunoHost
fr: Ajouter le domaine .onion à YunoHost

source: Avoid SSO redirection (optional)
fr: Éviter la redirection SSO (facultatif)

source: If you want to avoid being redirected to the SSO portal at login, you can deactivate SSOwat for this specific tor domain, by editing the file `/etc/nginx/conf.d/random123456789.onion.conf` and commenting the following line (two times):
fr: Si vous souhaitez éviter d'être redirigé vers le portail SSO lors de la connexion, vous pouvez désactiver SSOwat pour ce domaine tor spécifique, en modifiant le fichier `/etc/nginx/conf.d/random123456789.onion.conf` et en commentant la ligne suivante (deux fois) :

source: Check for errors in NGINX configuration
fr: Vérifiez s'il y a des erreurs dans la configuration NGINX

source: Restart NGINX
fr: Redémarrer NGINX
