Repository: YunoHost/doc
Catalog: po4a/admin/20.users__index/*.po
Languages: fr

source: 👥 Accounts and app portal
fr: 👥 Comptes et portail

source: Users
fr: Comptes

source: Users are human being who have access to applications and other services on your server. The administrator can add and manage users through the web administration (in the User category) or through the command line (see `yunohost user --help`). After that, users obtain a personal email address (chosen by the admin), and can log in the user portal to access applications they have permissions over and configure other parameters.
fr: Les comptes permettent aux utilisateurices sont les êtres humains qui ont accès aux applications et autres services sur votre serveur. L'administrateur peut ajouter et gérer des comptes via l'administration web (dans la catégorie Utilisateurs) ou via la catégorie `yunohost user` de la ligne de commande. Après cela, les utilisateurs obtiennent une adresse e-mail personnelle (choisie par l'administrateur), et peuvent se connecter au portail utilisateur (SSO) pour accéder aux applications pour lesquelles ils ont des permissions et configurer d'autres paramètres.

source: The first user created also automatically gets email aliases `root@main.domain.tld` and `admin@main.domain.tld`, such that mail sent to these addresses will end up in the first user's mailbox.
fr: Le premier utilisateur créé reçoit aussi automatiquement les alias email `root@main.domain.tld` et `admin@main.domain.tld`, de sorte que le courrier envoyé à ces adresses se retrouvera dans la boîte aux lettres de cet utilisateur.

source: You should be careful about who you give your server access to. In terms of security, this largely increase the attack surface for someone who wants to mess with the server one way or another.
fr: Vous devriez faire attention à qui vous donnez l'accès à votre serveur. En termes de sécurité, cela augmente considérablement la surface d'attaque pour quelqu'un qui veut perturber le serveur d'une manière ou d'une autre.

source: The user portal, or SSO
fr: Le portail utilisateur, ou SSO

source: ![User panel screenshot](/img/user_panel.jpg) The user portal, also called the SSO for 'Single Sign On' allows user to browse easily between the different apps they have access to. In particular, the term 'Single Sign On' comes from the fact that user only need to log in the portal to automatically be logged to all apps that require authentication (or at least those who are integrated with the SSO/LDAP, since this is sometimes technically complicated or not possible at all).
fr: ![Capture d'écran du portail utilisateur](/img/user_panel.jpg) Le portail utilisateur, également appelé SSO pour 'Single Sign On', permet aux utilisateur⋅ice⋅s de naviguer facilement entre les différentes applications auxquelles ils ont accès. En particulier, le terme 'Single Sign On' vient du fait qu'il n'est nécessaire de se connecter au portail qu'une seule fois pour être automatiquement connecté à toutes les applications qui nécessitent une authentification (ou du moins celles qui sont intégrées avec le SSO/LDAP, car cela est parfois techniquement compliqué ou pas possible du tout).

source: In the portal, users can also click on the avatar in the top-left to configure some other settings such as their identify, mail aliases, automatic mail forwards, or change their password.
fr: Dans le portail, les utilisateurs peuvent également cliquer sur l'avatar en haut à gauche pour configurer d'autres paramètres tels que leur identité, les alias de messagerie, les transferts automatiques de courrier ou leur mot de passe.

source: You should be aware that the SSO can only be reached through the actual domain name (i.e. `https://the.domain.tld/yunohost/sso`), and NOT by just using the IP of the server (i.e. `https://11.22.33.44/yunohost/sso`), contrarily to the webadmin ! This is a bit confusing but is necessary for technical reason. If you are in a situation where you need to access the SSO without having your DNS properly configured for some reason, you might consider tweaking your `/etc/hosts` as described in [this page](/admin/tutorials/domains/dns_local_network).
fr: Vous devez être conscient que le SSO ne peut être atteint que par le nom de domaine (c.-à-d. `https://the.domain.tld/yunohost/sso`), et non pas en utilisant l'IP du serveur (c.-à-d. `https://11.22.33.44/yunohost/sso`), contrairement à la webadmin ! C'est un peu déroutant dans certaines situations, mais c'est nécessaire pour des raisons techniques. Si vous êtes dans une situation où vous avez besoin d'accéder au SSO sans avoir votre DNS correctement configuré pour une raison quelconque, vous pouvez envisager de modifier votre `/etc/hosts` comme décrit dans [cette page](/admin/tutorials/domains/dns_local_network).

source: Creating new users
fr: Créer de nouveau comptes utilisateurs

source: Only the administrator can create new users. From the webadmin, open the `Users` menu and click on the `+ New user` main button. Fill in all the whole form.
fr: Uniquement les membres du groupe admin peuvent créer de nouveaux comptes. Depuis la webadmin, dans la section "Comptes", cliquer sur "+ Nouveau compte" puis remplir le formulaire.

source: User groups and permissions
fr: Groupes de comptes et permissions

source: See [this dedicated page](/admin/users/groups_and_permissions).
fr: Voir [la page dédiée](/admin/users/groups_and_permissions).

source: SSH access
fr: Accès SSH

source: See [this dedicated page](/admin/command_line).
fr: Voir [cette page de documentation dédiée](/admin/command_line).
