Repository: YunoHost/doc
Catalog: i18n/docs/admin/55.upgrade__12.0-bookworm__05.issues_faq/*.po
Languages: fr

source: Apps which won't be automatically repaired and need a force upgrade:
fr: Ces applications ne seront pas réparées automatiquement et nécessiteront une mise à niveau forcée :

source: Note: This issue should be resolved in `yunohost_version`: `4.4.2.13` You have an app that depends on the `build-essential` package.
fr: Remarque : ce problème devrait être résolu dans `yunohost_version` : `4.4.2.13` Vous disposez d'une application qui dépend du paquet `build-essential`.

source: See this [solution](https://forum.yunohost.org/t/migration-to-11-wont-start-libc6-dev-breaks-libgcc-8-dev/20617/42) to fix it manually
fr: Consultez cette [solution](https://forum.yunohost.org/t/migration-to-11-wont-start-libc6-dev-breaks-libgcc-8-dev/20617/42) pour le corriger manuellement.

source: DNSmasq is not running anymore
fr: DNSmasq ne fonctionne plus

source: We haven't yet found solution for this issue.
fr: Nous n'avons pas encore trouvé de solution à ce problème.

source: No ethernet connexion after rebooting following a migration on a Raspberry Pi 4
fr: Pas de connexion Ethernet après redémarrage suite à une migration sur un Raspberry Pi 4

source: We found this in the Raspberry Pi documentation
fr: Nous avons trouvé ceci dans la documentation du Raspberry Pi.

source: > when the dhcpcd5 package is updated to the latest version (1:8.1.2-1+rpt1 -> 1:8.1.2-1+rpt2), the Raspberry Pi will fail to obtain a DHCP IP address following the next reboot or startup. This problem can be avoided by disabling and re-enabling the "System Options -> Network at Boot" option using the latest raspi-config after the dhcpcd5 package has been updated and prior to the system being shutdown or rebooted
fr: > Lorsque le paquet dhcpcd5 est mis à jour vers la dernière version (1:8.1.2-1+rpt1 -> 1:8.1.2-1+rpt2), le Raspberry Pi ne parvient pas à obtenir une adresse IP DHCP après le redémarrage suivant ou au démarrage. Ce problème peut être évité en désactivant puis en réactivant l'option "System Options -> Network at Boot" (Options système -> Réseau au démarrage) à l'aide de la dernière version de raspi-config après la mise à jour du paquet dhcpcd5 et avant l'arrêt ou le redémarrage du système.

source: If you are using a Raspberry Pi 4 (or maybe 3), see this [solution](https://forum.yunohost.org/t/aucun-acces-a-internet-suite-a-migration-4-4-to-11-depuis-raspberry-pi-4-pi-400/20652/17)
fr: Si vous utilisez un Raspberry Pi 4 (ou peut-être un RPi 3), consultez cette [solution](https://forum.yunohost.org/t/aucun-acces-a-internet-suite-a-migration-4-4-to-11-depuis-raspberry-pi-4-pi-400/20652/17).

source: Restore ynh4 backup onto a fresh ynh11
fr: Restaurer la sauvegarde ynh4 sur un nouveau ynh11

source: If you can't restore your app but your system has been restored, you probably should use the regen conf to fix the nginx issues:
fr: Si vous ne parvenez pas à restaurer votre application mais que votre système a été restauré, vous devriez probablement utiliser regen conf pour résoudre les problèmes nginx :

source: Migration isues FAQ
fr: FAQ sur les problèmes rencontrés lors de la migration

source: This page lists all the known issues encountered after a migration from YunoHost 11 to 12.
fr: Cette page répertorie tous les problèmes connus rencontrés après une migration de YunoHost 11 vers 12.

source: If the suggested solutions don't work, please [ask for help](/community/help).
fr: Si les solutions proposées ne fonctionnent pas, veuillez [demander de l'aide](/community/help).

source: Python apps
fr: Les applications Python

source: After upgrading, some python apps should be unavailable because their virtual environment (venv) needs to be rebuilt.
fr: Après la mise à niveau, certaines applications Python pourraient ne plus être disponibles, car leur environnement virtuel (venv) doit être reconstruit.

source: To do that you can run the pending migrations in `Webadmin > Update`.
fr: Pour ce faire, vous pouvez exécuter les migrations en attente dans la webadmin `Outils > Migrations`.

source: In addition, the apps below won't be automatically repaired, you need to force-upgrade them manually instead, with `yunohost app upgrade -F APP`.
fr: De plus, les applications ci-dessous ne seront pas réparées automatiquement. Vous devez les mettre à jour manuellement à l'aide de la commande `yunohost app upgrade -F APP`.

source: - **borgserver** and all its instances (eg. `borgserver__2`, `borgserver__3`, ...) - **borg** ([Borg on the app store](https://apps.yunohost.org/app/borg)) : rebuilt using `yunohost app upgrade -F borg` (otherwise, will sent emails notifying that "The backup miserably failed to backup", with error `ModuleNotFoundError: No module named 'borg'`)
fr: - **borgserver** et toutes ses instances (par exemple, `borgserver__2`, `borgserver__3`, ...) - **borg** ([Borg sur l'App Store](https ://apps.yunohost.org/app/borg)) : reconstruit à l'aide de `yunohost app upgrade -F borg` (sinon, des e-mails seront envoyés pour signaler que "La sauvegarde a lamentablement échoué", avec l'erreur `ModuleNotFoundError : No module named 'borg'`)

source: TODO: list those apps
fr: À FAIRE : recenser ces applications

source: FIXME:??!!! If needed, you can disable the automatic rebuild for a specific python app, by removing the dedicated file ending with `.requirements_backup_for_bullseye_upgrade.txt` before applying the migration. You can find this file near the venv (Python virtual environment) of your app inside `/var/www`.
fr: FIXME : ??!!! Si nécessaire, vous pouvez désactiver la reconstruction automatique pour une application Python spécifique, en supprimant le fichier dédié se terminant par `.requirements_backup_for_bullseye_upgrade.txt` avant d'appliquer la migration. Vous trouverez ce fichier près du venv (environnement virtuel Python) de votre application dans `/var/www`.

source: Error 500 everywhere
fr: Erreur 500 partout

source: The web server, nginx, might need a restart before being fully operational. Please run this command:
fr: Le serveur web, nginx, peut nécessiter un redémarrage avant d'être pleinement opérationnel. Veuillez exécuter cette commande :

source: Mailman3 failed in diagnostics
fr: Mailman3 a échoué lors du diagnostic

source: A manual change in a configuration file is needed for Mailman3 to work, see [the relevant issue](https://github.com/YunoHost-Apps/mailman3_ynh/issues/48#issuecomment-2536194377).
fr: Une modification manuelle dans un fichier de configuration est nécessaire pour que Mailman3 fonctionne, voir [le problème correspondant](https://github.com/YunoHost-Apps/mailman3_ynh/issues/48#issuecomment-2536194377).

source: <!-- ### Can't run the migration due to `libc6-dev : Breaks: libgcc-8-dev issue`
fr: <!-- ### Impossible d'exécuter la migration en raison de `libc6-dev : Breaks : libgcc-8-dev issue`

source: f you have not yet rebooted your server, don't do it (we are looking for a solution). This will avoid you the use of a keyboard and screen.
fr: Si vous n'avez pas encore redémarré votre serveur, ne le faites pas (nous recherchons une solution). Cela vous évitera de devoir utiliser un clavier et un écran.

source: After that you should be able to restore your apps. Don't forget to force upgrade them if you have 502 errors. -->
fr: Après cela, vous devriez pouvoir restaurer vos applications. N'oubliez pas de forcer leur mise à jour si vous obtenez des erreurs 502. -->
