Repository: YunoHost/doc
Catalog: i18n/docs/admin/35.email__10.migration/*.po
Languages: it

source: Migrate emails to YunoHost
it: Spostare le proprie mail da un server terzo a YunoHost

source: *[Documentation linked to YunoHost email](/admin/email)*.
it: *[Documentazione integrativa del paragrafo relativo alle email di YunoHost](/admin/email)*.

source: Migration of emails from one server to another can be done with two recommended tools: ImapSync or Larch.
it: La migrazione delle proprie mail verso il proprio server YunoHost, può avvenire attraverso l'utilizzo di due programmi appositi : ImapSync o Larch.

source: This tool must be installed on your desktop computer. The transfer method looks at this schema:
it: Questi programmi dovranno essere installati su un pc che funge da client. La procedura di migrazione rispecchia lo schema seguente:

source: **`Old email server −> desktop computer with ImapSync or Larch −> new email server`**
it: **`Attuale server email −> pc client con installati ImapSync o Larch −> nuovo server email (YunoHost)`**

source: [ImapSync site](http://imapsync.lamiral.info/)
it: [Sito web di ImapSync](http://imapsync.lamiral.info/)

source: Install ImapSync on your client computer by following this [guide](http://imapsync.lamiral.info/INSTALL):
it: Installate ImapSync sul pc client seguendo questa [guida](http://imapsync.lamiral.info/INSTALL) :

source: Transfer emails from one server to another:
it: Spostate le mail dal vecchio al nuovo server:

source: Note that transfer settings `--port 993` and `--ssl` are specific to YunoHost email server.
it: I parametri di migrazione `--port 993` e `--ssl` sono specifici di un server mail YunoHost.

source: [Larch site](https://github.com/rgrove/larch/)
it: [Sito web di Larch](https://github.com/rgrove/larch/)

source: After beforehand installed `gem`, install `larch` on your client computer:
it: Installate `gem`, e in seguito installate `larch` sul pc client :

source: For other types of transfer refer to [Larch documentation](https://github.com/rgrove/larch#label-Usage).
it: Per altre tipologie di migrazione, fate riferimento alla [guida di Larch](https://github.com/rgrove/larch#label-Usage).
