Repository: YunoHost/doc
Catalog: i18n/docs/admin/35.email__index/*.po
Languages: de, es, fr, it

source: 📬 Emails
fr: 📬 Courriels

source: YunoHost comes with a complete mail stack allowing you to host your own email server, and therefore to have your own email addresses in `something@your.domain.tld`.
de: YunoHost wird mit einem kompletten Mail-Stack geliefert, der es Ihnen ermöglicht, Ihren eigenen E-Mail-Server zu hosten und somit Ihre eigenen E-Mail-Adressen in `irgendjemand@deine.domain.tld` zu haben.
es: YunoHost integra un ecosistema completo de servidor mail, permitiéndote de alojar tu propia mensajería electrónica, y pues de tener tus propias direcciones email en `algo@tu.dominio.tld`.
fr: YunoHost est livré avec un écosystème complet de serveur mail, vous permettant d'héberger votre propre serveur de messagerie, et donc d'avoir vos propres adresses email dans le style `quelquechose@votre.domaine.tld`.
it: YunoHost include un completo server mail, avrete quindi il controllo della vostra posta elettronica con il vostro nome di dominio.

source: The mail stack includes a SMTP server (postfix), an IMAP server (Dovecot), an antispam (rspamd) and DKIM configuration.
de: Der Mail-Stack enthält einen SMTP-Server (Postfix), einen IMAP-Server (Dovecot), einen Antispam-Server (rspamd) und eine DKIM-Konfiguration.
es: Este ecosistema comprende un servidor SMTP (postfix), un servidor IMAP (Dovecot), un antispam (rspamd) y una configuración DKIM.
fr: Cet écosystème comprend un serveur SMTP (postfix), un serveur IMAP (Dovecot), un antispam (rspamd) et une configuration DKIM.
it: Questo ecosistema comprende un server SMTP (postfix), un server IMAP (Dovecot), un antispam (rspamd) e una configurazione DKIM.

source: Making sure your setup is right
de: Sicherstellen dass Ihre Einrichtungen richtig sind
es: Asegurarse de que la configuración esté correcta
fr: S'assurer que votre configuration est correcte
it: Assicurare una corretta configurazione

source: Email is a complicated ecosystem and quite a few details can prevent it from working properly.
de: E-Mail ist ein kompliziertes Ökosystem und eine ganze Reihe von Details können sein ordnungsgemäßes Funktionieren verhindern.
es: Los emails son un ecosistema complicado y una multitud de detalles puedes impedir que funcionen correctamente.
fr: Les emails sont un écosystème compliqué et un grand nombre de détails peuvent les empêcher de fonctionner correctement.
it: La posta elettronica è un ecosistema complesso con un numero elevato di dettagli, che se mal configurati, possono impedire il suo corretto funzionamento.

source: To validate your setup:
de: Um Ihre Einstellungen zu validieren:
es: Para validar que tu configuración es correcta :
fr: Pour valider que votre configuration est correcte :
it: Per assicurarsi una configurazione corretta:

source: - if you are self-hosting at home and not using a VPN, ensure [your ISP won't block port 25](/admin/get_started/providers/isp/) ; - route ports according to [this documentation](/admin/get_started/post_install/port_forwarding) ; - carefully configure mail DNS records according to [this documentation](/admin/get_started/post_install/dns_config) ; - test your configuration using the diagnostic features (<HighlightWebAdmin/> → <HighlightDiagnosis/> → <Highlight no_break={true} color='grey'><FAIcon icon="fa-envelope"/> Email</Highlight> ). You can also use [mail-tester.com](https://mail-tester.com), a score of at least 8~9/10 is a reasonnable goal <small>(be careful : only 3 tests per domain per day are allowed)</small>
fr: - si vous hébergez vous-même chez vous et n'utilisez pas de VPN, assurez-vous que [votre FAI ne bloque pas le port 25](/admin/get_started/providers/isp/) ; - redirigez les ports conformément à [cette documentation](/admin/get_started/post_install/port_forwarding) ; - configurez soigneusement les enregistrements DNS de messagerie conformément à [cette documentation](/admin/get_started/post_install/dns_config) ; - testez votre configuration à l'aide des fonctionnalités de diagnostic (<HighlightWebAdmin/> → <HighlightDiagnosis/> → <Highlight no_break={true} color='grey'><FAIcon icon="fa-envelope"/> Email</Highlight> ). Vous pouvez également utiliser [mail-tester.com](https://mail-tester.com), un score d'au moins 8~9/10 est un objectif raisonnable <small>(attention : seuls 3 tests par domaine et par jour sont autorisés)</small>.

source: Email clients
de: E-Mail-Programme
es: Clientes de mensajería
fr: Clients de messagerie
it: Programmi (client) per la posta elettronica

source: To interact with the email sever (read and send emails), you can either install a webclient such as Roundcube or Rainloop on your server - or configure a desktop/mobile client as described in [this page](/admin/email/clients).
de: Um mit dem E-Mail-Server zu interagieren (E-Mails lesen und senden), können Sie entweder einen Webclient wie Roundcube oder Rainloop auf Ihrem Server installieren - oder einen Desktop-/Mobil-Client, wie auf [dieser Seite](/admin/email/clients) beschrieben, konfigurieren.
es: Para interactuar con el servidor de mail, o sea leer y mandar emails, puedes instalar un cliente web como Roundcube o Rainloop en tu servidor - o configurar un cliente de Desktop o móvil como descrito en [esta página](/admin/email/clients).
fr: Pour interagir avec le serveur de mail, c'est-à-dire lire et envoyer des emails, vous pouvez soit installer un client web comme Roundcube ou Rainloop sur votre serveur, soit configurer un client de bureau ou mobile comme décrit dans [cette page](/admin/email/clients).
it: Per interagire con il vostro server mail, ricevere e inviare le mail, potete installare un client web come Roundcube o Rainloop sul vostro server, oppure configurare un client su pc o smartphone, come descritto [in questa pagina](/admin/email/clients).

source: Desktop and mobile clients have the advantage of copying your emails to the device, allowing offline viewing and relative protection against possible hardware failures of your server.
de: Desktop- und Mobil-Clients haben den Vorteil, dass sie Ihre E-Mails auf das Gerät kopieren, was eine Offline-Anzeige und einen relativen Schutz gegen mögliche Hardware-Ausfälle Ihres Servers ermöglicht.
es: Los clientes Desktop o móvil tienen la ventaja de copiar tu emails en el equipo, así permitiendo la consulta desconectada de tus mensajes, y cierta protección frente a la posibilidad de un servidor averiado.
fr: Les clients de bureau ou mobile ont l'avantage de copier vos emails sur l'équipement permettant ainsi la consultation hors ligne et une protection relative face à d'éventuelles pannes matérielles de votre serveur.
it: I client sul pc e smartphone godono del vantaggio di scaricare i messaggi sul device, permettendo la consultazione dei messaggi anche off line e una parziale protezione dalla perdita dei messaggi in caso di guasti al vostro server.

source: Configuring email aliases and auto-forwards
de: Konfigurieren von E-Mail-Aliasen und automatische Weiterleitungen
es: Configuration de los aliases de mensajeras y de las redirecciones automáticas
fr: Configuration des alias de messagerie et des redirections automatiques
it: Configurazione degli alias e degli inoltri automatici

source: Mail aliases and forwards can be configured for each users. For instance, the first user created on the server automatically has an alias `root@the.domain.tld` configured - meaning that an email sent to this address will end in the inbox of the first user. Automatic forwards may be configured, for instance if an user doesn't want to configure an additional email account and just wants to receive emails from the server on, say, his/her gmail address (a copy of each mail will be kept on the Yunohost server).
fr: Des alias de messagerie et des redirections peuvent être configurés pour chaque utilisateur. Par exemple, le premier utilisateur créé sur le serveur dispose automatiquement d'un alias `root@votre.domaine.tld` - ce qui signifie qu'un email envoyé vers cette adresse se retrouvera dans la boîte de réception de cet utilisateur. Les redirections automatiques peuvent être configurées, par exemple si un utilisateur ne veut pas configurer un compte de messagerie supplémentaire et souhaite simplement recevoir des courriels du serveur sur, disons, son adresse Gmail (une copie de chaque e-mail sera conservée sur le serveur Yunohost).

source: Another feature which few people know about is the use of suffixes beginning with "+". For example, emails sent to `johndoe+booking@the.domain.tld` will automatically land in the `booking` dir (lowercase) of John Doe's mailbox or in John Doe's inbox if `booking` directory doesn't exist . It is a practical technique for example to provide an e-mail address to a website, then easily sort (via automatic filters) the mail coming from this website.
de: Eine weitere Funktion, die nur wenigen Leuten bekannt ist, ist die Verwendung von Suffixen, die mit "+" beginnen. Zum Beispiel landen E-Mails, die an `johndoe+buchung@die.domain.tld` gesendet werden, automatisch im Ordner `buchung` (Kleinbuchstaben) der Mailbox von John Doe oder im Posteingang von John Doe, wenn der Ordner `buchung` nicht existiert. Es ist eine praktische Technik, z.B. eine E-Mail-Adresse auf einer Website anzugeben und dann die von dieser Website kommende E-Mail einfach (über automatische Filter) zu sortieren.
es: Otra función desconocida es el uso del sufijo "+". Por ejemplo, email mandados a `johndoe+sncf@tu.dominio.tld` llegarán en el directorio 'sncf' del buzón de correo de John Dos (o directamente en el buzón si este directorio no existe). Es una técnica práctica que permite proveer una dirección de mail a un sitio y automatizar la clasificación de los correos que te mandará este sitio.
fr: Une autre fonctionnalité méconnue est l'utilisation de suffixes commencant par "+". Par exemple, les emails envoyés à `johndoe+sncf@votre.domaine.tld` atteriront dans le dossier 'sncf' de la boîte mail de John Doe (ou bien directement dans la boîte mail si ce dossier n'existe pas). C'est une technique pratique pour, par exemple, fournir une adresse mail à un site puis facilement trier (via des filtres automatiques) les courriers venant de ce site.
it: Una funzione non molto conosciuta riguarda l'utilizzo dei suffissi contrassegnati con il simbolo "+".Ad esempio le mail inviate all'indirizzo `johndoe+sncf@mio.dominio.tld` finiranno nella cartella 'sncf' dell'account di John Doe (oppure semplicemente in Posta in Arrivo se la cartella 'sncf' non esiste). Questa funzione permette di ricevere le mail direttamente nella cartella di destinazione.

source: Groups also can use alias features, by default the group `admins` has aliases such as `root@<domain.tld>` and `webmaster@<domain.tld>`. [More info on the groups and permission page](/admin/users/groups_and_permissions).
fr: Les groupes peuvent également utiliser des alias. Par défaut, le groupe `admins` dispose d'alias tels que `root@<domain.tld>` et `webmaster@<domain.tld>`. [Plus d'informations sur la page consacrée aux groupes et aux autorisations](/admin/users/groups_and_permissions).

source: What happens if my server becomes unavailable?
de: Was passiert wenn mein Server nicht erreichbar ist?
es: ¿ Qué ocurre si mi servidor se pone indisponible ?
fr: Que se passe-t-il si mon serveur devient indisponible ?
it: Cosa succede se il mio server è irraggiungibile?

source: If your server becomes unavailable, emails sent to your server will stay in a pending queue on the sender's side for as long as ~5 days. The sender's host will regularly try to resend the email, until it drops it if it was unable to send it.
de: Wenn Ihr Server nicht mehr verfügbar ist, bleiben die an Ihren Server gesendeten E-Mails bis zu ~5 Tage lang in einer Warteschlange auf der Seite des Absenders. Der Hoster des Absenders wird regelmäßig versuchen, die E-Mail erneut zu senden, bis er sie verwirft, falls er sie nicht versenden konnte.
es: Si tu servidor se pone indisponible, los correos electrónicos mandados a tu servir se quedarán en una fila de espera por el lado del expedidor durante aproximadamente 5 días. El proveedor de hosting del expedidor intentará mandarte regularmente el correo, hasta que lo tire si no lo puede enviar.
fr: Si votre serveur devient indisponible, les courriels envoyés à votre serveur resteront dans une file d'attente du côté de l'expéditeur pendant environ 5 jours. L'hébergeur de l'expéditeur tentera régulièrement de renvoyer le courrier, jusqu'à ce qu'il le jette s'il n'a pas pu l'envoyer.
it: Se il vostro server diventa non più raggiungibile le mail inviate al vostro server rimarranno in una lista di attesa nel server che vi ha spedito la mail per un periodo di circa 5 giorni. Il server proverà ad intervalli regolari ad inviare la mail. Passati i 5 giorni la mail viene cancellata.

source: See also
fr: Voir aussi

source: - [Removing your server’s IP/domain from antispam listings](/admin/troubleshooting/blacklist_forms). - [Migrating from an email provider to a YunoHost instance](/admin/email/migration) - [Configuring an SMTP relay](/admin/tutorials/email_configure_relay).
fr: - [Supprimer l'adresse IP/le domaine de votre serveur des listes antispam](/admin/troubleshooting/blacklist_forms). - [Migrer d'un fournisseur de messagerie vers une instance YunoHost](/admin/email/migration) - [Configurer un relais SMTP](/admin/tutorials/email_configure_relay).

source: Mail aliases and forwards can be configured for each users. For instance, the first user created on the server automatically has an alias `root@the.domain.tld` configured - meaning that an email sent to this address will end in the inbox of the first user. Automatic forwards may be configured, for instance if an user doesn't want to configure an additional email account and just wants to receive emails from the server on, say, his/her gmail address.
de: Mail-Aliase und Weiterleitungen können für jeden Benutzer konfiguriert werden. Beispielsweise wird für den ersten, auf dem Server angelegten Benutzer automatisch ein Alias `root@the.domain.tld` konfiguriert. Das bedeutet das eine an diese Adresse gesendete E-Mail im Posteingang des ersten Benutzers endet. Automatische Weiterleitungen können konfiguriert werden, z.B. wenn ein Benutzer kein zusätzliches E-Mail-Konto einrichten möchte und nur E-Mails vom Server, z.B. auf seine E-Mail-Adresse, empfangen möchte.
