Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__05.domains__dns_dynamicip/*.po
Languages: fr

source: Registrars
fr: Fournisseurs de noms de domaines

source: DNS with a dynamic IP
fr: DNS avec une adresse IP dynamique

source: Before going further, make sure your global IP address is dynamic with: [`ip.yunohost.org`](http://ip.yunohost.org/). The global IP address of your box changes almost every day.
fr: Avant de continuer, assurez-vous que votre adresse IP publique est dynamique avec : [`ip.yunohost.org`](http://ip.yunohost.org/). L'adresse IP publique de votre box change presque tous les jours.

source: This tutorial aim to get around dynamic IP issue which is: when the IP public address of your (Internet Service Provider-) box changes, the DNS zone is not updated to point towards the new IP address, and consequently your server is no more reachable via its domain name
fr: Ce tutoriel vise à contourner le problème lié aux adresses IP dynamiques, à savoir : lorsque l'adresse IP publique de votre box (fourni par votre Fournisseur d'Accès Internet) change, la zone DNS n'est pas mise à jour pour pointer vers la nouvelle adresse IP, et par conséquent, votre serveur n'est plus accessible via son nom de domaine.

source: After setting up the solution proposed in this tutorial, the redirection from your domain name to the actual IP address of your server will not be lost anymore.
fr: Après avoir configuré la solution proposée dans ce tutoriel, la redirection de votre nom de domaine vers l'adresse IP réelle de votre serveur ne sera plus perdue.

source: The method proposed here consists of automatizing the fact the box announces its global IP address change to the dynamic DNS, so that the DNS zone will automatically be updated.
fr: La méthode proposée ici consiste à automatiser les modifications apportées à l'adresse IP publique de la box et au DNS dynamique, afin que la zone DNS soit automatiquement mise à jour.

source: Here are some examples of registrars, companies where you can buy domain names:
fr: Voici quelques exemples de bureaux d'enregistrement, des sociétés auprès desquelles vous pouvez acheter des noms de domaine :

source: If you own a domain name at **OVH**, you may go to step 4 and follow this [tutorial](/admin/get_started/providers/registrar/ovh/manualdns), given that OVH proposes a DynDNS service.
fr: Si vous possédez un nom de domaine chez **OVH**, vous pouvez passer à l'étape 4 et suivre ce [tutoriel](/admin/get_started/providers/registrar/ovh/manualdns), étant donné qu'OVH propose un service DynDNS.

source: 1. Create an account to a Dynamic DNS service
fr: 1. Créez un compte auprès d'un service DNS dynamique

source: Here are sites which offer a DynDNS service free of charge:
fr: Voici des sites qui proposent un service DynDNS gratuit :

source: - [DNSexit](https://www.dnsexit.com/Direct.sv?cmd=dynDns) - [No-IP](https://www.noip.com/remote-access) - [ChangeIP](https://changeip.com) - [DynDNS.it (in italian, paid plan)](https://dyndns.it) - [DynDNS with your own domain](https://github.com/opi/DynDNS-with-HE.NET) - [Duck DNS](https://www.duckdns.org/) - [ydns.io](https://ydns.io/)
fr: - [DNSexit](https://www.dnsexit.com/Direct.sv?cmd=dynDns) - [No-IP](https://www.noip.com/remote-access) - [ChangeIP](https://changeip.com) - [DynDNS.it (en italien, formule payante)](https://dyndns.it) - [DynDNS avec votre propre domaine](https://github.com/opi/DynDNS-with-HE.NET) - [Duck DNS](https://www.duckdns.org/) - [ydns.io](https://ydns.io/)

source: Register to one of them. It should provide you with one (or more) IP address to reach the service, and a login (that you may be able to self-define).
fr: Inscrivez-vous à l'un d'entre eux. Il devrait vous fournir une (ou plusieurs) adresse(s) IP pour accéder au service, ainsi qu'un identifiant de connexion (que vous pourrez éventuellement définir vous-même).

source: 2. Move the DNS zones
fr: 2. Déplacer les zones DNS

source: Copy the [DNS zones](/admin/get_started/post_install/dns_config), except for the NS fields, from the [registrar](#registrars) where you bought your domain name from to the dynamic DNS service you registrer at in step 1.
fr: Copiez les [zones DNS](/admin/get_started/post_install/dns_config), à l'exception des champs NS, depuis le [registrar](#registrars) auprès duquel vous avez acheté votre nom de domaine vers le service DNS dynamique auquel vous vous êtes inscrit à l'étape 1.

source: 3. Switch the management of your domain name to the dynamic DNS server
fr: 3. Basculer la gestion de votre nom de domaine vers le serveur DNS dynamique

source: This step consists in declaring to your [registrar](#registrars) that the DNS service will now be managed by the DynDNS service provider.
fr: Cette étape consiste à déclarer à votre [registrar](#registrars) que le service DNS sera désormais géré par le fournisseur de services DynDNS.

source: For this, first declare in the NS field(s) the IP address provided by the DynDNS service.
fr: Pour cela, déclarez d'abord dans le(s) champ(s) NS l'adresse IP fournie par le service DynDNS.

source: Then, remove any other item in the [DNS zones](/admin/get_started/post_install/dns_config) (except the previous NS fields), from the [registrar](#registrars).
fr: Ensuite, supprimez tous les autres éléments dans les [zones DNS](/admin/get_started/post_install/dns_config) (à l'exception des champs NS précédents) du [registrar](#registrars).

source: 4. Configure the client
fr: 4. Configurer le client

source: This client could be your ISP-box, or a package installed on your server, such as `ddclient`. Here, we will use the client provided by the box, which is the more easy way.
fr: Ce client peut être la box de votre Fournisseur d'Accès à Internet ou un paquet installé sur votre serveur, tel que `ddclient`. Ici, nous utiliserons le client fourni par la box, ce qui est plus simple.

source: Enter the login of the dynamic DNS and its public IP address in your box (interface details may vary by ISP).
fr: Entrez les identifiants du DNS dynamique et son adresse IP publique dans votre box (les détails de l'interface peuvent varier selon le FAI).

source: You're good to go !
fr: Vous êtes prêt à commencer !
