Repository: YunoHost/doc
Catalog: i18n/docs/admin/15.command_line/*.po
Languages: fr

source: <TabItem value="web" label="From the web interface">
fr: <TabItem value="web" label="Depuis la webadmin">

source: <TabItem value="cli" label="From the command line">
fr: <TabItem value="cli" label="Depuis la ligne de commande">

source: 🛠️ SSH and command line
fr: 🛠️ SSH et la ligne de commande

source: What's SSH?
fr: Qu’est-ce que SSH ?

source: **SSH** stands for Secure Shell, and refers to a protocol that allows to remotely control and administer a machine using the command line interface (CLI). It is available by default in any terminal on GNU/Linux and macOS. On Windows, you may want to use [MobaXterm](https://mobaxterm.mobatek.net/download-home-edition.html) (after launching it, click on Session then SSH).
fr: **SSH** est un acronyme pour Secure Shell, et désigne un protocole qui permet de contrôler et administrer à distance une machine via la ligne de commande (CLI). C'est aussi une commande disponible de base dans les terminaux de GNU/Linux et macOS. Sous Windows, il vous faudra utiliser le logiciel [MobaXterm](https://mobaxterm.mobatek.net/download-home-edition.html) (après l'avoir lancé, cliquer sur Session puis SSH).

source: The command line interface (CLI) is, in the computer world, the original (and more technical) way of interacting with a computer compared to graphical interface. Command line interfaces are generally said to be more complete, powerful or efficient than a graphical interface, though also more difficult to learn.
fr: L'interface en ligne de commande (CLI) est, en informatique, la manière originale (et plus technique) d'interagir avec un ordinateur, comparée aux interfaces graphiques. La ligne de commande est généralement considérée comme plus complète, puissante et efficace que les interfaces graphiques, bien que plus difficile à apprendre.

source: How to connect
fr: Comment se connecter

source: Credentials *before* running the postinstall
fr: Identifiants *avant* la postinstall

source: - If you are **installing at home**, the default credentials are login: `root` and password: `yunohost` (or `1234` if you flashed an armbian image) - If you are **installing a remote server (VPS)**, your provider should have communicated you the login and password (or allowed you to configure an SSH key)
fr: - Si vous installez **à la maison**, les identifiants par défaut sont `root` et le mot de passe `yunohost` (ou `1234` si vous avez flashé une image Armbian) ; - Si vous installez **sur un serveur distant (VPS)**, votre fournisseur devrait vous avoir communiqué le login et le mot de passe (ou vous proposer de configurer une clé SSH).

source: Credentials *after* running the postinstall
fr: Identifiants *après* la postinstall

source: During the postinstall, you've been asked to choose an user and an administration password. This user account allows you to connect to the server through SSH. The password becomes also the new password for the `root` user. Additionally, **the `root` SSH login becomes disabled after the postinstall and you should log in using the user account created during postinstall !**. The only exception is that you may still be able to login using `root` *from the local network - or from a direct console on the server* (this is to cover the event where the LDAP server is broken and the users members of the `admins` group are unusables).
fr: Durant la post-installation, vous avez défini un compte et un mot de passe d'administration. Le compte défini lors de la post-installation vous permet de vous connecter en SSH. De plus, le mot de passe défini dans la post-installation devient le nouveau mot de passe pour l'utilisateur `root`. Enfin, **la connexion en SSH avec l'utilisateur `root` est désactivée et il vous faut utiliser le compte défini durant la post-installation !**. L'exception à cette règle est qu'il reste possible de se logger en root *depuis le réseau local - ou depuis une console en direct sur la machine* (ce qui peut être utile dans l'éventualité où le serveur LDAP est inactif et l'utilisateur admin ne fonctionne plus).

source: If you connected with the administration account and would like to become `root` for convenience (e.g. to avoid typing `sudo` in front of every command), you can become `root` using the command `sudo su` or `sudo -i`.
fr: Si vous êtes connecté en tant avec le compte d'administration et souhaitez devenir `root` pour plus de confort (par exemple, ne pas avoir à taper `sudo` à chaque commande), vous pouvez devenir `root` en tapant `sudo su` ou `sudo -i`.

source: Address to use
fr: Adresse à utiliser

source: If you are **installing at home** (e.g. on a Raspberry Pi or OLinuXino or old computer):
fr: Si vous hébergez votre serveur **à la maison** (par ex. Raspberry Pi ou OLinuXino ou vieil ordinateur)

source: - you should be able to connect to your server using `yunohost.local` (or `yunohost-2.local`, depending on how many servers are on your network). - if `yunohost.local` and the like do not work, your need to [find out the local IP of the server](/admin/get_started/post_install/find_ip). - if you installed a server at home but are attempting to connect from outside your local network, make sure port 22 is correctly forwarded to your server.
fr: - vous devriez pouvoir vous connecter au serveur en utilisant `yunohost.local` (ou `yunohost-2.local`, en fonction de si vous avez d'autres serveur yunohost sur le même réseau local). - si `yunohost.local` ne fonctionne pas, il vous faut [trouver l'IP locale du serveur](/admin/get_started/post_install/find_ip). - si vous avez installé un serveur à la maison et que vous essayer de vous connecter depuis l'extérieur du réseau local, assurez-vous que le port 22 est correctement redirigé vers votre serveur.

source: If your server is a remote server (VPS), your provider should have communicated you the IP address of the machine
fr: S'il s'agit d'une machine distante (VPS), votre fournisseur devrait vous avoir communiqué l'IP de votre machine.

source: In any cases, if you already configured a domain name pointing to the appropriate IP, it's much better to use `your.domain.tld` instead of the IP address.
fr: Dans tous les cas, si vous avez déjà configuré un nom de domaine qui pointe sur l'IP appropriée, il est plus pratique d'utiliser `votre.domaine.tld` plutôt que l'adresse IP.

source: Connecting
fr: Se connecter

source: The SSH command typically looks like:
fr: Ci-dessous quelques exemples de commande SSH typiques :

source: `fail2ban` will ban your IP for 10 minutes if you perform 10 failed login attempts. If you need to unban the IP, have a look at the page about [Fail2Ban](/admin/troubleshooting/fail2ban)
fr: `fail2ban` bannira votre IP pendant 10 minutes si vous échouez plus de 10 fois à vous identifier. Pour débannir une IP, vous pouvez regarder la page sur [Fail2Ban](/admin/troubleshooting/fail2ban).

source: Which other users may connect to the server?
fr: Quels autres utilisateur·ice·s peuvent se connecter au serveur?

source: By default, only YunoHost users in the `admins` group can log in to YunoHost's SSH and SFTP servers. Non-admin YunoHost users can't connect via SSH for security reasons. With the permissions system it is possible to specifically grant SFTP or even SSH access to non-admin users.
fr: Par défaut, seuls les comptes dans le groupe `admins` peuvent se connecter en SSH et SFTP sur une instance YunoHost. Les comptes hors de ce groupe ne peuvent se connecter pour des raisons de sécurité. Avec le système de permissions il est possible d'autoriser la connexion en SFTP ou si c'est vraiment nécessaire en SSH.

source: Be careful who you give SSH access to. This increases even more the attack surface available to a malicious user.
fr: Faites attention à qui vous donnez accès à SSH. Cela augmente encore plus la surface d'attaque disponible pour un utilisateur malveillant.

source: Go to `Users > Manage groups and permissions`.
fr: Se rendre dans `Utilisateurs > Gérer les groupes et les autorisations`

source: From here, you can add SFTP or SSH permissions to any user or group.
fr: À partir de là, il est possible d'ajouter les permissions SFTP ou SSH à un utilisateur ou un groupe au choix.

source: If you want to add an SSH public key to the user, you have to do it from the command line, as the web interface does not yet offer this feature.
fr: Si vous souhaitez ajouter une clé publique SSH à l'utilisateur, vous devez le faire en ligne de commande, l'interface web ne proposant pas encore cette fonctionnalité.

source: To allow a user or group to access via SFTP or SSH:
fr: Pour autoriser un utilisateur ou un groupe à accéder en SFTP ou en SSH :

source: To remove permission:
fr: Pour enlever la permission :

source: Finally, it is possible to add, delete and list SSH keys, to improve SSH access security, using the commands:
fr: Enfin, il est possible d'ajouter, de supprimer et de lister des clés SSH, pour améliorer la sécurité de l'accès SSH, avec les commandes :

source: Security and SSH
fr: SSH et sécurité

source: A more extensive discussion about security & SSH can be found on the [dedicated page](/admin/security).
fr: Une discussion plus complète sur la sécurité et sur SSH peut être trouvée sur [la page dédiée](/admin/tutorials/security).

source: The command line
fr: La ligne de commande

source: Providing a full tutorial about the command line is quite beyond the scope of the YunoHost documentation : for this, consider reading a dedicated tutorial such as [this one](https://ryanstutorials.net/linuxtutorial/) or [this one](http://linuxcommand.org/). But be reassured that you don't need to be a CLI expert to start using it !
fr: Fournir un tutoriel complet sur la ligne de commande est bien au-delà du cadre de la documentation de YunoHost : pour cela, référez-vous à des tutoriels comme [celui-ci](https://doc.ubuntu-fr.org/tutoriel/console_ligne_de_commande) ou [celui-ci (en)](http://linuxcommand.org/). Mais soyez rassuré, il n'y a pas besoin d'être un expert pour commencer à l'utiliser !

source: The `yunohost` command
fr: La commande `yunohost`

source: The `yunohost` command can be used to administer your server and perform the various actions similarly to what you do on the webadmin. The command must be launched either from the `root` user or from a user member of the `admins` group by preceeding them with `sudo`. (ProTip™ : you can become `root` with the command `sudo su` as an user member of `admins` group).
fr: La commande `yunohost` peut être utilisée pour administrer votre serveur ou réaliser les mêmes actions que celles disponibles sur la webadmin. Elle doit être lancée depuis l'utilisateur `root`, ou bien depuis un compte membre du groupe `admins` en précédant la commande de `sudo`. (ProTip™ : il est possible de devenir `root` via la commande `sudo su` en tant que membre du group `admins`.)

source: YunoHost commands usually have this kind of structure :
fr: Les commandes YunoHost ont ce type de structure :

source: Don't hesitate to browse and ask for more information about a given category or action using the the `--help` option. For instance, those commands :
fr: N'hésitez pas à naviguer et demander des informations à propos d'une catégorie ou action donnée via l'option `--help`. Par exemple, ces commandes :

source: will successively list all the categories available, then the actions available in the `user` category, then the usage of the action `user create`. You might notice that the YunoHost command tree is built with a structure similar to the YunoHost admin pages.
fr: vont successivement lister toutes les catégories disponibles, puis les actions de la catégorie `user`, puis expliquer comment utiliser l'action `user create`. Vous devriez remarquer que l'arbre des commandes YunoHost suit une structure similaire aux pages de la webadmin.

source: The `yunopaste` command
fr: La commande `yunopaste`

source: This command allow you to share with an other person the output of a command.
fr: Cette commande est utile lorsque vous voulez communiquer à une autre personne le retour d'une commande.

source: Example:
fr: Exemple :

source: Some useful commands
fr: Quelques commandes utiles

source: If your administration web interface indicates that the API is unreachable, try starting `yunohost-api`:
fr: Si votre interface web d'administration indique que l'API est injoignable, essayez de démarrer `yunohost-api` :

source: If you can no longer connect with an user member of `admins` group via SSH and via the web interface, the `slapd` service may be down, try restarting it:
fr: Si vous ne parvenez plus à vous connecter avec l'utilisateur `admin` via SSH et via l'interface web, le service `slapd` est peut-être éteint, essayez de le redémarrer :

source: If you have manually modified configurations and want to know the changes:
fr: Si vous avez des configurations modifiées manuellement et souhaitez connaître les modifications :
