Repository: YunoHost/doc
Catalog: i18n/docs/admin/40.backups__index/*.po
Languages: fr

source: <TabItem value="web" label="From the web interface">
fr: <TabItem value="web" label="Depuis la webadmin">

source: <TabItem value="cli" label="From the command line">
fr: <TabItem value="cli" label="Depuis la ligne de commande">

source: 🚑 Backups
fr: 🚑 Sauvegardes

source: In the context of self-hosting, backups are essential for mitigating the impact of unexpected events—such as fires, database corruption, server access issues, or security breaches. The backup strategy you implement should be tailored to the importance of the services and data you are managing. For instance, backing up a test server will be of little interest, whereas when handling critical data for an NGO or business, backups become much more vital. In these cases, it’s crucial to store backups in one, or ideally **several** locations.
fr: Dans le contexte de l'auto-hébergement, les sauvegardes (backups) sont un élément important pour pallier les événements inattendus (incendies, corruption de base de données, perte d'accès au serveur, serveur compromis...). La politique de sauvegardes à mettre en place dépend de l'importance des services et des données que vous gérez. Par exemple, sauvegarder un serveur de test aura peu d'intérêt, tandis que vous voudrez être très prudent⋅e si vous gérez des données critiques pour une association ou une entreprise. Dans ce genre de cas, il est crucial d'avoir de disposer de sauvegardes dans un, ou idéalement **plusieurs** endroits différents.

source: Manual backup
fr: Sauvegarde manuelle

source: YunoHost comes with a backup system, that allows you to backup (and restore) system configurations and data (e.g. emails) and apps if they support it.
fr: YunoHost est fourni avec un système de sauvegarde, qui permet de sauvegarder (et restaurer) les configurations du système, les données « système » (comme les mails) et les applications si elles le supportent.

source: You can manage backups either from the command line (`yunohost backup --help`) or from the web administration (in the Backups section), though some features are not yet available in the webadmin.
fr: Vous pouvez gérer vos sauvegardes via la ligne de commande (`yunohost backup --help`) ou la webadmin (dans la section Sauvegardes) bien que certaines fonctionnalités ne soient pas disponibles via celle-ci.

source: The current default method consists in creating a `.tar` archive containing all relevant files.
fr: La méthode de sauvegarde actuelle consiste à créer des archives `.tar` qui contiennent les fichiers pertinents.

source: Creating backups
fr: Créer une sauvegarde

source: You can easily create backup archives from the webadmin by going to `Backups > Local storage` and clicking on `New backup`. You will then be asked to select which configuration, data and apps you want to backup.
fr: Vous pouvez facilement créer des archives depuis la webadmin en allant dans `Sauvegardes > Archives locales` et en cliquant sur `Nouvelle sauvegarde`. Vous pourrez ensuite sélectionner les éléments à sauvegarder (configuration, données "système", applications).

source: ![picture of YunoHost's backup pannel](/img/webadmin/backup.png)
fr: ![Image de l'écran de sauvegarde de YunoHost dans la webadmin](/img/webadmin/backup.png)

source: You can create a new backup archive from the command line. Here are a few simple examples of commands and their corresponding behavior:
fr: Vous pouvez créer de nouvelles archives depuis la ligne de commande. Voici quelques exemples de commandes et leur comportement correspondant :

source: - Backing up everything (all system parts and apps):
fr: - Tout sauvegarder (système et apps) :

source: - Backing up only apps
fr: - Sauvegarder seulement les apps :

source: - Backing up only two apps (wordpress and shaarli)
fr: - Sauvegarder seulement deux apps (WordPress et Shaarli) :

source: - Backing up only emails
fr: - Sauvegarder seulement les mails :

source: - Backing up emails and wordpress
fr: - Sauvegarder les mails et WordPress :

source: For more information and options about backup creation, consult `yunohost backup create --help`. You can also list the system parts that can be backed up with `yunohost hook list backup`.
fr: Pour plus d'informations et d'options sur la création d'archives, consultez `yunohost backup create --help`. Vous pouvez également lister les parties du système qui sont sauvegardables avec `yunohost hook list backup`.

source: Downloading backups
fr: Télécharger la sauvegarde

source: After creating backups, it is possible to list and inspect them using the corresponding views in the web administration interface. A button allows you to download the archive. If the archive is larger than 3GB, it may be better to proceed via SFTP.
fr: Après avoir créé des sauvegardes, il est possible de les lister et de les inspecter grâce aux vues correspondantes dans l'interface d'administration web. Un bouton propose de télécharger l'archive. Si l'archive fait plus de 3Go, il peut être préférable de procéder via SFTP.

source: `Backup > Local Archives > <Archive name> > Download`
fr: `Sauvegarde > Archives locales > <Nom de l'archive> > Télécharger`

source: <TabItem value="sftp" label="With a SFTP client">
fr: <TabItem value="sftp" label="Avec un client SFTP">

source: Currently, the most accessible way to download big archives is to use the program FileZilla as explained in [this page](/admin/tutorials/filezilla).
fr: À l'heure actuelle, la solution la plus accessible pour récupérer les sauvegardes de grosse taille est d'utiliser le programme FileZilla comme expliqué dans [cette page](/admin/tutorials/filezilla).

source: By default, backups are stored in `/home/yunohost.backup/archives/`.
fr: Par défaut, les sauvegardes sont stockées dans `/home/yunohost.backup/archives/`.

source: It is possible to use `scp` (a program based on [`ssh`](/admin/command_line)) to copy files between two machines via the command line. So, from a GNU/Linux machine, you can use the following command to download an archive:
fr: Il est possible d'utiliser `scp` (un programme basé sur `ssh`) pour copier des fichiers entre deux machines grâce à la ligne de commande. Ainsi, depuis une machine sous GNU/Linux, vous pouvez utiliser la commande suivante pour télécharger une archive :

source: If your SSH port is different from 22
fr: En cas de port SSH autre que 22 :

source: Don't forget to store your backup in a different place to your server.
fr: N'oubliez pas de stocker votre sauvegarde dans un lieu différents de celui ou se trouve votre serveur.

source: If you want, you can connect an external disk to your server so that the archives arrive directly on it. See this guide to [Adding external storage to your server](/admin/tutorials/external_storage)
fr: Si vous le souhaitez, vous pouvez connecter un disque externe à votre serveur pour que les archives arrivent directement dessus. Voir ce guide pour [Ajouter un stockage externe à son serveur](/admin/tutorials/external_storage)

source: Testing
fr: Tester

source: You should regularly test your backups by at least listing the contents of the archives and checking the size of the associated data. It is best to practice restoring regularly.
fr: Vous devriez tester régulièrement vos sauvegardes à minima en listant le contenu des archives et en vérifiant le poids des données associées. Le mieux est de s'entrainer règulièrement à restaurer.

source: Restoring backups
fr: Restaurer

source: SPOILER: The larger your data volume and the more applications you have, the more complex your recovery will be.
fr: SPOILER: Plus votre volume de données et le nombre d'applications sont important, plus votre restauration sera complexe.

source: Simple case: little data, archive already present
fr: Cas simple : peu de données, archive déjà présente

source: Go in `Backup > Local storage` and select your archive. You can then select which items you want to restore, then click on 'Restore'.
fr: Allez dans `Sauvegardes > Archives locales` et sélectionnez l'archive. Vous pouvez ensuite choisir les différents éléments que vous voulez restaurer puis cliquer sur "Restaurer".

source: From the command line, you can run `yunohost backup list` to get the available archive names. They are basically their file name without extension.
fr: À partir de la ligne de commande, vous pouvez exécuter `yunohost backup list` pour obtenir les noms des archives disponibles. Il s'agit essentiellement de leur nom de fichier sans extension.

source: In the case of a complete restoration, it is possible to restore instead of launching the initial configuration.
fr: Dans le cas d'une restauration complète, il est possible de restaurer à la place de lancer la configuration initiale.

source: To restore an app, the domain on which it was installed should already be configured (or you need to restore the corresponding system configuration). You also cannot restore an app which is already installed... which means that to restore an old version of an app, you must first uninstall it.
fr: Pour restaurer une application, le domaine sur laquelle elle est installée doit déjà être configuré (ou il vous faut restaurer en même temps la configuration correspondante). Aussi, il n'est pas possible de restaurer une application déjà installée... ce qui veut dire que pour restaurer une sauvegarde d'une app, il vous faut déjà la désinstaller.

source: Uploading an archive
fr: Téléverser une archive

source: In many cases, the archive is not on the server on which you want to restore it. So it has to be uploaded, which depending on its size can take more or less time.
fr: Dans de nombreux cas, l'archive n'est pas sur le serveur sur lequel on souhaite la restaurer. Il faut donc la téléverser, ce qui selon son poids peut prend plus ou moins de temps.

source: Currently, the most accessible solution for uploading backups is to use the FileZilla program as explained in [this page](/admin/tutorials/filezilla).
fr: À l'heure actuelle, la solution la plus accessible pour téléverser les sauvegardes est d'utiliser le programme FileZilla comme expliqué dans [cette page](/admin/tutorials/filezilla).

source: By default, backups are to be placed in `/home/yunohost.backup/archives/`.
fr: Par défaut, les sauvegardes sont à placer dans `/home/yunohost.backup/archives/`.
