Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__40.post_install__20.dns_config/*.po
Languages: de, fr, ru

source: Dynamic IP
de: Dynamische IP
fr: IP dynamique
ru: Динамический IP-адрес

source: DNS zone configuration
de: Konfiguration der DNS-Zone
fr: Configuration de la zone DNS
ru: Конфигурация зоны DNS

source: DNS (domain name system) is a system that converts human-readable addresses (domain names) into machine-understandable addresses (IP). For your server to be easily accessible by human beings, and for some services like mail to work properly, DNS must be configured.
de: Das Domain Name System (DNS) ist einer der wichtigsten Dienste in vielen IP-basierten Netzwerken. Hauptsächlich wird das DNS zur Umsetzung von Domainnamen in IP-Adressen benutzt. Das DNS bietet somit eine Vereinfachung, weil Menschen sich Namen weitaus besser merken können als Zahlenketten. Damit Ihr Server für andere leicht erreichbar ist und bestimmte Dienste, wie z. B. E-Mail, richtig funktionieren, ist es notwendig, die DNS-Zone Ihrer Domain zu konfigurieren.
fr: Le DNS (système de nom de domaine) est un élément essentiel d'Internet qui permet de convertir des adresses compréhensibles par les êtres humains (les noms de domaines) en adresses compréhensibles par la machine (les adresses IP). Pour que votre serveur soit facilement accessible par d'autres êtres humains, et pour que certains services comme le mail fonctionnent correctement, il est nécessaire de configurer la zone DNS de votre domaine.
ru: DNS (система доменных имен) - это система, которая преобразует удобочитаемые адреса (доменные имена) в адреса, понятные машине (IP). Чтобы ваш сервер был легко доступен людям, а некоторые службы, такие как почта, работали должным образом, необходимо настроить DNS.

source: If you're using an [automatic domain](/admin/tutorials/domains/dns_nohost_me) provided by the YunoHost Project, the configuration should be performed automatically. If you're using your own domain name (e.g. bought via a registrar), you should manually configure your domain on your registrar's interface.
de: Wenn Sie eine [automatische Domain](/admin/tutorials/domains/dns_nohost_me) verwenden, die vom YunoHost-Projekt bereitgestellt wird, sollte die Konfiguration automatisch erfolgen. Wenn Sie Ihren eigenen Domainname (z. B. von einem Registrar erworben), müssen Sie manuell Ihre Domain über die Schnittstelle Ihres Registrars konfigurieren.
fr: Si vous utilisez un [domaine automatique](/admin/tutorials/domains/dns_nohost_me) fourni par le Projet YunoHost, la configuration devrait être faite automatiquement. Si vous utilisez votre propre nom de domaine (e.g. acheté chez un registrar), il vous faut configurer manuellement votre domaine via l'interface de votre registrar.
ru: Если вы используете [автоматический домен](/admin/tutorials/domains/dns_nohost_me), предоставляемый проектом YunoHost, настройка должна выполняться автоматически. Если вы используете свое собственное доменное имя (например, купленное через регистратора), вам следует вручную настроить свой домен в интерфейсе вашего регистратора.

source: Recommended DNS configuration
de: Empfohlene DNS-Konfiguration
fr: Configuration DNS recommandée
ru: Рекомендуемая конфигурация DNS

source: NB: Examples here use the placeholder `your.domain.tld`, you have to replace it with your real domain, such as `www.yunohost.org`.
de: *N.B. : Die Beispiele hier verwenden den Text: `your.domain.tld`, der durch Ihre eigene Domain (z. B.`www.yunohost.org`) zu ersetzen ist.*
fr: NB : les exemples utilisent ici le texte `votre.domaine.tld`, à remplacer par votre propre domaine (par exemple `www.yunohost.org`).
ru: ПРИМЕЧАНИЕ: В примерах здесь используется заполнитель `your.domain.tld`, вы должны заменить его своим реальным доменом, например `www.yunohost.org`.

source: YunoHost provides a recommended DNS configuration, available via:
de: YunoHost bietet eine empfohlene DNS-Konfiguration, die auf zwei Arten zugänglich ist :
fr: YunoHost fournit une configuration DNS recommandée, accessible via :
ru: YunoHost предоставляет рекомендуемую конфигурацию DNS, доступную через:

source: - the webadmin, in Domain > your.domain.tld > DNS configuration; - or the command line, `yunohost domain dns suggest your.domain.tld`
fr: - la webadmin, dans Domaines > votre.domaine.tld > Configuration DNS ; - ou la ligne de commande, `yunohost domain dns suggest votre.domaine.tld`

source: For specific needs or specific setups, and if you know what you're doing, you might want or have to tweak these, or add additional ones (e.g. to handle subdomains).
de: Für einige spezielle Anforderungen oder Installationen und wenn Sie wissen, was Sie tun, müssen Sie diese Empfehlung möglicherweise ändern oder andere Datensätze hinzufügen (z. B. zur Behandlung von Subdomains).
fr: Pour certains besoins ou installations particulières, et si vous savez ce que vous faites, il vous faudra peut-être modifier cette recommandation ou ajouter d'autres enregistrements (e.g. pour gérer des sous-domaines).
ru: Для конкретных нужд или конкретных настроек, и если вы знаете, что делаете, вы можете захотеть или быть вынуждены изменить их или добавить дополнительные (например, для обработки поддоменов).

source: The recommended configuration typically looks like this:
de: Die empfohlene Konfiguration sieht typischerweise so aus:
fr: La configuration recommandée ressemble typiquement à :
ru: Рекомендуемая конфигурация обычно выглядит следующим образом:

source: Though it might be easier to understand it if displayed like this:
de: Aber es ist vielleicht leichter zu verstehen, wenn es auf folgende Weise dargestellt wird:
fr: Mais il est peut-être plus facile de la comprendre affichée de la façon suivante :
ru: Хотя, возможно, было бы легче понять это, если бы оно отображалось следующим образом:

source: | Type | Name | Value | | :-----: | :--------------------: | :--------------------------------------------------: | | **A** | **@** | `111.222.333.444` (your IPv4) | | A | * | `111.222.333.444` (your IPv4) | | AAAA | @ | `2222:444:8888:3333:bbbb:5555:3333:1111` (your IPv6) | | AAAA | * | `2222:444:8888:3333:bbbb:5555:3333:1111` (your IPv6) | | **MX** | **@** | `your.domain.tld.` (and priority: 10) | | TXT | @ | `"v=spf1 a mx -all"` | | TXT | mail._domainkey | `"v=DKIM1; k=rsa; p=someHuuuuuuugeKey"` | | TXT | _dmarc | `"v=DMARC1; p=none"` |
fr: | Type | Nom | Valeur | | :-----: | :--------------------: | :----------------------------------------------------: | | **A** | **@** | `111.222.333.444` (votre IPv4) | | A | * | `111.222.333.444` (votre IPv4) | | AAAA | @ | `2222:444:8888:3333:bbbb:5555:3333:1111` (votre IPv6) | | AAAA | * | `2222:444:8888:3333:bbbb:5555:3333:1111` (votre IPv6) | | **MX** | **@** | `votre.domaine.tld.` (et priorité: 10) | | TXT | @ | `"v=spf1 a mx -all"` | | TXT | mail._domainkey | `"v=DKIM1; k=rsa; p=uneGrannnndeClef"` | | TXT | _dmarc | `"v=DMARC1; p=none"` |

source: A few notes about this table
de: Einige Hinweise zu dieser Tabelle
fr: Quelques notes à propos de cette table
ru: Несколько замечаний по поводу этой таблицы

source: - Not all these lines are absolutely necessary. For a minimal setup, you only need the records in bold. - The dot at the end of `your.domain.tld.` is important ;); - `@` corresponds to `your.domain.tld`, and e.g. `muc` corresponds to `muc.your.domain.tld`; - These are example values ! See your generated conf for the actual values you should use; - We recommend a [TTL](https://en.wikipedia.org/wiki/Time_to_live#DNS_records) of 3600 (1 hour). But you can use something else if you know what you're doing; - Don't put an IPv6 record if you're not sure IPv6 really works on your server! You might have issues with Let's Encrypt if it doesn't. - If you're using the domain provider Namecheap the SRV DNS entries are formatted as **Service**: `_xmpp-client` **Protocol**: `_tcp` **Priority**: `0` **Weight**: `5` **Port**: `5222` **Target**: `your.domain.tld`
fr: - Toutes les lignes ne sont pas nécessaires. Pour une installation minimale, seuls les lignes en gras sont nécessaires. - Le point à la fin de `your.domain.tld.` est important ;) ; - `@` corresponds à `your.domain.tld`, et par exemple `muc` corresponds à `muc.your.domain.tld` ; - Ce sont des valeurs d'exemples ! Il vous faut regarder la configuration générées par YunoHost pour avoir les vrais valeurs à utiliser pour votre serveur ; - Nous recommandons un [TTL](https://en.wikipedia.org/wiki/Time_to_live#DNS_records) de 3600 (1 heure). Mais vous pouvez utiliser autre chose si vous savez ce que vous faites ; - Ne mettez pas d'enregistrement IPv6 si vous n'êtes pas sûr⋅e que l'IPv6 fonctionne sur votre serveur ! Cela peut créer des problèmes avec Let's Encrypt si l'IPv6 ne fonctionne en réalité pas. - Si vous utilisez le registrar Namecheap, les enregistrements SRV sont formatés comme **Service** : `_xmpp-client` **Protocol** : `_tcp` **Priority** : `0` **Weight** : `5` **Port** : `5222` **Target** : `your.domain.tld`

source: Reverse DNS
fr: Résolution DNS inverse
ru: Обратный DNS

source: If your ISP or VPS provider let you define a [Reverse DNS lookup](https://en.wikipedia.org/wiki/Reverse_DNS_lookup) for your public IPv4 and/or IPv6 addresses, you must configure it. It will prevent you to be marked as spam by anti-spam filters.
de: Wenn Ihr ISP oder Host dies zulässt, empfehlen wir Ihnen, eine [Reverse-DNS-Konfiguration](https://de.wikipedia.org/wiki/Reverse_DNS) für Ihre öffentlichen IPv4- und/oder IPv6-Adressen. Dadurch wird verhindert, dass Sie als Spammer von den Anti-Spam-Filtersystemen markiert werden.
fr: Si votre opérateur ou votre hébergeur le permet, nous vous encourageons à configurer une [résolution DNS inverse](https://fr.wikipedia.org/wiki/Domain_Name_System#R%C3%A9solution_inverse) pour vos adresses publiques IPv4 et/ou IPv6. Ceci vous évitera d'être marqué comme spammeur par les systèmes de filtrage anti-spams.
ru: Если ваш интернет-провайдер или VPS-провайдер позволяет вам определить [обратный поиск DNS](https://ru.wikipedia.org/wiki/%D0%9E%D0%B1%D1%80%D0%B0%D1%82%D0%BD%D1%8B%D0%B9_%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80_DNS) для ваших общедоступных IPv4 и/или IPv6-адресов вы должны настроить его. Это предотвратит пометку вас антиспам-фильтрами как нежелательные письма.

source: **N.B.: the reverse DNS configuration happens on your Internet Service Provider or VPS provider. It is *not* handled by your domain's registrar.**
de: **N.B. : Die Reverse-DNS-Konfiguration erfolgt bei Ihrem Internet Service Provider bzw. VPS-Host. Es betrifft *nicht* den Registrar Ihres Domainnamens.**
fr: **N.B. : la configuration du DNS inverse se passe au niveau de votre fournisseur d'accès à Internet, ou de votre hébergeur de VPS. Elle ne se fait *pas* sur le registrar de votre nom de domaine.**
ru: **Примечание: обратная настройка DNS выполняется у вашего интернет-провайдера или VPS-провайдера. Это *не* обрабатывается регистратором вашего домена.**

source: If your public IPv4 address is `111.222.333.444` and your DNS domain is `domain.tld`, you should get following answer when using `nslookup` command tool:
de: Das heißt, wenn Ihre öffentliche IPv4-Adresse `111.222.333.444` ist und Ihr Domänename `domain.tld` ist, sollten Sie mit dem Befehl `nslookup` das folgende Ergebnis erhalten :
fr: Cela signifie que si votre adresse IPv4 publique est `111.222.333.444` et que votre nom de domaine est `domain.tld`, vous devez obtenir le résultat suivant en utilisant la commande `nslookup` :
ru: Если ваш общедоступный IPv4-адрес `111.222.333.444`, а ваш DNS -домен - `domain.tld`, вы должны получить следующий ответ при использовании командной строки `nslookup`:

source: The diagnosis system available in the webadmin performs this checks automatically (in section Email).
de: Das Diagnosesystem in der Administrationsoberfläche tut dies automatisch (im Abschnitt E-Mail)
fr: Le système de diagnostic présent dans l'interface d'administration fait cette vérification automatiquement (dans la section Email)
ru: Система диагностики, доступная в webadmin, выполняет эту проверку автоматически (в разделе Электронная почта).

source: If your global IP address is constantly changing, follow this [tutorial](/admin/tutorials/domains/dns_dynamicip).
de: Wenn sich Ihre öffentliche IP-Adresse ständig ändert, befolgen Sie dieses [Tutorial](/admin/tutorials/domains/dns_dynamicip).
fr: Si votre adresse IP publique change constamment, suivez ce [tutoriel](/admin/tutorials/domains/dns_dynamicip).
ru: Если ваш глобальный IP-адрес постоянно меняется, следуйте этому [руководству](/admin/tutorials/domains/dns_dynamicip).
