Repository: YunoHost/doc
Catalog: i18n/docs/admin/35.email__05.clients/*.po
Languages: de, fr

source: Configure email clients
de: E-Mail-Client konfigurieren
fr: Configurer les clients courriels

source: You can fetch and send emails using your YunoHost instance from desktop email clients such as Thunderbird Desktop or on your smartphone with applications like K-9 Mail.
de: Sie können E-Mails über Ihre YunoHost-Instanz von Desktop-E-Mail-Clients wie Thunderbird Desktop oder auf Ihrem Smartphone mit Anwendungen wie K-9 Mail abrufen und versenden.
fr: Vous pouvez récupérer et envoyer des emails avec votre instance YunoHost grâce à des logiciels comme Thunderbird Desktop, ou sur votre smartphone grâce à des applications comme K-9 Mail.

source: Modern mail clients should be able to configure themselves automatically. If autoconfiguration fails, you can do it manually following the instructions below. (If the autoconfiguration fails though, it should be understood as a bug in YunoHost, and we would be glad to read your feedback to try to reproduce the issue on our side!)
de: Moderne Mail-Clients sollten in der Lage sein, sich automatisch zu konfigurieren. Wenn die Autokonfiguration fehlschlägt, können Sie sie manuell vornehmen, indem Sie die folgenden Anweisungen befolgen. (Wenn die Autokonfiguration fehlschlägt, sollte dies als ein Fehler in YunoHost verstanden werden, und wir würden uns freuen, Ihr Feedback zu lesen, um das Problem auf unserer Seite zu reproduzieren).
fr: Normalement, votre client email devrait recevoir la configuration automatiquement lorsque vous ajoutez un compte. Si cela ne fonctionne pas, il est possible de le faire manuellement en suivant les quelques étapes suivantes. (Cependant, cela devrait être compris comme étant un bug dans YunoHost, et le cas échéant, c'est cool si vous nous notifiez du problème pour que nous puissions tenter de le reproduire et corriger !)

source: Generic settings
de: Allgemeine Einstellungen
fr: Réglages génériques

source: Here are the element you should enter to manually configure your mail client (`domain.tld` refers to what's after the @ in your email address, and `username` what's before @).
de: Hier sind die Elemente, die Sie eingeben sollten, um Ihren Mail-Client manuell zu konfigurieren (`domain.tld` bezieht sich auf das, was nach dem @ in Ihrer E-Mail Adresse steht, und `Benutzername` auf das, was vor dem @ steht).
fr: Voici les éléments que vous devrez entrer pour configurer manuellement votre client email (`votre.domaine.tld` fait référence à ce qui est après le @ dans votre adresse email, et `nom_utilisateur` ce qui est avant @).

source: | Protocol | Port | Encryption | Authentication | Username | | :--: | :-: | :--: | :--: | :--: | | IMAP | 993 | SSL/TLS | Normal password | `username` (without the `@domain.tld`) | | SMTP | 587 | STARTTLS | Normal password | `username` (without the `@domain.tld`) |
de: | Protokoll | Port | Verschlüsselung | Authentifizierung | Benutzername | | :--: | :-: | :--: | :--: | :--: | | IMAP | 993 | SSL/TLS | Normales Passwort | `Benutzername` (ohne die `@domain.tld`) | | SMTP | 587 | STARTTLS | Normales Passwort | `Benutzername` (ohne die `@domain.tld`) |
fr: | Protocole | Port | Chiffrement | Authentification | Login | | :-- : | :- : | :-- : | :-- : | :-- : | | IMAP | 993 | SSL/TLS | Mot de passe normal | `nom_utilisateur` (sans `@votre.domaine.tld`) | | SMTP | 587 | STARTTLS | Mot de passe normal | `nom_utilisateur` (sans `@votre.domaine.tld`) |

source: Client by client
de: Client für Client
fr: Client par client

source: <SmallInline url='/img/icons/logo-thunderbird.png'/> Configure Thunderbird Desktop (on a desktop computer)
de: <SmallInline url='/img/icons/logo-thunderbird.png'/> Thunderbird Desktop konfigurieren (auf einem Desktop-Computer)
fr: <SmallInline url='/img/icons/logo-thunderbird.png'/> Configurer Thunderbird Desktop (sur un ordinateur de bureau)

source: To manually configure a new account in Thunderbird Desktop, add the account information, then click on 'Configure manually'.
de: Um ein neues Konto in Thunderbird Desktop manuell zu konfigurieren, fügen Sie die Kontoinformationen hinzu und wählen:
fr: Pour configurer manuellement un nouveau compte dans Thunderbird Desktop, ajoutez les informations du compte, puis cliquez sur 'Configurer manuellement'.

source: - For the incoming server, use IMAP with port 993 and SSL/TLS. - For outgoing server, use port 587 with STARTTLS. - Select 'Normal Password' for the the authentication method of both.
fr: - Pour le serveur entrant, utilisez IMAP avec le port 993 et SSL/TLS. - Pour le serveur sortant, utilisez le port 587 avec STARTTLS. - Sélectionnez 'Mot de passe normal' comme méthode d'authentification pour les deux.

source: You may need to accept the certificate exceptions for fetching mails and after you send your first mail. Don't forget to remove the dot before the domain name.
de: Möglicherweise müssen Sie die Zertifikatsausnahmen für das Abrufen von E-Mails und nach dem Senden Ihrer ersten E-Mail akzeptieren. Vergessen Sie nicht, den Punkt vor dem Domainnamen zu entfernen.
fr: Vous devrez peut-être accepter les exceptions de certificat pour récupérer vos e-mails et après avoir envoyé votre premier e-mail. N'oubliez pas de supprimer le point avant le nom de domaine.

source: - [Manage alias mails](https://support.mozilla.org/en-US/kb/configuring-email-aliases)
de: - [Alias-Mails verwalten](https://support.mozilla.org/de/kb/configuring-email-aliases)
fr: - [Gérer les alias mails](https://support.mozilla.org/en-US/kb/configuring-email-aliases)

source: <SmallInline url='/img/icons/logo-k9.png'/> Configure K-9 Mail / Thunderbird Mobile (on Android)
de: <SmallInline url='/img/icons/logo-k9.png'/> K-9 Mail / Thunderbird Mobile konfigurieren (auf Android)
fr: <SmallInline url='/img/icons/logo-k9.png'/> Configurer K-9 Mail / Thunderbird Mobile (sur Android)

source: Follow the following steps. (As for Thunderbird Desktop, you might need to accept certificates at some points)
de: Führen Sie die folgenden Schritte aus. (Wie bei Thunderbird Desktop müssen Sie möglicherweise an einigen Stellen Zertifikate akzeptieren)
fr: Suivez les instructions suivantes (comme pour Thunderbird Desktop, il vous faudra peut-être accepter des certificats à un moment).

source: - Enter your email address then click "Next"
fr: - Entrez votre adresse e-mail, puis cliquez sur "Suivant"

source: - Enter your domain name in the "Server" field, fill the "Security" and "Port" fields as per the IMAP row in the table above, then enter your password in the "Password" field and click "Next"
fr: - Entrez votre nom de domaine dans le champ "Serveur", remplissez les champs "Sécurité" et "Port" conformément à la ligne IMAP du tableau ci-dessus, puis entrez votre mot de passe dans le champ "Mot de passe" et cliquez sur "Suivant"

source: - Again, your domain name in the "Server" field, but fill the "Security" and "Port" fields as per the SMTP row in the table above, then enter your password in the "Password" field and click "Next"
fr: - Entrez à nouveau votre nom de domaine dans le champ "Serveur", et remplissez les champs "Sécurité" et "Port" conformément à la ligne SMTP du tableau ci-dessus, puis entrez votre mot de passe dans le champ "Mot de passe" et cliquez sur "Suivant"

source: <SmallInline url='/img/icons/logo-dekko.png'/> Configure Dekko (on Ubuntu Touch)
de: <SmallInline url='/img/icons/logo-dekko.png'/> Dekko konfigurieren (auf Ubuntu Touch)
fr: <SmallInline url='/img/icons/logo-dekko.png'/> Configurer Dekko (sur Ubuntu Touch)

source: The first time you can simply choose "Add account". If you already have an account configured, tap the hamburger menu then tap the gear, choose Mail, Accounts and press the '+'-symbol.
de: Beim ersten Mal können Sie einfach "Konto hinzufügen" wählen. Wenn Sie bereits ein Konto eingerichtet haben, tippen Sie auf das Hamburger-Menü, dann auf das Zahnrad, wählen Sie Mail, Konten und drücken Sie das '+'-Symbol.
fr: La première fois, vous pouvez simplement choisir « Ajouter un compte ». Si vous avez déjà un compte configuré, appuyez sur le menu hamburger puis sur le rouage, choisissez Courrier, Comptes et appuyez sur le symbole '+'.

source: Then you choose IMAP. Fill in the fields and press Next. Now Dekko will look for the configuration. Check that all fields are correct. Make sure you have your YunoHost username, NOT your email address and choose "Allow untrusted certificates". Do this for IMAP and SMTP and press Next. Dekko will now synchronise the account after which you are done. Congratz!
de: Dann wählen Sie IMAP. Füllen Sie die Felder aus und drücken Sie auf Weiter. Jetzt sucht Dekko nach der Konfiguration. Überprüfen Sie, ob alle Felder korrekt ausgefüllt sind. Vergewissern Sie sich, dass Sie Ihren YunoHost-Benutzernamen und NICHT Ihre Mailadresse eingeben und wählen Sie "Nicht vertrauenswürdige Zertifikate zulassen". Tun Sie dies für IMAP und SMTP und drücken Sie auf Weiter. Dekko wird nun das Konto synchronisieren, danach sind Sie fertig. Herzlichen Glückwunsch!
fr: Sélectionnez ensuite IMAP. Remplissez les champs et appuyez sur Suivant. Dekko va ensuite chercher la configuration. Vérifiez que tous les champs sont corrects. Assurez-vous d'avoir votre nom d'utilisateur YunoHost, PAS votre adresse email, et choisissez « Autoriser les certificats non fiables ». Faites ceci pour IMAP et SMTP et appuyez sur Suivant. Dekko va ensuite synchroniser le compte, après quoi vous aurez terminé. Félicitations !
