Repository: YunoHost/doc
Catalog: i18n/docs/admin/25.domains__index/*.po
Languages: fr, it

source: 🌐 Domains
fr: 🌐 Domaines
it: 🌐 Domini

source: YunoHost lets you manage and serve multiple domains on a single server. So you can host, for example, a blog and Nextcloud on a first domain `yolo.com`, and a webmail client on a second domain `swag.nohost.me`. Each domain is automatically configured to handle web services and e-mail.
fr: YunoHost permet de gérer et de servir plusieurs domaines sur un même serveur. Vous pouvez donc héberger, par exemple, un blog et un Nextcloud sur un premier domaine `yolo.com`, et un client de messagerie web sur un second domaine `swag.nohost.me`. Chaque domaine est automatiquement configuré pour pouvoir gérer des services web et des courriels.
it: YunoHost permette l'installazione e la gestione di più domini sullo stesso server. Potrete quindi ospitare, ad esempio, un blog e un'istanza Nextcloud su un primo dominio `yolo.com`, e un client webmail su un secondo dominio `swag.nohost.me`. Ogni dominio viene automaticamente configurato affinché possa gestire i servizi web e l'email.

source: Domains can be managed in the 'Domains' section of the webadmin, or via the `yunohost domain` category of the command line.
fr: Les domaines peuvent être gérés dans la section 'Domaines' de la webadmin, ou via la catégorie `yunohost domain` de la ligne de commande.
it: I domini possono essere configurati a partire dalla sezione 'Domini' della pagina webadmin, o attraverso la sezione `yunohost domain` da linea di comando.

source: Whenever you add a domain, it is assumed that you have purchased (or at least control) the domain, so that you can manage its [DNS configuration](/admin/get_started/post_install/dns_config). An exception is [domains in `.nohost.me`, `.noho.st` and `ynh.fr`](/admin/tutorials/domains/dns_nohost_me) which are offered by the YunoHost Project, and can be directly integrated with YunoHost through automatic DynDNS configuration. To limit abuse and costs, an instance can only have one domain offered at a time, but you can add as many sub-domains to it as you like. For example, if you choose `example.ynh.co.uk` you can then add the domains `video.example.ynh.co.uk` or `www.exemple.ynh.fr` or any other sub-domain you may require.
fr: Chaque fois que vous ajoutez un domaine, il est supposé que vous avez acheté (ou en tout cas que vous contrôlez) le domaine, de sorte que vous puissiez gérer la [configuration DNS](/admin/get_started/post_install/dns_config) de celui-ci. Une exception concerne les [domaines en `.nohost.me`, `.noho.st` et `ynh.fr`](/admin/tutorials/domains/dns_nohost_me) qui sont offerts par le Projet YunoHost, et peuvent être directement intégrés avec YunoHost grâce à une configuration DynDNS automatique. Pour limiter les abus et les coûts, une instance ne peut avoir qu'un seul domaine offert à la fois, toutefois vous pouvez ajouter autant de sous-domaines de celui-ci que vous le souhaitez. Par exemple, ci vous choisissez `exemple.ynh.fr` vous pourrez par la suite ajouter les domaines `video.exemple.ynh.fr` ou `www.exemple.ynh.fr` ou tout autre sous-domaine dont vous pourriez avoir l'utilité.
it: Ogni volta che aggiungete un dominio, sia esso vostro o del quale abbiate facoltà di gestione, dovete averne il pieno controllo per la poter effettuare la [configurazione del DNS](/admin/get_started/post_install/dns_config). Fanno eccezione i [domini in .nohost.me, .noho.st et ynh.fr](/admin/tutorials/domains/dns_nohost_me) offerti dal progetto YunoHost, che possono essere direttamente integrati nel vostro server YunoHost grazie alla configurazione automatica di un servizio DynDns. Al fine di impedire abusi e limitare i costi, un'istanza YunoHost può essere configurata con un solo dominio offerto, tuttavia potete aggiungere tutti i suoi sottodomini che desiderate. Ad esempio, se scegliete il dominio `exemple.ynh.fr` potrete in un secondo tempo aggiungere i domini `video.exemple.ynh.fr` o `www.exemple.ynh.fr` o qualsiasi altro sottodominio che possa servirvi.

source: Domains can be managed in the 'Domain' section of the webadmin, or through the `yunohost domain` category of the command line.
fr: Les domaines peuvent être gérés dans la section "Domaine" de la webadmin, ou via la ligne de commande (voir `yunohost domain --help`)
it: I domini possono essere configurati a partire dalla sezione 'Domini' della pagina webadmin, o attraverso la sezione `yunohost domain` da linea di comando.

source: ![Screenshot of the webadmin domain interface with an "Add domain" button and a list of domains](/img/webadmin/webadmin_domain.png)
fr: ![Capture d'écran de l'interface du domaine webadmin avec un bouton "Ajouter un domaine" et une liste de domaines](/img/webadmin/webadmin_domain.png)

source: 3 types of domains
fr: 3 types de domaines
it: 3 tipologie di domini

source: <TabItem value="nohost" label="Yunohost's domains (the free and easy way)">
fr: <TabItem value="nohost" label="Domaines Yunohost (la solution simple et gratuite)">

source: In order to make self-hosting as accessible as possible, the YunoHost Project provides a *free* and *automatically configured* domain name service. By using this service, you won't have to [configure DNS records](/admin/get_started/post_install/dns_config) yourself, which can be tedious and technical.
fr: Afin de rendre l'auto-hébergement aussi accessible que possible, le projet YunoHost fournit un service de nom de domaine *gratuit* et *configuré automatiquement*. En utilisant ce service, vous n'aurez pas à [configurer les enregistrements DNS](/admin/get_started/post_install/dns_config) vous-même, ce qui peut être fastidieux et technique.
it: Al fine di facillitare la gestione di un server, il progetto YunoHost fornisce un servizio di nomi di dominio *gratuiti* e *automaticamente configurati*. Utilizzando questo servizio, non dovrete [configurare i record DNS](/admin/get_started/post_install/dns_config) operazione delicata e tecnica. Prendete atto del fatto che non sarete i veri proprietari del dominio scelto.

source: The following (sub)domains are offered:
fr: Les (sous-)domaines suivants sont proposés :
it: Sono disponibili i seguenti (sotto) domini:

source: - `whateveryouwant.nohost.me`; - `whateveryouwant.noho.st`; - `whateveryouwant.ynh.fr`.
fr: - `cequevousvoulez.nohost.me` ; - `cequevousvoulez.noho.st` ; - `cequevousvoulez.ynh.fr`.

source: In more, YunoHost uses an integrated dynamic DNS mechanism, so your server can stay reachable even if your public IP change.
fr: De plus, YunoHost utilise un mécanisme de DNS dynamique intégré, de sorte que votre serveur reste accessible même si votre IP publique change.
it: YunoHost utilizza un sistema di DNS dinamico, assicurando al vostro server di essere sempre raggiungibile anche quando il vostro IP pubblico cambia.

source: To get one of this domain you simply need to choose `I don't have a domaine name…` during the initial configuration (postinstall) or on the `Add domain` page.
fr: Pour obtenir un de ces domaines, il vous suffit de choisir `Je n'ai pas de nom de domaine...` lors de la configuration initiale (post-installation) ou sur la page `Ajouter un domaine`.
it: Per ottenere un dominio tra quelli proposti, sarà sufficiente scegliere `Non ho ancora un nome di dominio...` durante la configurazione post installazione o in un secondo tempo nella sezione `Aggiungere un dominio` della webadmin/domini.

source: ![Screenshot of the "Add domain" page where you can choose "I don't have a domain name"](/img/webadmin/webadmin_dyndns.png)
fr: ![Capture d'écran de la page "Ajouter un domaine" où vous pouvez choisir "Je n'ai pas de nom de domaine"](/img/webadmin/webadmin_dyndns.png)

source: To limit resources costs and abuses, each instance may only have one of these domains setup at any given time, however you can add as many sub-domains of it as you wish. For example, if you choose `example.noho.st` you can later add the domains `video.example.noho.st` or `www.example.ynh.noho.st` or any other sub-domain you may need. In this case you need to select `I already have a domain name`.
fr: Pour limiter les coûts de ressources et les abus, chaque instance ne peut avoir qu'un seul de ces domaines à la fois, mais vous pouvez ajouter autant de sous-domaines que vous le souhaitez. Par exemple, si vous choisissez `example.noho.st` vous pouvez plus tard ajouter les domaines `video.example.noho.st` ou `www.example.ynh.noho.st` ou tout autre sous-domaine dont vous pourriez avoir besoin. Dans ce cas, vous devez sélectionner « J'ai déjà un nom de domaine ».
it: Al fine di impedire abusi e limitare i costi, una istanza YunoHost può essere configurata con un solo dominio offerto, tuttavia potete aggiungere tutti i suoi sotto domini che desiderate. Ad esempio, se scegliete il dominio `exemple.ynh.fr` potrete in un secondo tempo aggiungere i domini `video.exemple.ynh.fr` o `www.exemple.ynh.fr` o qualsiasi altro sottodominio che possa servirvi. In questo caso dovete scegliere `Possiedo un nome di dominio`.

source: [More information on this domains](/admin/tutorials/domains/dns_nohost_me)
fr: [Plus d'informations sur ces domaines](/admin/tutorials/domains/dns_nohost_me)
it: [Per maggiori informazioni sui domini offerti dal progetto YunoHost](/admin/tutorials/domains/dns_nohost_me)

source: <TabItem value="own" label="Your own domains">
fr: <TabItem value="own" label="Vos propres domaines">

source: Having your own domain brings several advantages:
fr: Avoir son propre domaine apporte plusieurs avantages :
it: Possedere un proprio dominio comporta molti vantaggi:

source: - more control and autonomy - simpler domain name (for example directly in .net or .org)
fr: - plus de contrôle et d'autonomie - nom de domaine plus simple (par exemple directement en .net ou .org)

source: However, you have to pay for it each year (about 15€/year ... depending on the TLD) and you have to do some extra configuration to [setup a correct DNS zone](/admin/get_started/post_install/dns_config). Our diagnosis tool can trigger alert to help you to do this configuration.
fr: Cependant, vous devez payer pour cela chaque année (environ 15€/an ... en fonction du TLD) et vous devez faire quelques configurations supplémentaires pour [mettre en place une zone DNS correcte](/admin/get_started/post_install/dns_config). L'outil de diagnostic peut vous aider à effectuer cette configuration.
it: Avere un proprio dominio implica però dei costi (a partire da circa 15€ per anno...) e dovrete effettuare alcune [configurazioni sulla zona DNS](/admin/get_started/post_install/dns_config). Lo strumento di diagnostica integrato in YunoHost, può esservi di aiuto nella configurazione dei record DNS.

source: If you already have your own domain, you can simply click "I already have a domain name…". If you don't, in order to simplify and automate the DNS configuration, we suggest you to buy it from a [registrar whose API is supported by YunoHost](/admin/get_started/providers/registrar/).
fr: Si vous avez déjà votre propre domaine, vous pouvez simplement cliquer sur "J'ai déjà un nom de domaine...". Dans le cas contraire, afin de simplifier et d'automatiser la configuration DNS, nous vous suggérons de l'acheter auprès d'un [registrar dont l'API est supportée par YunoHost](/admin/get_started/providers/registrar/).
it: Se già possedete un nome di dominio, dovete semplicemente scegliere "Ho già un nome di dominio…". Nel caso non abbiate ancora un vostro dominio, vi suggeriamo di acquistarlo presso un registrar con [API supportate da YunoHost](/admin/get_started/providers/registrar/) semplificando così la configurazione del DNS.

source: ![Screenshot of the "Add domain" page where you can choose "I already have a domain name"](/img/webadmin/webadmin_domain_owndomain.png)
fr: ![Capture d'écran de la page "Ajouter un domaine" où vous pouvez choisir "J'ai déjà un nom de domaine"](/img/webadmin/webadmin_domain_owndomain.png)

source: [Know more on DNS zone configuration](/admin/get_started/post_install/dns_config)
fr: [En savoir plus sur la configuration de la zone DNS](/admin/get_started/post_install/dns_config)
it: [Ulteriori informazioni sulla zona DNS](/admin/get_started/post_install/dns_config)

source: <TabItem value="local" label="Local domains (only reachable in your local network)">
fr: <TabItem value="local" label="Domaines locaux (accessibles uniquement sur votre réseau local)">

source: Starting from YunoHost v4.3, domains ending by `.local` are fully supported, in addition to the default `yunohost.local`. They do not use the DNS protocol, but the mDNS one (also known as Zeroconf, Bonjour), which allows them to be published with no specific configuration but exclusively on your local network or VPN. Their use is this especially suitable when you do not need your apps to be available on the Internet.
fr: À partir de YunoHost v4.3, les domaines finissant par `.local` sont pleinement supportés, en plus du `yunohost.local` par défaut. Ils n'utilisent pas le protocole DNS mais mDNS (appelé aussi Zeroconf, Bonjour), qui permet leur diffusion sans configuration particulière mais exclusivement sur votre réseau local, ou votre VPN. Leur utilisation est donc parfaitement adaptée si vous ne prévoyez pas de rendre une de vos apps disponible sur l'Internet.
it: Dalla versione v4.3 di YunoHost, i domini che terminano con `.local` sono pienamente supportati, oltre al `yunohost.local` di default. Questi non utilizzano il protocollo DNS ma il protocollo mDNS (chiamato anche Zeroconf, Bonjour), che permette la loro diffusione senza particolari configurazioni ma esclusivamente sulla LAN o sulla vostra VPN. Sono quindi perfettamente utilizzabili se non dovete esporre le vostre app in internet.

source: ![Screenshot of the "Add domain" page where you can choose "I already have a domain name" and setup your domain ending by .local](/img/webadmin/webadmin_domain_local.png)
fr: ![Capture d'écran de la page "Ajouter un domaine" où vous pouvez choisir "J'ai déjà un nom de domaine" et configurer votre domaine se terminant par .local](/img/webadmin/webadmin_domain_local.png)

source: mDNS protocol does not allow for subdomains to be created. So `domain.local` will work, while `sub.domain.local` is not possible.
fr: Le protocole mDNS ne permet pas d'ajouter des sous-domaines. Ainsi `domaine.local` est valide, `sous.domain.local` ne l'est pas.
it: Il protocollo mDNS non permette l'aggiunta di sotto domini. Quindi `miodominio.local` sarà valido, `sotto.miodominio.local` non lo sarà.

source: `Yunomdns` service takes care of publishing your `.local` domains on your network. It has a configuration file, `/etc/yunohost/mdns.yml`, which allows you to choose which domains are published, and on which network interfaces. This file is automatically regenerated whenever you add or delete a `.local` domain.
fr: C'est le service `yunomdns` qui se charge de diffuser l'existence de vos domaines `.local` sur votre réseau. Il possède un fichier de configuration, `/etc/yunohost/mdns.yml`, qui permet de choisir quels domaines sont diffusés, et sur quelles interfaces réseau. Ce fichier est régénéré automatiquement dès que vous ajoutez ou supprimez un domaine `.local`.
it: Il compito di annunciare l'esistenza dei vostri domini `.local` sulla LAN è affidato al servizio `yunomdns` Il suo file di configurazione `/etc/yunohost/mdns.yml` permette di scegliere quali domini diffondere e su quali interfacce di rete. Questo file viene rigenerato automaticamente ogni volta che aggiungete o cancellate un dominio `.local`.

source: The service will always try to publish `yunohost.local`. If you have multiple YunoHost servers on your network, try `yunohost-2.local`, and so on. The number may change depending on which server starts first, so do not rely on it to use actual apps and create your own domains.
fr: Le service cherchera toujours à diffuser le domaine `yunohost.local`. Si vous avez plusieurs serveurs YunoHost sur votre réseau, alors tentez `yunohost-2.local`, etc. Le chiffre risque de changer selon quel serveur démarre en premier, donc ne comptez pas dessus pour y installer des apps : créez vos propres domaines locaux.
it: Il servizio `yunomdns` cercherà di annunciare sempre il dominio `yunohost.local`. Se avete più di un server YunoHost sulla LAN, probabilmente esso prenderà il nome di `yunohost-2.local`, `yunohost-3.local` ecc. La numerazione rischia però di cambiare in base a quale server si avvierà per primo. Assegnate sempre un nome di dominio locale univoco ad ogni server.

source: Unfortunately, Android devices before version 12 (released in 2021) do not seem to be listening to mDNS protocol. To be able to reach `.local` domains on your Android devices, you will have to add in their DNS settings your YunoHost server's local IP address.
fr: Malheureusement, les appareils Android avant la version 12 (sortie en 2021) ne semblent pas écouter le protocole mDNS. Pour profiter des domaines `.local` sur vos appareils Android, vous devez entrer l'adresse IP locale de votre serveur YunoHost dans leur paramètre DNS.
it: Purtroppo, i device con una versione di Android antecedente alla 12 (rilasciata nel 2021) non sempre gestiscono il protocollo mDNS. Per poter accedere ai server `.local` su tail device sarà necessario digitare l'indirizzo IP del vostro server YunoHost.

source: DNS configuration
fr: Configuration DNS
it: Configurazione DNS

source: DNS (Domain Name System) is a system that enables computers worldwide to translate human-readable domain names (such as `yolo.com`) into machine-readable IP addresses (such as `11.22.33.44`). For this translation (and other features) to work, DNS records need to be carefully configured.
fr: DNS (Domain Name System) est un système qui permet aux ordinateurs du monde entier de traduire les noms de domaine lisibles par les humains (comme `yolo.com`) en adresses IP compréhensibles par les machines (comme `11.22.33.44`). Pour que cette traduction (et d'autres fonctionnalités) fonctionne, il faut configurer soigneusement les enregistrements DNS.
it: DNS (Domain Name System) è lo strumento che permette ai computer di tradurre i nomi di dominio, dal formato leggibile all'essere umano (ad esempio `yolo.com`) in indirizzi IP, leggibili dai computer (esempio `11.22.33.44`). Affinché questa traduzione (ed altre funzioni) avvenga è necessario configurare con cura i record DNS.

source: YunoHost can generate a recommended DNS configuration for each domain, including the records required for e-mail. The recommended DNS configuration is available in the web administrator via Domains > (the domain) > DNS configuration, or with the command `yunohost domain dns suggest the.domain.tld`.
fr: YunoHost peut générer une configuration DNS recommandée pour chaque domaine, y compris les enregistrements nécessaires pour les emails. La configuration DNS recommandée est disponible dans l'administrateur web via Domaines > (le domaine) > configuration DNS, ou avec la commande `yunohost domain dns-conf the.domain.tld`.
it: YunoHost può generare una configurazione DNS consigliata per ogni dominio, compresi i record necessari al servizio mail. La configurazione DNS consigliata è disponibile nella pagina web di amministrazione nella sezione Domini > (dominio) > configurazione DNS, oppure tramite il comando `yunohost domain dns-conf suggest the.domain.tld`.

source: About Non-latin characters
fr: À propos des caractères non-latins
it: Caratteri non latini

source: If your domain has special, non-latin characters, it will be transformed by YunoHost into its [internationalized version](https://en.wikipedia.org/wiki/Internationalized_domain_name) through [Punycode](https://en.wikipedia.org/wiki/Punycode). So when you use the command line, you have to use the punycode format return for example by `yunohost domain list`.
fr: Si votre domaine comporte des caractères spéciaux non-latins, il sera transformé par YunoHost en [version internationalisée](https://en.wikipedia.org/wiki/Internationalized_domain_name) ou en [Punycode](https://en.wikipedia.org/wiki/Punycode). Ainsi, lorsque vous utilisez la ligne de commande, vous devez utiliser le format punycode renvoyé par exemple par `yunohost domain list`.
it: Se il vostro dominio include caratteri speciali non latini, essi verranno convertiti da YunoHost in [versione internazionale](https://en.wikipedia.org/wiki/Internationalized_domain_name) o in [Punycode](https://en.wikipedia.org/wiki/Punycode). Nel caso di utilizzo della linea di comando, dovete utilizzare il formato punycode restituito dal comando `yunohost domain list`.

source: SSL/HTTPS certificates
fr: Certificats SSL/HTTPS
it: Certificati SSL/HTTPS

source: Another important aspect of domain configuration is the SSL/HTTPS certificate. YunoHost is integrated with Let's Encrypt, so once your server is correctly reachable from anybody on the internet through the domain name, the administrator can request a Let's Encrypt certificate. See the documentation about [certificates](/admin/domains/certificate) for more information.
fr: Un autre aspect important de la configuration des domaines est le certificat SSL/HTTPS. YunoHost est intégré avec Let's Encrypt, de sorte qu'une fois que votre serveur est correctement accessible depuis n'importe qui sur Internet via le nom de domaine, l'administrateur peut demander l'installation d'un certificat Let's Encrypt. Voir la documentation sur les [certificats](/admin/domains/certificate) pour plus d'informations.
it: Un altro aspetto importante nella configurazioni dei domini è il certificato SSL/HTTPS. In YunoHost viene integrato il servizio Let's Encrypt, e quindi, al fine di rendere raggiungibile il vostro server da tutto l'internet tramite il nome di dominio, l'amministratore può richiedere l'installazione del certificato Let's Encrypt. Vedi la documentazione sui [certificati](/admin/domains/certificate) per ulteriori informazioni.
