Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__20.install_on__on_top_of_debian/*.po
Languages: fr

source: Typically on a VPS, or if you can't use preinstalled images
fr: En général, sur un VPS, ou si vous ne pouvez pas utiliser les images préinstallées

source: On top of Debian
fr: Par dessus Debian

source: YunoHost can be installed "on top" of Debian. This can be useful if you already have a Debian machine or can't use the recommended methods. Note that there is no actual difference in your resulting YunoHost installation between doing this and using the other methods involving pre-installed images: the pre-installed images are just convenient to skip a bunch of steps and having the system already shipped with everything needed.
fr: YunoHost peut être installé "par-dessus" Debian. Cela peut être utile si vous disposez déjà d'une machine Debian ou si vous ne pouvez pas utiliser les méthodes recommandées. Notez qu'il n'y a aucune différence réelle entre cette méthode et les autres méthodes utilisant des images préinstallées pour l'installation de YunoHost : les images préinstallées sont simplement pratiques pour éviter plusieurs étapes et disposer d'un système livré avec tout le nécessaire.

source: <FAIcon icon="fa-download" /> Get Debian
fr: <FAIcon icon="fa-download" /> Obtenir Debian

source: You should download the version **Bookworm** (Debian 12) and select the architecture for your PC. When in doubt, select `amd64`, or `i386` for a pre-2010 PC.
fr: Vous devez télécharger la version **Bookworm** (Debian 12) et sélectionner l'architecture de votre PC. En cas de doute, sélectionnez `amd64`, ou `i386` pour un PC antérieur à 2010.

source: <Button url="https://www.debian.org/distrib/netinst" color="skyblue"><SmallInline url="/img/icons/logo-debian.png" alt="Debian logo"/> Debian Download page</Button>
fr: <Button url="https://www.debian.org/distrib/netinst" color="skyblue"><SmallInline url="/img/icons/logo-debian.png" alt="Logo de Debian"/> Page de téléchargement de Debian</Button>

source: Alternatively, you can browse the [Debian archive](https://cdimage.debian.org/mirror/cdimage/archive) for the latest 12.x version, select your architecture, the select `iso-cd` and download the `netinst` iso.
fr: Alternativement, vous pouvez naviguer dans les [archives de Debian](https://cdimage.debian.org/mirror/cdimage/archive) pour trouver la version 12.x, choisir votre architecture, puis choisissez `iso-cd` et téléchargez l'ISO `netinst`.

source: You might want to **wipe the hard drive** before starting the Debian installer.
fr: Vous voudrez peut-être **formater le disque** avant de démarrer l'installation de Debian.

source: Flash the ISO your USB key, for example using [Etcher](https://www.balena.io/etcher/), [USBimager](https://bztsrc.gitlab.io/usbimager/) or `dd`.
fr: Flashez l'image ISO sur votre clé USB, par exemple à l'aide de [Etcher](https://www.balena.io/etcher/), [USBimager](https://bztsrc.gitlab.io/usbimager/) ou `dd`.

source: Debian installer will ask for a **hostname** and a **domain name**. You can use `yunohost` and `yunohost.local`. It is not that important since the YunoHost Installer will overwrite those anyway.
fr: Le programme d'installation Debian vous demandera un **nom d'hôte** et un **nom de domaine**. Vous pouvez utiliser `yunohost` et `yunohost.local`. Ce n'est pas très important, car le programme d'installation YunoHost les remplacera de toute façon.

source: Debian will ask for a **root password**, which should be reaonably complex as it is your primary defense to possible attacks.
fr: Debian vous demandera un **mot de passe root**, qui doit être suffisamment complexe car il constitue votre principale défense contre d'éventuelles attaques.

source: The installer will also ask for a **user account** and another password.
fr: Le programme d'installation vous demandera également un **compte utilisateur** et un autre mot de passe.

source: **IMPORTANT:** this username should be DIFFERENT from the first YunoHost user which you will choose during YunoHost's posinstall… For example, you can name it `debian`. Be sure to also use a long complex password.
fr: **IMPORTANT :** ce nom d'utilisateur doit être DIFFÉRENT du premier utilisateur YunoHost que vous choisirez lors de la post-installation de YunoHost… Vous pouvez par exemple le nommer `debian`. Veillez également à utiliser un mot de passe long et complexe.

source: When the install asks where to install and how to **create disk partitions**, select the option to **use the whole disk**, unless you know what you're doing.
fr: Lorsque le programme d'installation vous demande où installer et comment **créer des partitions de disque**, sélectionnez l'option **utiliser tout le disque**, sauf si vous savez exactement ce que vous faites.

source: - We recommend not to separate the `/home`, `/var` or `/tmp` partitions. Use the option to "keep all files in one partition". - If you don't know what you're doing, don't encrypt the disk (Decryption at power-on will be an issue)
fr: - Nous vous recommandons de ne pas séparer les partitions `/home`, `/var` ou `/tmp`. Utilisez l'option "conserver tous les fichiers dans une seule partition". - Si vous ne savez pas ce que vous faites, ne chiffrez pas le disque (le déchiffrement au démarrage posera problème).

source: The installer will ask about **mirrors**. Select a country and server close to your location, or use the default options.
fr: Le programme d'installation vous demandera des informations sur les **miroirs**. Sélectionnez un pays et un serveur proches de votre emplacement, ou utilisez les options par défaut.

source: The installer will ask which **desktop environment** you want. This is generally useless and might waste resources.
fr: Le programme d'installation vous demandera quel **environnement de bureau** vous souhaitez. Cette question est généralement inutile dans le cas d'un serveur et peut entraîner un gaspillage de ressources.

source: - Unselect all desktop environment - Keep "standard system utilities" checked
fr: - Désélectionnez tous les environnements de bureau - Laissez la case "utilitaires usuels du système" cochée

source: After installing Debian
fr: Après avoir installé Debian

source: 1. Remove the installation media (unplug the USB stick) 2. Reboot 3. Login as `root` 4. Install curl by typing `apt install curl`
fr: 1. Retirez le support d'installation (débranchez la clé USB). 2. Redémarrez. 3. Connectez-vous en tant qu'utilisateur `root`. 4. Installez curl en tapant `apt install curl`.
