Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__55.moving_app_folder/*.po
Languages: fr

source: Moving an app folder to a different storage location
fr: Déplacer un dossier d'application vers un autre espace de stockage

source: Applications folder are (*usually*) located in `/var/www/$appname`
fr: Les dossiers d'application se trouvent (*habituellement*) dans `/var/www/$nom_application`

source: If an application folder is expected to get bigger because of the amount of data it contains, it might be relevant to move it to another storage (like an external hard drive).
fr: Lorsqu'un dossier d'application devient trop volumineux il peut être intéressant de le déplacer vers un autre espace de stockage (comme un disque dur externe, une carte sd, etc.)

source: Here's a summary of how to do this the application wordpress. Here, is is assumed that [you already mounted the external hard-drive](/admin/tutorials/external_storage).
fr: Partant du principe que [le stockage externe est déjà monté](/admin/tutorials/external_storage), voici un guide pour déplacer le dossier de l'application wordpress :

source: 1. Move the entire wordpress folder to an external hard drive
fr: 1. Déplacer le dossier wordpress et tout son contenu vers le stockage externe

source: 2. Create a symbolic link
fr: 2. Créer un lien symbolique

source: So that programs looking for files in /var/www/wordpress will actually take them from the harddrive
fr: Le programme qui va chercher des informations dans le dossier /var/www/wordpress sera redirigé vers le stockage externe.

source: 3. Tweak permissions (maybe?)
fr: 3. (peut être) bidouiller les permissions

source: After this, note that you may need to tweak the permissions of `/media/externalharddrive` so that `www-data` (or the user corresponding to the app) is able to read through the folder... Something like :
fr: Après tout ça, il est possible que vous ayez à modifier les permissions de `/media/externalharddrive` pour que `www-data` (ou l'utilisateur de l'app) puisse y accéder. Quelque chose comme :

source: (but it depends on your exact setup... Please update this doc page if you figure out what to do exactly)
fr: (mais cela dépend de votre configuration exacte ... Veuillez mettre à jour cette page de documentation si vous trouvez ce qu'il faut faire exactement)
