Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__10.providers__05.registrar__ovh__manualdns/*.po
Languages: fr, it

source: OVH manual DNS config
fr: Configuration DNS manuelle pour OVH

source: DNS Configuration with OVH
fr: Configuration DNS avec OVH
it: Configurazioen del DNS con OVH

source: Let's see how to properly set the DNS redirections with [OVH](http://www.ovh.com).
fr: Voyons comment paramétrer correctement les redirections DNS avec [OVH](http://www.ovh.com).
it: Vediamo come configurare il DNS con [OVH](http://www.ovh.com).

source: Once you bought your domain name, got to the Web Control Panel, and click on you domain name on the left side:
fr: Une fois que vous avez acheté votre nom de domaine, allez dans le panneau de contrôle Web, et cliquez sur votre nom de domaine sur le côté gauche :
it: Una volta acquistato il vostro nome a dominio, entrate nel Control Panel, cliccate sul nome del vostro dominio che trovate sul lato sinistro:

source: ![OVH website screenshot](/img/providers/ovh_control_panel.png?resize=800)
fr: ![Capture d'écran du site d'OVH](/img/providers/ovh_control_panel.png?resize=800)

source: Click on the **DNS Zone** tab, then on **Add an entry**:
fr: Cliquez sur l'onglet **Zone DNS**, puis sur **Ajouter une entrée** :
it: Scegliete la sezione **Zona DNS**, e poi **Aggiungere un record**:

source: ![OVH website screenshot](/img/providers/ovh_dns_zone.png?resize=800)
fr: ![Capture d'écran du site d'OVH](/img/providers/ovh_dns_zone.png?resize=800)

source: Now you need to add the DNS redirections as specified by the [standard DNS zone configuration](/admin/get_started/post_install/dns_config)
fr: Il faut maintenant ajouter les redirections DNS telles que spécifiées par la [configuration standard de la zone DNS](/admin/get_started/post_install/dns_config)
it: Ora dovrete aggiungere la redirezione del DNS così come specificato nella [configurazione standard delle zone del DNS](/admin/get_started/post_install/dns_config)

source: Click on "Change in text format", keep the first four lines:
fr: Cliquez sur « Change in text format », conservez les quatre premières lignes :
it: Cliccate su "Modifica in modalità testo", lasciando invariate le prime 4 righe:

source: then erase everything below, and replace it with the configuration generated by YunoHost as explained in [this page](/admin/get_started/post_install/dns_config).
fr: puis effacez tout ce qui suit, et remplacez-le par la configuration générée par YunoHost comme expliqué dans [cette page](/admin/get_started/post_install/dns_config).
it: cancellate tutto il resto e sostituitelo con la configurazione necessaria per raggiungere il vostro server come illustrato nel paragrafo [questa pagina](/admin/get_started/post_install/dns_config).

source: Dynamic IP
fr: IP dynamique
it: IP dinamico

source: [General tutorial on dynamic IP](/admin/tutorials/domains/dns_dynamicip).
fr: [Tutoriel général sur l'IP dynamique](/admin/tutorials/domains/dns_dynamicip).
it: [Istruzioni generiche per l'IP dinamico](/admin/tutorials/domains/dns_dynamicip).

source: You should follow this part if you have a dynamic IP.
fr: Vous devez suivre cette partie si vous avez une IP dynamique.
it: Seguite queste istruzioni se il vostro IP è dinamico.

source: Find out if your ISP provides you with a dynamic IP address [here](/admin/get_started/providers/isp/).
fr: Vérifiez si votre FAI vous fournit une adresse IP dynamique [ici](/admin/get_started/providers/isp/).
it: Per sapere se la vostra connessione è del tipo con IP dinamico [vedi](/admin/get_started/providers/isp/).

source: Let's create a DynHost id.
fr: Créons un identifiant DynHost.
it: Create un account DynHost.

source: Follow [this tutorial](http://blog.developpez.com/brutus/p6316/ubuntu/configurer_dynhost_ovh_avec_ddclient) to install ddclient. ddclient will take care of telling OVH that the IP has changed. Then OVH will update the IP.
fr: Suivez [ce tutoriel](http://blog.developpez.com/brutus/p6316/ubuntu/configurer_dynhost_ovh_avec_ddclient) pour installer ddclient. ddclient se chargera de signaler à OVH que l'IP a changé. Ensuite OVH mettra à jour l'IP.
it: Seguite [questa guida](http://blog.developpez.com/brutus/p6316/ubuntu/configurer_dynhost_ovh_avec_ddclient) per l'installazione di ddclient. ddclient si occuperà di avvisare OVH quando il vostro IP cambierà e OVH adatterà la sua configurazione.

source: You need to add in the configuration file:
fr: Vous devez ajouter dans le fichier de configuration :
it: Nel file di configurazione di ddclient dovrete aggiungere:

source: - your login and password DynHost - your domain name
fr: - votre login et mot de passe DynHost - votre nom de domaine

source: You should also check out [OVH's guide on DynHost](https://www.ovh.co.uk/g2024.hosting_dynhost).
fr: Vous pouvez également consulter le [Guide OVH sur DynHost](https://www.ovh.co.uk/g2024.hosting_dynhost).
it: Seguite anche questa [guida creata da OVH](https://docs.ovh.com/fr/fr/web/domains/utilisation-dynhost/).
