Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__20.install_on__arm_board/*.po
Languages: fr, gl

source: Looks like a Raspberry Pi, isn't quite one
fr: Ça ressemble à un Raspberry Pi, mais ce n'en est pas vraiment un
gl: Semella unha Raspberry Pi, pero non é unha

source: On an ARM board
fr: Pour une carte ARM
gl: Nunha placa ARM

source: <FAIcon icon="fa-list-alt"/> Pre-requisites
fr: <FAIcon icon="fa-list-alt"/> Pré-requis
gl: <FAIcon icon="fa-list-alt"/> Requerimentos

source: - An ARM board with at least 512MB RAM - A power supply (either an adapter or a USB cable) for your board; - A microSD card: 16GB capacity (at least), [class "A1"](https://en.wikipedia.org/wiki/SD_card#Class) highly recommended (such as [this SanDisk A1 card](https://www.amazon.fr/SanDisk-microSDHC-Adaptateur-homologu%C3%A9e-Nouvelle/dp/B073JWXGNT/)); - A [reasonable ISP](/admin/get_started/providers/isp/), preferably with a good and unlimited upstream bandwidth - An ethernet cable (RJ-45) to connect your server to your router. - A computer to read this guide, flash the image and access your server.
fr: - Une carte ARM avec au moins 512Mo de RAM ; - Une alimentation secteur (via un adaptateur ou un câble USB) pour votre carte ; - Une carte microSD d'au moins 16Go, [classe "A1"](https://en.wikipedia.org/wiki/SD_card#Class) recommandée (comme par exemple [cette carte SanDisk A1 card](https://www.amazon.fr/SanDisk-microSDHC-Adaptateur-homologu%C3%A9e-Nouvelle/dp/B073JWXGNT/)) ; - Un [FAI correct](/admin/get_started/providers/isp/), idéalement avec bonne bande passante et traffic illimité ; - Un câble etherner (RJ-45) pour connecter votre serveur à votre routeur / box internet ; - Un ordinateur pour lire ce guide, flasher l'image et accéder au serveur.
gl: - Unha placa ARM con un mínimo de 512MB de RAM - Alimentación eléctrica (cun adaptador ou cable USB) para a placa; - Tarxeta SD: 16GB de capacidade (mínimo), é moi recomendable que sexa [class "A1"](https://en.wikipedia.org/wiki/SD_card#Class) (como [esta tarxeta SanDisk A1](https://www.amazon.fr/SanDisk-microSDHC-Adaptateur-homologu%C3%A9e-Nouvelle/dp/B073JWXGNT/)); - Empresa [provedora de internet razoable](/admin/get_started/providers/isp/), mellor se ten un ancho de banda de subida bo e sen límites - Un cable Ethernet (RJ-45) para conectar o servidor co encamiñador. - Unha computadora para ler esta guía, gravar a imaxe e acceder ao servidor.

source: Each ARM board is different and there might be specific instructions for your board. Please follow the Armbian documentation first!
fr: Chaque carte ARM est différent et il y a peut-être des instructions spécifiques à votre carte. Commencez par suivre la documentation Armbian!
gl: Cada placa ARM é diferente e podería haber instrucións específicas para a túa. Primeiro le a documentación de Armbian.

source: <FAIcon icon="fa-download" /> Download the Armbian image
fr: <FAIcon icon="fa-download" /> Téléchargez l'image Armbian
gl: <FAIcon icon="fa-download" /> Descarga a imaxe Armbian

source: You should download the Armbian **Bookworm** (Debian 12) image from your vendor's or Armbian's website.
fr: Il faut télécharger l'image **Bookworm** (Debian 12) du site de Armbian ou du fabriquant de la carte.
gl: Deberías descargar a imaxe de Armbian **Bookworm** (Debian 12) desde a web da marca da túa Armbian.

source: <Button url="https://www.armbian.com/download" color="skyblue"><SmallInline url="/img/icons/logo-armbian.png" alt="armbian logo"/> Armbian Download page</Button>
fr: <Button url="https://www.armbian.com/download" color="skyblue"><SmallInline url="/img/icons/logo-armbian.png" alt="Logo d'Armbian"/> Page de téléchargement d'Armbian</Button>
gl: <Button url="https://www.armbian.com/download" color="skyblue"><SmallInline url="/img/icons/logo-armbian.png" alt="armbian logo"/> páxina de Descargas Armbian</Button>

source: <FAIcon icon="sim-card"/> Flash the Armbian image
fr: <FAIcon icon="sim-card"/> Flasher l'image Armbian
gl: <FAIcon icon="sim-card"/> Grava a imaxe Armbian

source: Now that you downloaded the image of Armbian, you should flash it on a microSD card
fr: Maintenant que vous avez téléchargé l'image Armbian, il vous faut la flasher sur la carte microSD
gl: Unha vez descargada a imaxe Armbian, deberías gravala nunha tarxeta microSD

source: <TabItem value="etcher" label="With Etcher (recommended)">
fr: <TabItem value="etcher" label="Avec Etcher (recommandé)">
gl: <TabItem value="etcher" label="Con Etcher (recomendado)">

source: Download <Link to="https://www.balena.io/etcher/" target="_blank">Etcher</Link> for your operating system and install it.
fr: Téléchargez <Link to="https://www.balena.io/etcher/" target="_blank">Etcher</Link> pour votre système d'exploitation, et installez-le.
gl: Descarga <Link to="https://www.balena.io/etcher/" target="_blank">Etcher</Link> para o teu sistema operativo e instálaa.

source: Plug your SD card, select your image and click "Flash"
fr: Insérez la carte SD, sélectionner votre iamge, et cliquez sur "Flash"
gl: Conecta a tarxeta SD, selecciona a imaxe e preme en "Gravar"

source: <TabItem value="usbimager" label="With USBimager">
fr: <TabItem value="usbimager" label="Avec USBimager">
gl: <TabItem value="usbimager" label="con USBimager">

source: Download [USBimager](https://bztsrc.gitlab.io/usbimager/) for your operating system and install it.
fr: Téléchargez [USBimager](https://bztsrc.gitlab.io/usbimager/) pour votre système d'exploitation et installez-le.
gl: Descarga [USBimager](https://bztsrc.gitlab.io/usbimager/) para o teu sistema operativo e instálaa.

source: Plug your SD card, select your image and click "Write"
fr: Insérez la carte SD, sélectionnez l'image puis cliquez sur "Écrire"
gl: Conecta a tarxeta SD, selecciona a imaxe e preme en "Escribir"

source: <TabItem value="dd" label="With dd">
fr: <TabItem value="dd" label="Avec dd">
gl: <TabItem value="dd" label="con dd">

source: If you are on GNU/Linux / macOS and know your way around command line, you may also flash your USB stick or SD card with `dd`. You can identify which device corresponds to your USB stick or SD card with `fdisk -l` or `lsblk`. A typical SD card name is something like `/dev/mmcblk0`. BE CAREFUL and make sure you got the right name.
fr: Si vous êtes sur GNU/Linux / macOS et que vous êtes à l'aise avec la ligne de commande, vous pouvez flasher votre clef USB ou carte SD avec la commande `dd`. Vous pouvez identifier le périphérique qui corresponds à votre clef USB ou carte SD avec `fdisk -l` ou `lsblk`. Typiquement, une carte SD a un nom comme `/dev/mmcblk0`. FAITES ATTENTION et assurez vous d'avoir le bon nom.
gl: Se utilizas GNU/Linux / macOS e estás habituada a usar a liña de ordes, podes gravar a tarxeta SD ou memoria USB con `dd`. Podes identificar o dispositivo USB ou tarxeta SD con `f-disk -l` ou `lsblk`. O nome típico para as tarxetas SD é algo como `/dev/mmcblk0`. PON COIDADO e comproba que seleccionas o nome correcto.

source: Then run:
fr: Puis lancez:
gl: Despois executa:

source: <FAIcon icon="fa-plug"/> Power up the board
fr: <FAIcon icon="fa-plug"/> Allumez la carte
gl: <FAIcon icon="fa-plug"/> Acende a placa

source: - Insert the SD card in the board - Connect your board to your home router via Ethernet - For advanced users requiring WiFi instead, please follow [the official documentation](https://docs.armbian.com/User-Guide_Autoconfig/#sample-config-file). - If you want to follow the initial boot, connect a screen and keyboard on your board. - Power up the board
fr: - Insérez la carte SD dans la carte ARM ; - Connectez la carte ARM à votre box internet avec le câble Ethernet - Pour les personnes avancées qui veulent plutôt utiliser le WiFi, suivre [la documentation officielle de Armbian](https://docs.armbian.com/User-Guide_Autoconfig/#sample-config-file). - Si vous voulez suivre le lancement initial de la carte, connectez un écran et clavier sur la carte ; - Branchez la carte.
gl: - Insire a tarxeta SD na placa - Conecta a placa por Ethernet ao encamiñador da casa - Para usuarias con experiencia que usen a conexión WiFi, sigue a [documentación oficial](https://docs.armbian.com/User-Guide_Autoconfig/#sample-config-file). - Se queres ver o inicio do sistema, conecta unha pantalla e teclado á túa placa. - Acende a placa

source: <FAIcon icon="fa-terminal"/> Connect to the board
fr: <FAIcon icon="fa-terminal"/> Se connecter à la carte
gl: <FAIcon icon="fa-terminal"/> Conectarse á placa

source: Next you need to [find the local IP address of your server](/admin/get_started/post_install/find_ip) to connect as root user [via SSH](/admin/command_line) with the temporary password `1234` (see [the Armbian doc](https://docs.armbian.com/User-Guide_Getting-Started/#how-to-login)).
fr: Il vous faut ensuite [trouver l'IP locale du serveur](/admin/get_started/post_install/find_ip) pour vous connecter avec l'utilisateur root [via SSH](/admin/command_line) avec le mot de passe temporaire `1234` (vois [la documentation d'Armbian](https://docs.armbian.com/User-Guide_Getting-Started/#how-to-login)).
gl: A continuación tes que [atopar o enderezo IP do teu servidor](/admin/get_started/post_install/find_ip) para acceder como usuaria root [a través de SSH](/admin/command_line) co contrasinal temporal `1234`(le a [documentación Armbian](https://docs.armbian.com/User-Guide_Getting-Started/#how-to-login)).
