Repository: YunoHost/doc
Catalog: i18n/docs/admin/50.troubleshooting__20.ipv6/*.po
Languages: fr

source: Setting up IPv6
fr: Configuration de l'IPv6

source: IPv6 may work out of the box in many cases. But in some cases or some specific provider, you may need to tweak things manually to enable IPv6.
fr: L'IPv6 peut fonctionner directement dans certains cas. Mais dans d'autres, ou chez certains hébergeurs spécifiques, vous devez activer l'IPv6 manuellement.

source: With a VPS from OVH
fr: Avec un VPS chez OVH

source: OVH gives one IPv4 address and one IPv6 address for VPS but by default, only IPv4 is OK. Please check [The OVH documentation](https://docs.ovh.com/gb/en/vps/configuring-ipv6/).
fr: OVH donne une adresse IPv4 et une IPv6 pour ses VPS, mais par défaut, seule l'IPv4 fonctionne. Veuillez regarder [The OVH documentation](https://docs.ovh.com/gb/en/vps/configuring-ipv6/)

source: Configure the DNS server
fr: Configurer le serveur DNS

source: Also check [the documentation for subdomains](/admin/tutorials/domains/dns_subdomains).
fr: Vous pouvez également regarder [la documentation pour les sous-domaines](/admin/tutorials/domains/dns_subdomains).

source: Configure the server
fr: Configurer le serveur

source: On the OVH panel, you will copy 3 elements:
fr: Sur le panneau de gestion d'OVH, vous aller récupérer 3 informations :

source: - the IPv6 address - the IPv6 gateway address - the IPv6 prefix. On OVH's VPS SSD, prefixes are `/128` because you have only *one* IPv6 address.
fr: - l'adresse IPv6 - l'adresse de la passerelle IPv6 - le préfixe IPv6. Sur les VPS SSD d'OVH, les préfixes sont `/128` car vous ne disposez que d'*une* seule adresse IPv6.

source: On your VPS, create a backup of the network configuration with : `cp /etc/network/interfaces ~/interfaces` in home directory. Then, you can edit the configuration file (`/etc/network/interfaces`) with the following.
fr: Sur votre VPS, vous allez créer une sauvegarde de votre fichier de configuration des interfaces réseau dans votre répertoire home avec la commande : `cp /etc/network/interfaces ~/interfaces`. Then, you can edit the configuration file (`/etc/network/interfaces`) with the following.

source: In this example, it is assumed that your network interface is `eth0`. If it's different (check with `ip a`) you need to adapt the example below.
fr: Dans cet exemple, il est supposé que votre interface est `eth0`. Si elle est différente (vérifiez avec `ip a`) il vous faudra adapter l'exemple ci-dessous.

source: Now, save the file and restart the network service with : `service networking restart`. (TODO : ideally we should find a way to validate the content of the configuration, otherwise it could fuck up the network stack and get disconnected from the VPS ?)
fr: Maintenant, enregistrez le fichier et redémarrez les services réseau avec : `service networking restart`. (TODO : ideally we should find a way to validate the content of the configuration, otherwise it could fuck up the network stack and get disconnected from the VPS ?)

source: Check your configuration with these commands :
fr: Vérifiez votre configuration avec les commandes :

source: - `ip a` to display network interfaces and addresses - `hostname -I` to display the system IP addresses - try to ping an IPv6 server (for example you can use `ping6 ip6.yunohost.org`) - try to ping your server from your PC (assuming your PC has IPv6 enabled)
fr: - `ip a` pour afficher les interfaces réseau et les adresses - `hostname -I` pour afficher les adresses IP du système - essayez d'envoyer une requête ping à un serveur IPv6 (par exemple, vous pouvez utiliser `ping6 ip6.yunohost.org`) - essayez d'envoyer une requête ping à votre serveur depuis votre PC (en supposant que votre PC dispose d'une connexion IPv6 et qu'elle soit activée)

source: If it's ok, it's ok !
fr: Et voilà !
