Repository: YunoHost/doc
Catalog: i18n/docs/admin/55.upgrade__11.0-bullseye/*.po
Languages: fr

source: Migrating from 4.x to 11.x
fr: Migrer de 4.x à 11.x

source: This page is dedicated to help you migrating an instance from YunoHost 4.4.x (running on Debian Buster/10.x) to YunoHost 11.x (running on Debian Bullseye/11.x). Note: we decided to skip the version numbers from 5 to 10 to follow the Debian version numbers.
fr: Cette page est destinée à vous aider à migrer une instance de YunoHost 4.4.x (fonctionnant sous Debian Buster/10.x) vers YunoHost 11.x (fonctionnant sous Debian Bullseye/11.x). Remarque : nous avons décidé de sauter les numéros de version 5 à 10 afin de suivre la numérotation des versions Debian.

source: Important notes
fr: Notes importantes

source: - The YunoHost team did its best to make sure that the migration is as smooth as possible and was tested over the course of several months in several cases.
fr: - L'équipe YunoHost a fait tout son possible pour que la migration se déroule dans les meilleures conditions possibles et l'a testée pendant plusieurs mois dans différents cas de figure.

source: - With that said, please be aware that this is a delicate operation. System administration is a complicated topic and covering every particular case is quite hard. Therefore, if you host critical data and services, please [make backups](/admin/backups). And in any case, be patient and attentive during the migration.
fr: - Cela dit, sachez qu'il s'agit d'une opération délicate. L'administration système est un sujet complexe et il est très difficile de couvrir tous les cas particuliers. Par conséquent, si vous hébergez des données et des services critiques, veuillez [effectuer des sauvegardes](/admin/backups). Et dans tous les cas, soyez patient et attentif pendant la migration.

source: - Please don't rush into thinking that you should need to reinstall your system from scratch thinking it would be "simpler" (sigh). (A common attitude is to be willing to reinstall a server at the slightest complication...). Instead, if you happen to run into issues, we encourage you to try to investigate and understand what's going on and [reach for help on the chat and the forum](/community/help).
fr: - Ne vous précipitez pas en pensant que vous devriez réinstaller votre système à partir de zéro, croyant que ce serait "plus simple" (soupir). (Une attitude courante consiste à vouloir réinstaller un serveur à la moindre complication ...). Au contraire, si vous rencontrez des problèmes, nous vous encourageons à essayer de comprendre ce qui se passe et à [demander de l'aide sur le chat et le forum](/community/help).

source: - **You should watch the known issues at the bottom of this page, to be sure your migrations will work properly.**
fr: - **Vous devriez consulter les problèmes connus au bas de cette page, afin de vous assurer que vos migrations fonctionneront correctement.**

source: Migration procedure
fr: Procédure de migration

source: From the webadmin
fr: Depuis la webadmin

source: After upgrading to 4.4.x, go to Tools > Migrations to access the migrations interface. You will have to read carefully and accept the disclaimer then launch the migration.
fr: Après la mise à niveau vers la version 4.4.x, allez dans Outils > Migrations pour accéder à l'interface de migration. Vous devrez lire attentivement et accepter la clause de non-responsabilité, puis lancer la migration.

source: From the command line
fr: Depuis la ligne de commande

source: After upgrading to 4.4.x, run:
fr: Après la mise à niveau vers la version 4.4.x, exécutez :

source: then read carefully and accept the disclaimer.
fr: puis lisez attentivement et acceptez la clause de non-responsabilité.

source: During the migration
fr: Pendant la migration

source: Depending on your hardware and packages installed, the migration might take up to a few hours.
fr: En fonction de votre matériel et des paquets installés, la migration peut prendre jusqu'à plusieurs heures.

source: The logs will be shown in the message bar (you can hover it to see the whole history). They will also be available after the migration (like any other operations) in Tools > Logs.
fr: Les journaux (logs) seront affichés dans la barre de messages (vous pouvez passer la souris dessus pour voir l'historique complet). Ils seront également disponibles après la migration (comme toutes les autres opérations) dans Outils > Journaux.

source: Note that even if you close the webadmin page for some reason, the migration will continue in the background (but the webadmin will be partially unavailable).
fr: Notez que même si vous fermez la page webadmin pour une raison quelconque, la migration se poursuivra en arrière-plan (mais la webadmin sera partiellement indisponible).

source: If the migration crashed / failed at some point
fr: Si la migration a planté / échoué à un moment donné

source: If the migration failed at some point, it should be possible to relaunch it. If it still doesn't work, you can try to [get help](/community/help) (please provide the corresponding messages or whatever makes you say that it's not working).
fr: Si la migration a échoué à un moment donné, il devrait être possible de la relancer. Si cela ne fonctionne toujours pas, vous pouvez essayer de [trouver de l'aide](/community/help) (veuillez fournir les messages correspondants ou tout autre élément qui vous fait penser que ça n'a pas marché).

source: What to do after the upgrade
fr: Que faire après la mise à niveau

source: Check that you actually are on Debian Bullseye and YunoHost 11.x
fr: Vérifiez que vous êtes bien sous Debian Bullseye et YunoHost 11.x

source: For this, go to Diagnosis (category Base system) or look at the footer of the webadmin. In the command line, you can use `lsb_release -a` and `yunohost --version`.
fr: Pour cela, rendez-vous dans Diagnostic (catégorie Système de base) ou consultez le pied de page de la webadmin. En ligne de commande, vous pouvez utiliser `lsb_release -a` et `yunohost --version`.

source: Run the migration to repair your python app
fr: Lancez la migration pour réparer votre application Python

source: After upgrading, your python apps should be unavailable because their virtual environment (venv) needs to be rebuilt.
fr: Après la mise à niveau, vos applications Python devraient être indisponibles car leur environnement virtuel (venv) doit être reconstruit.

source: To do that you can run the pending migrations in `Webadmin > Update`. The apps below won't be automatically repaired, you need to force-upgrade them manually instead with `yunohost app upgrade -F APP`.
fr: Pour ce faire, vous pouvez exécuter les migrations en attente dans `Webadmin > Mises à jour`. Les applications ci-dessous ne seront pas réparées automatiquement, vous devez les mettre à niveau manuellement à l'aide de la commande `yunohost app upgrade -F APP`.

source: Apps which won't be automatically repaired and need a force upgrade:
fr: Ces applications ne seront pas réparées automatiquement et nécessiteront une mise à niveau forcée :

source: - calibreweb - django-for-runners - ffsync (this app is in python2 and no longer maintained, no guarantee) - jupiterlab - librephotos - mautrix - mediadrop - mopidy - pgadmin - tracim - synapse - weblate
fr: - calibreweb - django-for-runners - ffsync (cette application est en python2 et n'est plus maintenue, donc sans aucune garantie) - jupiterlab - librephotos - mautrix - mediadrop - mopidy - pgadmin - tracim - synapse - weblate

source: If needed, you can disable the automatic rebuild for a specific python app, by removing the dedicated file ending with `.requirements_backup_for_bullseye_upgrade.txt` before applying the migration. You can find this file near the venv (Python virtual environment) of your app inside `/opt` or `/var/www`.
fr: Si nécessaire, vous pouvez désactiver la reconstruction automatique pour une application Python spécifique, en supprimant le fichier dédié se terminant par `.requirements_backup_for_bullseye_upgrade.txt` avant d'appliquer la migration. Vous trouverez ce fichier près du venv (environnement virtuel Python) de votre application dans `/opt` ou `/var/www`.

source: Check that no issue appeared in the diagnosis
fr: Vérifiez qu'aucun problème n'est apparu dans le diagnostic

source: Also in the webadmin Diagnosis section, make sure that no specific issue appeared after running the migration (for example a service that crashed for some reason).
fr: Dans la section Diagnostic de l'interface d'administration Web, assurez-vous également qu'aucun problème spécifique n'est apparu après l'exécution de la migration (par exemple, un service qui s'est arrêté pour une raison quelconque).

source: If the service `php7.3-fpm` appears to be dead, you should upgrade your PHP apps like the custom web app. Next, you can run `apt autoremove`.
fr: Si le service `php7.3-fpm` semble être inactif, vous devez mettre à niveau vos applications PHP, telles que les applications web personnalisées. Ensuite, vous pouvez exécuter `apt autoremove`.

source: Check that your applications are working
fr: Vérifiez que vos applications fonctionnent correctement

source: Test that your applications are working. If they aren't, you should try to upgrade them (it is also a good idea to upgrade them even if they are working anyway).
fr: Vérifiez que vos applications fonctionnent correctement. Si ce n'est pas le cas, essayez de les mettre à jour (il est également recommandé de les mettre à jour même si elles fonctionnent correctement).

source: If your app is broken and you were already with the latest version, you can rerun the upgrade thanks to the `-F|--force` option:
fr: Si votre application ne fonctionne plus et que vous disposiez déjà de la dernière version, vous pouvez relancer la mise à niveau grâce à l'option `-F|--force` :

source: Current known issues after the migration
fr: Problèmes courants connus après la migration

source: Can't run the migration due to `libc6-dev : Breaks: libgcc-8-dev issue`
fr: Impossible d'exécuter la migration en raison de `libc6-dev : Breaks : libgcc-8-dev issue`

source: Note: This issue should be resolved in `yunohost_version`: `4.4.2.13` You have an app that depends on the `build-essential` package.
fr: Remarque : ce problème devrait être résolu dans `yunohost_version` : `4.4.2.13` Vous disposez d'une application qui dépend du paquet `build-essential`.

source: See this [solution](https://forum.yunohost.org/t/migration-to-11-wont-start-libc6-dev-breaks-libgcc-8-dev/20617/42) to fix it manually
fr: Consultez cette [solution](https://forum.yunohost.org/t/migration-to-11-wont-start-libc6-dev-breaks-libgcc-8-dev/20617/42) pour le corriger manuellement.

source: DNSmasq is not running anymore
fr: DNSmasq ne fonctionne plus

source: We haven't yet found solution for this issue.
fr: Nous n'avons pas encore trouvé de solution à ce problème.

source: No ethernet connexion after rebooting following a migration on a Raspberry Pi 4
fr: Pas de connexion Ethernet après redémarrage suite à une migration sur un Raspberry Pi 4

source: If you have not yet rebooted your server, don't do it (we are looking for a solution). This will avoid you the use of a keyboard and screen.
fr: Si vous n'avez pas encore redémarré votre serveur, ne le faites pas (nous recherchons une solution). Cela vous évitera d'utiliser un clavier et un écran.

source: We found this in the Raspberry Pi documentation
fr: Nous avons trouvé ceci dans la documentation du Raspberry Pi.

source: > when the dhcpcd5 package is updated to the latest version (1:8.1.2-1+rpt1 -> 1:8.1.2-1+rpt2), the Raspberry Pi will fail to obtain a DHCP IP address following the next reboot or startup. This problem can be avoided by disabling and re-enabling the "System Options -> Network at Boot" option using the latest raspi-config after the dhcpcd5 package has been updated and prior to the system being shutdown or rebooted
fr: > Lorsque le paquet dhcpcd5 est mis à jour vers la dernière version (1:8.1.2-1+rpt1 -> 1:8.1.2-1+rpt2), le Raspberry Pi ne parvient pas à obtenir une adresse IP DHCP après le redémarrage suivant ou au démarrage. Ce problème peut être évité en désactivant puis en réactivant l'option "System Options -> Network at Boot" (Options système -> Réseau au démarrage) à l'aide de la dernière version de raspi-config après la mise à jour du paquet dhcpcd5 et avant l'arrêt ou le redémarrage du système.

source: If you are using a Raspberry Pi 4 (or maybe 3), see this [solution](https://forum.yunohost.org/t/aucun-acces-a-internet-suite-a-migration-4-4-to-11-depuis-raspberry-pi-4-pi-400/20652/17)
fr: Si vous utilisez un Raspberry Pi 4 (ou peut-être un RPi 3), consultez cette [solution](https://forum.yunohost.org/t/aucun-acces-a-internet-suite-a-migration-4-4-to-11-depuis-raspberry-pi-4-pi-400/20652/17).

source: Restore ynh4 backup onto a fresh ynh11
fr: Restaurer la sauvegarde ynh4 sur un nouveau ynh11

source: If you can't restore your app but your system has been restored, you probably should use the regen conf to fix the nginx issues:
fr: Si vous ne parvenez pas à restaurer votre application mais que votre système a été restauré, vous devriez probablement utiliser regen conf pour résoudre les problèmes nginx :

source: After that you should be able to restore your apps. Don't forget to force upgrade them if you have 502 errors.
fr: Après cela, vous devriez pouvoir restaurer vos applications. N'oubliez pas de forcer leur mise à jour si vous obtenez des erreurs 502.
