Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__40.post_install__10.find_ip/*.po
Languages: fr

source: Find your server's local IP
fr: Trouver l’IP locale de son serveur

source: On an installation at home, your server should typically be accessible using the `yunohost.local` domain. If for any reason this does not work, you may need to find the *local* IP of your server.
fr: Dans le cas d'une installation à la maison, votre serveur devrait typiquement être accessible (depuis son réseau local) avec le domaine `yunohost.local`. Si pour une raison quelconque cela ne fonctionne pas, il vous faut peut-être trouver l'IP *locale* de votre serveur.

source: What is a local IP?
fr: Qu'est ce qu'une IP locale ?

source: The local IP is the address used to refer to your server inside the local network (typically your home) where multiple devices are connected to a router (your internet box). The local IP typically looks like `192.168.x.y` (or sometimes `10.0.x.y` or `172.16.x.y`)
fr: L'IP locale d'une machine est utilisée pour y faire référence à l'intérieur d'un réseau local (typiquement le réseau dans une maison) où plusieurs appareils se connectent à un même routeur (votre box internet). Une adresse IP locale ressemble généralement à `192.168.x.y` (ou parfois `10.0.x.y` ou `172.16.x.y`)

source: How to find it?
fr: Comment la trouver ?

source: Any of these tricks should allow you to find the local IP of your server:
fr: L'une de ces astuces devrait permettre de trouver l'IP locale de votre serveur :

source: <TabItem value="angryip" label="With AngryIP (Recommended)" default>
fr: <TabItem value="angryip" label="Avec AngryIP (recommandé)" default>

source: You can use the [AngryIP](https://angryip.org/download/) software to achieve that. You can scan these local IP ranges in this order until you find the active IP corresponding to your server:
fr: Vous pouvez utiliser le logiciel [AngryIP](https://angryip.org/download/) pour y parvenir. Vous pouvez scanner ces plages d'IP dans cet ordre jusqu'à trouver l'IP correspondante à votre serveur :

source: - you can order by ping like on this screenshot to easily see effectively-used IP. - your server should typically be displayed as listening on port 80 and 443 - when in doubt, just type `https://192.168.x.y` in your browser to check if it's a YunoHost or not.
fr: - vous pouvez passer par la commande ping comme sur cette capture d'écran afin de voir facilement les adresses IP utilisées. - votre serveur devrait normalement s'afficher comme étant à l'écoute sur les ports 80 et 443. - en cas de doute, tapez simplement `https://192.168.x.y` dans votre navigateur pour vérifier s'il s'agit bien d'un serveur YunoHost.

source: <TabItem value="router" label="With your internet router / box">
fr: <TabItem value="router" label="Avec votre box internet">

source: Connect to your internet box / router interface to list the machines connected.
fr: Utilisez l'interface de votre box internet pour lister les machines connectées.

source: <TabItem value="arp-scan" label="With arp-scan">
fr: <TabItem value="arp-scan" label="Avec arp-scan">

source: If you're using Linux, you can open a terminal and use `sudo arp-scan --local` to list the IP on your local network (this may also work in Windows);
fr: Si vous êtes sous Linux, ouvrez un terminal et tapez `sudo arp-scan --local` pour lister les IP des machines sur le réseau local (ceci fonctionne aussi peut-être sous Windows) ;

source: If the `arp-scan` command displays a confusing number of devices, you can check which ones are open to SSH with `nmap -p 22 192.168.1.0/24` to sort them out (adapt the IP range to your local network)
fr: Si la commande `arp-scan` vous affiche beaucoup de machines, vous pouvez vérifier lesquelles sont ouvertes au SSH avec `nmap -p 22 192.168.1.0/24` pour faire du tri (adaptez la plage IP selon votre réseau local)

source: <TabItem value="direct" label="With a direct access on the server">
fr: <TabItem value="direct" label="Avec un accès direct au serveur">

source: Plug a screen on your server, log in and type `hostname --all-ip-address`.
fr: Branchez un écran sur votre serveur, loggez-vous et tapez `hostname --all-ip-address`.

source: The default credentials (before post-installation!) to log in are:
fr: Les identifiants par défaut (avant la post-installation !) sont :

source: - login: `root` - password: `yunohost`
fr: - identifiant : `root` - mot de passe : `yunohost`

source: (If you are using a raw Armbian image instead of the pre-installed YunoHost image, the credentials are root / 1234)
fr: (Si vous utilisez une image Armbian brute plutôt que les images YunoHost pré-installées, les identifiants sont root / 1234)

source: I still can't find my local IP
fr: Je ne trouve toujours pas mon IP locale

source: If you are unable to find your server using any of the previous tricks, maybe your server did not boot correctly:
fr: Si vous n'êtes pas capable de trouver votre serveur avec les méthodes précédentes, alors peut-être que votre serveur n'a pas démarré correctement.

source: - Make sure that your server is properly plugged in; - If you're using an SD card, make sure the connector is not too dusty; - Plug a screen on your server and try to reboot to check that it's properly booting; - Make sure that your ethernet cable is working and properly plugged in;
fr: - Assurez-vous que votre serveur est correctement branché ; - Si vous utilisez une carte SD, assurez-vous que le connecteur n'est pas trop poussiéreux ; - Branchez un écran sur votre serveur et essayez de le redémarrer pour vérifier qu'il démarre correctement ; - Assurez-vous que votre câble Ethernet fonctionne et qu'il est correctement branché ;
