Repository: YunoHost/doc
Catalog: i18n/docs/admin/25.domains__certificate/*.po
Languages: de, es, fr, it

source: <TabItem value="web" label="From the web interface">
fr: <TabItem value="web" label="Depuis la webadmin">

source: <TabItem value="cli" label="From the command line">
fr: <TabItem value="cli" label="Depuis la ligne de commande">

source: Certificate
de: Zertifikat
es: Certificado
fr: Certificat
it: Certificati

source: Certificates are used to guarantee the confidentiality and authenticity of the communication between a web browser and your server. In particular, they protect against attackers trying to impersonate your server.
de: Digitale Zertifikate werden verwendet, um die Vertraulichkeit und Echtheit der Kommunikation zwischen einem Webbrowser und Ihrem Server zu gewährleisten. Insbesondere schützen sie vor Angreifern, die versuchen, Ihren Server zu identifizieren.
es: Los certificados sirven para garantizar la confidencialidad y la autenticidad de las comunicaciones entre un navegador web y tu servidor. En particular, permite proteger los visitantes contra atacantes que podrían intentar de robar la identidad del servidor.
fr: Les certificats sont utilisés pour garantir la confidentialité et l'authenticité des communications entre un navigateur web et votre serveur. En particulier, il permet de protéger les visiteurs contre des attaquants qui chercheraient à usurper l'identité du serveur.
it: I certificati sono utilizzati per garantire la confidenzialità e l'autenticità delle comunicazioni tra il browser e il server. In particolare proteggono il visitatore del sito da usurpazioni dell'identità del server.

source: YunoHost provides a **self-signed** certificate, it means that your server guaranties the certificate validity. It's enough **for personal usage**, because you trust your own server. But this could be a problem if you want to open access to anonymous like web user for a website.
de: YunoHost bietet ein **selbstsigniertes-Zertifikat**. Es bedeutet, dass Ihr Server die Gültigkeit des Zertifikats garantiert. Es genügt **für eine persönliche Verwendung**, weil Sie Ihrem eigenen Server vertrauen. Dies könnte jedoch ein Problem sein, wenn Sie den Zugriff auf einem Fremden, wie Webbenutzer, für eine Website öffnen möchten.
es: Por defecto, YunoHost provee un certificado **auto-firmado**, lo que significa que es tu servidor el que garantiza la validez del certificado. Es suficiente **en el caso de un uso personal**, porque puedes confiar en tu propio servidor, pero esto planteará problemas si piensas en abrir el acceso a tu servidor a personas anónimas, por ejemplo si quieres alojar un sitio web.
fr: YunoHost fournit par défaut un certificat **auto-signé**, ce qui veut dire que c’est votre serveur qui garantit la validité du certificat. C’est suffisant **pour un usage personnel**, car vous pouvez avoir confiance en votre serveur, en revanche cela posera problème si vous comptez ouvrir l’accès à votre serveur à des anonymes, par exemple pour héberger un site web.
it: YunoHost fornisce di default un certificato **auto firmato**, cioè il vostro server garantisce la validità del certificato. Questo metodo è valido per un **uso personale** del vostro server, del quale certamente vi fidate, mentre non è sufficiente se volete esporre il vostro server su internet ad esempio se esso ospita un sito web.

source: In practice, visitors will see a screen list this:
de: Und zwar, werden die Benutzer eine solche Warnung auf dem Bildschirm sehen:
es: En efecto, los usuarios deberán pasar por una pantalla de este tipo :
fr: En effet, les utilisateurs devront passer par un écran de ce type :
it: Con questa configurazioni chi accede al vostro sito vedrà una schermata del tipo:

source: Which basically asks the visitor : **"Do you trust the server hosting this website?"**. This can rightfully frighten a lot of people.
de: Was im Wesentlichen den Besucher fragt: **"Vertrauen Sie dem Server, der diese Website hostet?"**. Dies kann viele Menschen selbstverständlich erschrecken.
es: Esta pantalla equivale a que te pidan ** ¿ Confías en el servidor que aloja este sitio ? ***. Esto puede asustar tu usuarios (con toda la razón).
fr: Cet écran revient à demander **« Avez-vous confiance au serveur qui héberge ce site ? »**. Cela peut effrayer vos utilisateurs (à juste titre).
it: Il browser fondamentalmente ci chiede **«Potete fidarvi del server che ospita questo sito?»** e giustamente molti visitatori possono preoccuparsi davanti a tale domanda.

source: Install a Let's Encrypt certificate
de: Digitales Zertifikat Let's Encrypt installieren
es: Instalar un certificado Let's Encrypt
fr: Installer un certificat Let's Encrypt
it: Installare un certificato Let's Encrypt

source: Before attempting to install a Let's Encrypt certificate, you should make sure that your DNS is correctly configured (your.domain.tld should point to your server's IP) and that your domain is accessible through HTTP from outside your local network (i.e. at least port 80 should be forwarded to your server).
de: Bevor Sie ein Let's Encrypt-Zertifikat installieren, vergewissern Sie sich, dass Ihr DNS ordnungsgemäß konfiguriert ist (Ihre.Domain.tld sollte auf die IP Ihres Servers zeigen) und Ihre Website von außen in HTTP zugänglich ist (d. h. zumindest der Port 80 wird korrekt an Ihren Server umgeleitet).
es: Antes de intentar la instalación de un certificado Let's Encrypt, primero debes asegurarte de que el DNS está configurado correctamente (tu.dominio.tld debe apuntar hacia la IP de tu servidor) y que el sitio está accesible en HTTP desde afuera (i.e. por lo menos que el puerto 80 está correctamente redirigido hacia tu servidor).
fr: Avant de chercher à installer un certificat Let's Encrypt, assurez vous que votre DNS est correctement configuré (votre.domaine.tld doit pointer sur l'IP de votre serveur) et que votre site est accessible en HTTP depuis l'extérieur (c.-à-d. qu'au moins le port 80 est correctement redirigé vers votre serveur).
it: Prima di installare il certificato Let's Encrypt, assicuratevi che il vostro DNS sia correttamente configurato (nomevostrodominio.tld deve puntare all'indirizzo IP del vostro server) e che il vostro sito sia accessibile in HTTP dall'esterno (la porta 80 deve essere aperta e rediretta verso il vostro server).

source: Go to the 'Domain' part of the admin interface, then in the section dedicated to your.domain.tld. You should find a 'SSL certificate' button:
de: Gehen Sie zu dem Abschnitt "Domaine" der Administrationsoberfläche. Dann zu dem Abschnitt, der Ihrer Domain entspricht. Da steht einen Knopf 'Certificat SSL'.
es: En la categoría 'Dominio' de la interfaz de administración, y luego en la sección dedicada a tu dominio, encontrarás un botón 'Certificado SSL'.
fr: Rendez-vous dans la partie 'Domaines' de l'interface d'administration, puis dans la section dédiée à votre domaine. Vous trouverez un bouton 'Certificat SSL'.
it: Recatevi nella sezione 'Domini' dell'interfaccia di amministrazione, scegliete la sezione del vostro dominio, qui troverete un pulsante 'Certificato SSL'

source: In the 'SSL certificate' section, you can see the status of the current certificate. If you just added the domain, it should be a self-signed certificate.
de: Im Abschnitt 'Certificat SSL', wird der aktuelle Status angegeben. Wurde der Domain-Name vor kurzem hinzugefügt, so steht ein selbst-signiertes Zertifikat zur verfügung.
es: En la sección 'Certificado SSL', puedes ver el estado corriente del certificado. Si acabas de añadir el dominio, ya dispone de un certificado auto-firmado.
fr: Dans la section 'Certificat SSL', vous pourrez voir l'état actuel du certificat. Si vous venez d'ajouter le domaine, il dispose d'un certificat auto-signé.
it: Nella sezione 'Certificati SSL' potere visualizzare lo stato attuale del certificato. Se avete appena creato il dominio, esso disporrà di un certificato auto firmato.

source: If your domain is correctly configured, it is then possible to install the Let's Encrypt certificate via the green button.
de: Wenn die Domain korrekt konfiguriert ist, dann ist es möglich mit dem grünen Knopf ein Let's Encrypt-Zertifikat einzusetzen.
es: Si tu dominio está configurado correctamente, es posible instalar un certificado Let's Encrypt vía el botón verde.
fr: Si votre domaine est correctement configuré, il vous est alors possible de passer à un certificat Let's Encrypt via le bouton vert.
it: Se il vostro dominio è correttamente configurato è possibile installare il certificato Let's Encrypt con il bottone verde.

source: Once the install is made, you can check that the certificate is live via your browser by going to your domain in HTTPS. The certificate will automatically be renewed every three months.
de: Nach Abschluss der Installation, die ensprechende Domain mit Webbrowser in HTTPS-Modus besuchen um die Berücksichtigung des digitalen Zertifikats von Let's Encrypt zu überprüfen. Das digitale Zertifikat wird automatisch etwa alle drei Monate erneuert.
es: Una vez la instalación terminada, puedes ir a tu dominio vía tu navegador, en HTTPS, para comprobar que tu certificado está bien firmado por Let's Encrypt. El certificado se renovará automáticamente al cabo de cada periodo de tres meses.
fr: Une fois l'installation effectuée, vous pouvez vous rendre sur votre domaine via votre navigateur, en HTTPS, pour vérifier que votre certificat est bien signé par Let's Encrypt. Le certificat sera renouvelé automatiquement tous les trois mois environ.
it: Una volta installato il certificato potete verificarne il corretto funzionamento collegandovi con il vostro browser al dominio in HTTPS. Il certificato verrà automaticamente rinnovato ogni tre mesi.

source: Connect to your server through SSH.
de: SSH-Zugang auf Ihrem Server herstellen.
es: Conectate en tu servidor en SSH.
fr: Connectez-vous sur votre serveur en SSH.
it: Collegatevi al server con SSH.

source: You can check the status of your current certificate with:
de: So können Sie den aktuellen Status des digitalen Zertifikats überprüfen
es: Puedes comprobar el estatus corriente de tu certificado vía
fr: Vous pouvez vérifier le statut actuel de votre certificat via :
it: Potete controllare lo stato del certificato in uso con il comando:

source: Install a Let's Encrypt certificate with
de: Dann Let's Encrypt-Zertifikat installieren
es: Instala el certificado Let's Encrypt vía
fr: Installez le certificat Let's Encrypt via :
it: Installate il certificato Let's Encrypt con il comando:

source: This should return :
de: Ergebnis sollte so aussehen :
es: Este comando debe devolverte :
fr: Cette commande doit retourner :
it: Che dovrebbe dare come risultato:

source: Once this is done, you can check that the certificate is live via your browser by going to your domain in HTTPS. The certificate will automatically be renewed every three months.
de: Nach Abschluss der Installation, die ensprechende Domain mit Webbrowser in HTTPS-Modus besuchen um die Berücksichtigung des digitalen Zertifikats von Let's Encrypt zu überprüfen. Das digitale Zertifikat wird automatisch etwa alle drei Monate erneuert.
es: Una vez que la instalación está terminada, puedes dirigirte a tu dominio vía tu navegador, en HTTPS, para comprobar que el certificado está bien firmado por Let's Encrypt. El certificado se renovará automáticamente al cabo de cada periodo de tres meses.
fr: Une fois l'installation effectuée, vous pouvez vous rendre sur votre domaine via votre navigateur, en HTTPS, pour vérifier que votre certificat est bien signé par Let's Encrypt. Le certificat sera renouvelé automatiquement tous les trois mois environ.
it: Una volta installato il certificato potete verificarne il corretto funzionamento collegandovi con il vostro browser al dominio in HTTPS. Il certificato verrà automaticamente rinnovato ogni tre mesi.

source: Troubleshooting
de: Fehlerbehebung
es: Si hay un problema
fr: En cas de problème
it: Problemi e soluzioni

source: If due to some bad tweaking, your certificate ends up in a bad state (e.g. lost the certificate or unable to read the files), you should be able to clean the situation by regenerating a self-signed certificate:
de: Wenn das Zertifikat aufgrund einer schlechten Handhabung nicht funktionsfähig ist (z. B. Verlust des Zertifikats oder Dateien nicht lesbar), ist es trotzdem möglich ein selbst-signiertes Zertifikat zu regenerieren :
es: Si, después de una manipulación incorrecta, un certificado se encuentra en una mala situación (e.g. pérdida del certificado o imposibilidad de leerlo), es posible regenerar un certificado autofirmado :
fr: Si, suite à une mauvaise manipulation, un certificat se retrouve dans une situation fâcheuse (e.g. perte du certificat ou impossible de lire le certificat), il est possible de repartir sur des bases propres en regénérant un certificat auto-signé :
it: Se il vostro certificato risultasse non funzionante a causa di qualche errore (ad esempio lo avete perso oppure non siete in grado di leggere i file) potete ripulire la situazione rigenerando un certificato autofirmato con questo comando:

source: If YunoHost thinks that your domain is badly configured despite the fact that you checked the DNS configuration and you have access in HTTP to your server from outside your local network, then you can:
de: Trotz einer sorgfältigen Überprüfung der DNS-Konfiguration und auch von außen die Möglichkeit mit HTTP-Modus Zugriff auf den Webserver besteht, kann YunoHost manchmal die Einstellungen verweigern. In diesem Fall ist es notwendig :
es: Si YunoHost te dice que tu dominio está mal configurado mientras que has verificado tu configuración DNS y que tienes acceso a tu servidor en HTTP desde afuera, puedes intentar :
fr: Si YunoHost trouve que votre domaine est mal configuré quand bien même vous avez bien vérifié votre configuration DNS et avez bien accès à votre serveur en HTTP depuis l'extérieur, vous pouvez tenter :
it: Se YunoHost pensa che il vostro dominio non è configurato correttamente nonstante abbiate controllato la configurazione del DNS e riuscite a collegarvi in HTTP al vostro server anche dall'esterno della rete locale allora potete:

source: To avoid this confusion, it's possible to get a certificate signed a known authority named **Let's Encrypt** which provide free certificates directly recognized by browsers. YunoHost allows to directly install this certificate from the web administration interface or from the command line.
de: Um diese Verwirrung zu vermeiden, ist es möglich, ein digitales Zertifikat zu erhalten, welches direkt von den Browsern anerkannt wurde, und von einer "bekannten" Zertifizierungsstelle unterzeichnet wird: **Let's Encrypt**, **Gandi**, **RapidSSL**, **StartSSL**, **Cacert**.
it: Per evitare questa situazione è possibile ottenere un certificato riconosciuto dai browser e firmato da un'autorità conosciuta come **Let's Encrypt**, **Gandi**, **RapidSSL**, **StartSSL**, **Cacert**.
