Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__25.external_storage/*.po
Languages: it

source: Introduction
it: Introduzione

source: Adding an external storage to your server
it: Aggiungere un disco esterno al vostro server

source: Apart from the monitoring system that ensures that your system's partitions are not too small, YunoHost does not currently deal with the organisation of your partitions and disks.
it: Oltre al monitoraggio delle dimensioni delle partizioni (che controlla che non siano troppo piccole), YunoHost non si occupa, al momento, dell'organizzazione delle partizioni dei vostri dischi.

source: If you are hosting on an ARM card with an SD card or on a server with a small SSD drive, you may, for reasons of reliability or lack of space, want to add a drive or drives to your server.
it: Se la vostra configurazione è basata su una board ARM con scheda SD, oppure il server dispone di un disco SSD di piccole dimensioni, potreste, per motivi di spazio o di sicurezza, voler aggiungere uno o più dischi al vostro server.

source: If you have no space left on your server at all, you can now type `apt clean` to try and save some space while you clean up or follow the steps below.
it: Se avete esaurito lo spazio sul disco del vostro server, potete provare con il comando `apt clean` per tentare di recuperarne un po' e avere modo di seguire le istruzioni di seguito riportate.

source: Below you will find explanations on how to move your data to a hard disk in a correct way with a minimum of impact on the functioning of YunoHost. This operation can be done during installation or, afterwards, when your storage needs have increased or when you no longer trust your SD card.
it: Troverete qui le istruzioni per riuscire a spostare i vostri dati su un disco esterno in modo corretto e con un impatto minimo sul funzionamento di YunoHost. Potete eseguire lo spostamento durante l'installazione o in un secondo momento, quando si presenterà la necessità di più spazio o temete per l'affidabilità della scheda SD.

source: The method presented here will first mount the single partition of the hard disk, then use one or more sub-folders of this disk to create different mount points on your system tree. This method is preferable to the use of symbolic links, as the latter may interfere with some applications including the YunoHost backup system. You could also choose to mount partitions rather than subfolders, but it is sometimes difficult to estimate the weight of a folder in advance.
it: Il procedimento presentato qui inizia montando l'unica partizione del disco, in seguito utilizza una o più sotto-cartelle per creare diversi punti di montaggio sull'albero del file system del pc. Questo metodo è preferibile rispetto al utilizzo di link simbolici poiché questi possono entrare in conflitto con alcune applicazioni, tra le quali il sistema di backup di YunoHost. Potreste scegliere di montare le partizioni invece che le sotto-cartelle, ma sorge la difficoltà di prevedere la stima della dimensione della cartella.

source: <FAIcon icon="fa-list-alt"/> Prerequisites
it: <FAIcon icon="fa-list-alt"/> Prerequisiti

source: 1. Identify directories to be moved
it: 1. Identificare le cartelle da spostare

source: The `ncdu /` command allows you to browse the folders on your server to see how big they are.
it: Il comando `ncdu` vi permette di navigare tra le cartelle del vostro server affinché possiate conoscerne la loro dimensione.

source: Below is an explanation of some of the paths that can take up weight with some comments to help you reduce their weight or choose to move them.
it: Di seguito, alcuni esempi di percorsi che possono essere di notevoli dimensioni e qualche consiglio su come ridurre la loro dimensione o perché sceglierli tra quelli da spostare.

source: 2. Connect and identify the disk
it: 2. Collegare e identificare il disco

source: Start by connecting your disk to your system. You must then identify the name under which the disk is designated by the system.
it: Collegate il disco al server e identificate il nome assegnato dal sistema.

source: To do this, use the command :
it: Utilizzate il comando:

source: It may return something like :
it: La risposta potrebbe essere qualcosa di simile

source: Here, `mmcblk0` corresponds to a 16GB SD card (you can see that the `mmcblk0p1` and `mmcblk0p2` partitions correspond to the `/boot` partition and the `/` system partition). The hard drive connected corresponds to `sda` which is about 1TB, and contains a single `sda1` partition which is not mounted (no "MOUNTPOINT").
it: In questo caso `mmcblk0` corrisponde ad una scheda SD di 16 GB (si nota che le partizioni `mmcblk0p1` e `mmcblk0p2` corrispondono rispettivamente alla partizione di `/boot` e alla partizione di sistema `/`). Il disco esterno collegato corrisponde a `sda`, ha una capacità di circa 1GB, e contiene una sola partizione `sda1` che non è montata (non ha nessun riferimento nella colonna "MOUNTPOINT").

source: <FAIcon icon="fa-exclamation-triangle"/> On another system, it may be that your system is installed on `sda` and your disk is then `sdb` for example.
it: <FAIcon icon="fa-exclamation-triangle"/> In alcuni casi il sistema operativo è installato su `sda` e di conseguenza il vostro disco sarà `sdb`

source: If the size of the disk is not enough for you to recognise it, you can unplug the disk, run the `lsblk` command, then plug the disk back in, run `lsblk` and deduce the differences.
it: Suggerimento! se la dimensione del disco non è sufficiente per essere riconosciuto, potete scollegare il disco e eseguire il comando `lsblk`, ricollegare il disco, eseguire nuovamente `lsblk` e osservare le differenze di output.

source: 3. (Optional) Format the disk
it: 3. Formattare il disco (Se necessario)

source: This operation is optional if your disk is already formatted with a file system supported by linux (so not NTFS or FAT32).
it: Se il vostro disco è formattato con un filesystem supportato da Linux (quindi non FAT32 o NTFS) potete andare al punto successivo, diversamente.

source: Let's create a partition on the disk:
it: Create un partizione sul disco:

source: then enter `n`, `p`, `1`, `Enter`, `Enter`, and `w` successively to create a new partition.
it: digitate in sequenza `n`, `p`, `1`, `Invio`, `Invio`, `w` per creare una nuova partizione

source: Check with `lsblk` that you have your disk containing a single partition.
it: Controllate con `lsblk` che il vostro disco contenga solo una partizione.

source: Before you can use your disk, it must be formatted.
it: Prima di poter essere utilizzato il disco deve essere formattato.

source: To format the :
it: Per formattare la partizione digitate :

source: Replace `YOUR_DISK1` with the name of the first partition on the disk e.g. `sda1`.
it: Sostituite `miodisco` con il nome della prima partizione del disco di destinazione, nel nostro esempio `sda1`.

source: It is possible to adapt this step, for example to create a raid 1 volume (mirrored disks) or encrypt the folder.
it: Potete variare queste istruzioni se volete creare un volume raid 1 o cifrare la cartella.

source: 4. Mount the disk
it: 4. Montare il disco

source: Unlike Windows where disks are accessed with letters (C:/), under Linux, disks are made accessible via the file tree. "Mounting" a disk means making it effectively accessible in the file tree. We will arbitrarily choose to mount the disk in `/mnt/hdd` but you can name it differently (e.g. `/mnt/disk` ...).
it: Contrariamente a Windows, dove i dischi sono contraddistinti da lettere (C:\), in linux i dischi sono accessibili dall'albero del gestore dei file. "Montare" un disco significa renderlo accessibile nell'albero dei file. Sceglieremo di montare il disco in `/mnt/hdd` ma possiamo anche assegnare un nome di fantasia. (Ad esempio `/mnt/disco` ...).

source: Let's start by creating the directory :
it: Iniziamo creando la directory:

source: Then we can mount the disk manually with :
it: Montiamo il disco con il comando:

source: (Here, `/dev/YOUR_DISK1` corresponds to the first partition on the disk)
it: (In questo caso, `/dev/miodisco` corrisponde alla prima partizione del disco)

source: 5. Mount a `/mnt/hdd` folder on one of the folders you want to move data from
it: 5. Montare una cartella `/mnt/hdd` nella cartella che contiene i dati da spostare

source: Here we will consider that you want to move the big data of the applications which are in `/home/yunohost.app` and the mails on your hard disk.
it: Ipotizzeremo, di seguito, lo spostamento delle mail e di una notevole quantità di dati delle applicazioni, che si trovano in `/home/yunohost.app`.

source: 5.1 Creating subfolders on the disk
it: 5.1 Creazione delle sotto cartelle sul disco

source: To begin with, we create a folder on the hard drive
it: Iniziamo creando due cartelle nel disco di destinazione.

source: 5.2 Switching to maintenance mode
it: 5.2 Passaggio alla modalità manutenzione

source: Then, ideally, we switch to maintenance mode the applications that might be writing data.
it: Precauzionalmente portiamo nello stato di manutenzione le applicazioni che potrebbero scrivere dei dati nella cartella che vogliamo spostare.

source: Example, for nextcloud:
it: Ad esempio, per nextcloud:

source: Example, for mail:
it: Per la mail:

source: If you wish to move databases such as mariadb (mysql), it is imperative that you stop the services for these databases otherwise it is almost certain that your data will be corrupted.
it: Se desiderate spostare dei database come ad esempio mariadb (mysql), dovete necessariamente fermare i servizi del database, pena la corruzione dei dati.

source: 5.3 Creating the mount points
it: 5.3 Creazione dei punti di montaggio

source: Next, we will rename the original folder and create an empty eponymous folder.
it: Procediamo con rinominare la cartella di origine e crearne una fittizia

source: We can then use the `mount --bind` command to mount the folder on our hard drive to the new empty location in the tree.
it: Servendoci del comando `mount --bind` montiamo la cartella del nostro disco nel nuovo ramo dell'albero dei file.

source: 5.4 Copying the data
it: 5.4 Copia dei dati

source: Next, we copy the data, keeping all the folder and file properties. This operation can take a little time, with another terminal, you can control the evolution by observing the weight associated with the mount point with `df -h`
it: Copiamo quindi i dati, mantenendo le proprietà delle cartelle e dei file. Questa operazione può impiegare un po' di tempo, aprendo un altro terminale potete seguire la progressione dell'operazione osservando la dimensione del punto di montaggio con il comando `df -h`

source: Once this is done, check with `ls` that the contents are there:
it: Terminata la copia, assicuratevi che sia andato tutto a buon fine con il comando `ls`

source: 5.5 Exiting maintenance mode
it: 5.5 Uscita dalla modalità manutenzione

source: From here you can stop maintenance mode, the command below is to be adapted depending on the services you have stopped.
it: Da questo momento potete uscire dalla modalità manutenzione, il comando illustrato qui sotto va adattato in base ai servizi che avevate sospeso o arrestato.

source: From this point on, your services are running with their data on disk, so it's time to test to see how much of an impact this has on performance (especially if you are using USB 2.0).
it: Dopo aver impartito i comandi di avvio, le applicazioni e i servizi sfrutteranno il disco esterno per i loro dati. Dobbiamo quindi effettuare qualche test per capire in quale misura la velocità di esecuzione è impattata dal disco esterno (in particolar modo se il disco utilizza l'interfaccia USB 2.0).

source: 6. Automatically mount on boot
it: 6. Automatizzare il montaggio all'avvio

source: So far we have manually mounted the disk and subfolders. However, it is necessary to configure the system to automatically mount the disk after a boot.
it: Fino ad ora, abbiamo montato manualmente il disco e le sotto cartelle. È però necessario configurare il sistema affinché il disco esterno venga montato in automatico ad ogni avvio.

source: If your tests are successful, you should keep the mount points, otherwise you should hurry up and go back to maintenance first.
it: Se i test di velocità sono soddisfacenti, bisogna rendere definitivo il punto di montaggio. In caso contrario affrettatevi a fare dietro front iniziando a ripristinare la modalità di manutenzione.

source: To begin with, let's find the UUID (universal identifier) of our disk with :
it: Iniziamo cercando l'UUID (universal identifier, identificatore universale) del nostro disco:

source: Let's add a line to the `/etc/fstab` file that handles the mounting of disks at boot time. So we open the file with `nano` :
it: Aggiungiamo una riga di codice al file `/etc/fstab` deputato alla gestione dei montaggi dei dischi all'avvio. Aprite il file con `nano`:

source: Then add these lines to the end of the file:
it: Digitiamo questa riga in fondo al file:

source: (this line must be adapted according to the previous information and choices)
it: (dovremo modificare la riga in base alle nostre scelte precedenti)

source: Use Ctrl+X then `y` to save.
it: Salvate le modifiche con CTRL+x e `o`.

source: You can then try rebooting the system to check if the disk and subfolders are mounted automatically.
it: Riavviate il server per assicurarvi che il disco e le sotto cartelle vengano montate in automatico.

source: 7. Clean up old data
it: 7. Cancellare i dati precedenti

source: Once your new setup is validated, you can proceed to delete the old data from step 5.3:
it: Quando siete sicuri che la configurazione sia corretta, potete procedere alla cancellazione della configurazione creata nel punto 5.3:

source: 🎉 Congratulations!
it: 🎉 Complimenti!!!

source: If you have made it this far without damage, you now have a server that takes advantage of one or more storage disks.
it: Se siete giunti fino qui senza incidenti, avete configurato un server che sfrutta uno o più dischi per il salvataggio dei dati.
