Repository: YunoHost/doc
Catalog: i18n/docs/admin/02.what_*_yunohost__index/*.po
Languages: fr, gl

source: What is YunoHost?
fr: Qu’est-ce que YunoHost ?
gl: Que é YunoHost?

source: YunoHost can be installed on [many kinds of hardware](/admin/get_started/install_on), either at home or on a remote server (VPS).
fr: YunoHost peut s'installer sur [différents types de matériel](/admin/get_started/install_on), à la maison ou sur un serveur en ligne (VPS).
gl: YunoHost pode instalarse en [varios tipos de hardware](/admin/get_started/install_on), tanto no fogar como nun servidor remoto (VPS).

source: ![General representation of a YunoHost server installation](/img/internet_topologies_with_ynh.png?resize=600)
fr: ![Représentation générale d'un serveur YunoHost](/img/internet_topologies_with_ynh_fr.png?resize=600)
gl: ![representación xeral da instalación dun servidor YunoHost](/img/internet_topologies_with_ynh.png?resize=600)

source: Features
fr: Fonctionnalités
gl: Características

source: - <SmallInline url='/img/icons/logo-debian.png' alt="Debian logo"/> Based on Debian, for a trustworthy & familiar base; - <SmallInline url='/img/icons/icon-tools.png' /> Administer your server through a **friendly web interface** as well as a handy CLI; - <SmallInline url='/img/icons/icon-package.png' /> Deploy **apps in just a few clicks** from [our more than 500 apps catalog](https://apps.yunohost.org)!; - <SmallInline url='/img/icons/icon-users.png' /> Manage **users** <small>(based on LDAP)</small>; - <SmallInline url='/img/icons/icon-globe.png' /> Manage **domain names**; - <SmallInline url='/img/icons/icon-medic.png' /> Create and restore **backups**; - <SmallInline url='/img/icons/icon-door.png' /> Connect to all apps simultaneously through the **user portal** <small>(NGINX, SSOwat)</small>; - <SmallInline url='/img/icons/icon-mail.png' /> Includes a **full e-mail stack** <small>(Postfix, Dovecot, Rspamd, DKIM)</small>; - <SmallInline url='/img/icons/icon-lock.png' /> Manages **SSL certificates** <small>(based on Let's Encrypt)</small>; - <SmallInline url='/img/icons/icon-shield.png' />... and **security systems** <small>(`fail2ban`, `yunohost-firewall`)</small>.
fr: - <SmallInline url='/img/icons/logo-debian.png' alt="Debian logo"/> basé sur Debian, pour une base de confiance et familière ; - <SmallInline url='/img/icons/icon-tools.png' /> administration via une **interface web simple et claire**, ou en ligne de commande ; - <SmallInline url='/img/icons/icon-package.png' /> déployez des **applications en quelques clics**, parmi [un catalogue de plus de 500 apps](https://apps.yunohost.org) ! - <SmallInline url='/img/icons/icon-users.png' /> ajoutez des **utilisateurs** <small>(based on LDAP)</small> ; - <SmallInline url='/img/icons/icon-globe.png' /> gérez des **noms de domaine** ; - <SmallInline url='/img/icons/icon-medic.png' /> créez et restaurez des **sauvegardes** ; - <SmallInline url='/img/icons/icon-door.png' /> connexion simultanée à toutes les apps via un **portail utilisateur** <small>(NGINX, SSOwat)</small> ; - <SmallInline url='/img/icons/icon-mail.png' /> fourni avec un **serveur mail complet** <small>(Postfix, Dovecot, Rspamd, DKIM)</small> ; - <SmallInline url='/img/icons/icon-lock.png' /> gère les **certificats SSL** <small>(basé sur Let's Encrypt)</small> ; - <SmallInline url='/img/icons/icon-shield.png' />... et des **systèmes de sécurité** <small>(`fail2ban`, `yunohost-firewall`)</small>.

source: Origin
fr: Origine
gl: Orixe

source: YunoHost was created in February 2012 after something like this:
fr: YunoHost est un projet né en février 2012 à la suite d’à peu près ça :
gl: YunoHost creouse en Febreiro de 2012 despois dalgo semellante a isto:

source: > "Shit, I'm too lazy to reconfigure my mail server... Beudbeud, how were you able to get your little server running with LDAP?" > <small>*Kload, February 2012*</small>
fr: > « Merde, j’ai la flemme de me reconfigurer un serveur mail... Beudbeud, comment t’as fait pour configurer ton joli serveur sous LDAP ? » > <small>*Kload, Février 2012*</small>
gl: > "Merda, malditas as gañas de reconfigurar o correo electrónico... Beudbeud, como fixeches para que funcionase o teu pequeno servidor con LDAP?" > <small>*Kload, February 2012*</small>

source: All that was needed was an admin interface for Beudbeud's server to make something usable, so Kload decided to develop one. Finally, after automating several configs and packaging in some web apps, YunoHost v1 was finished.
fr: Il ne manquait en fait qu’une interface d’administration au serveur de Beudbeud pour en faire quelque chose d’exploitable, alors Kload a décidé de la développer. Finalement, après l’automatisation de quelques configurations et le packaging de quelques applications web, la première version de YunoHost était sortie.
gl: Todo o que facía falta era unha interface web para o servidor de Beudbeud para ter algo usable, así que Kload decideu crear unha. Finalmente, despois de automatizar certas configuración e empaquetar algunhas aplicacións web, YunoHost v1 naceu.

source: Noting the growing enthusiasm around YunoHost and around self-hosting in general, the original developers along with new contributors decided to start work on version 2, a more extensible, more powerful, more easy-to-use, and at that, one that makes a nice cup of fair-trade coffee for the elves of Lapland.
fr: Constatant l’engouement croissant autour de YunoHost et de l’auto-hébergement en général, les développeurs et les nouveaux contributeurs ont alors décidé de prendre le cap d’une version 2, plus accessible, plus extensible, plus puissante, et qui prépare du bon café commerce équitable pour les lutins de Laponie.
gl: Vendo o entusiasmo con que foi acollida YunoHost e a auto-hospedaxe en xeral, as desenvolvedoras orixinais xunto coas novas persoas colaboradoras decidiron comezar a traballar na versión 2, máis ampliable, más robusta e aínda máis fácil de usar, e así converterse nun bo café de comerzo xusto para os elfos da Laponia.

source: The name **YunoHost** comes from the jargon "[Y U NO](https://knowyourmeme.com/memes/y-u-no-guy) Host". The [Internet meme](https://en.wikipedia.org/wiki/Internet_meme) should illustrate it:
fr: Le nom **YunoHost** vient de l’argot Internet anglais « [Y U NO](https://knowyourmeme.com/memes/y-u-no-guy) Host » signifiant approximativement « Pourquoi toi ne pas héberger ». Ce [mème Internet](http://fr.wikipedia.org/wiki/M%C3%A8me_Internet) l’illustre:
gl: O nome **YunoHost** vén da expresión en xerga "[Y U NO](https://knowyourmeme.com/memes/y-u-no-guy) Host". O [meme de Internet](https://en.wikipedia.org/wiki/Internet_meme) debería ilustralo:

source: ![The meme in question, showing a guy with a face bent in frustration and questioning "Y U NO Host"](/img/dude_yunohost.jpg)
fr: ![Un bonhomme au visage déformé par la frustation et questionnant « Y U NO Host »](/img/dude_yunohost.jpg)
gl: ![o meme citado, mostrando un tipo coa cara baixa en xesto de frustación e preguntándose "Y U NO Host"](/img/dude_yunohost.jpg)

source: What YunoHost is not?
fr: Qu’est-ce que YunoHost n’est pas ?
gl: Que non é YunoHost?

source: YunoHost is *not* an enterprise or a for-profit entity. It is developed and maintained by volunteers. We do not sell services, we do not host or control your data or services in any way, and we have no intention or interest in monetizing anything. We also do not offer any formal guarantees. Our goal is simply to develop and maintain YunoHost in the hope that it contributes to a more decentralized internet and empowers people to reclaim autonomy over their digital services and technology. That said, we do our best to provide community support, and commercial support may be available through third parties if needed.
fr: YunoHost n'est *pas* une entreprise ou une entité à but lucratif. Le projet est développé et maintenu par des bénévoles. Nous ne vendons pas de services, nous n'hébergeons ni ne contrôlons vos données ou services d'aucune manière, et nous n'avons aucune intention ni aucun intérêt à monétiser quoi que ce soit. Nous n'offrons pas non plus de garanties formelles. Notre objectif est simplement de développer et de maintenir YunoHost dans l'espoir qu'il contribue à un internet plus décentralisé et qu'il permette aux plus grand nombre d'obtenir la maîtrise et l'autonomie sur leurs services numériques et la technologie. Ceci étant dit, nous faisons de notre mieux pour fournir un support communautaire, et un support commercial peut être disponible par l'intermédiaire de tiers si nécessaire.

source: YunoHost as a project is *not* apolitical. By its very nature, YunoHost promotes a decentralized internet and technologies that empower people. We reject the flawed notion that technology is inherently neutral, or that software projects should remain neutral. Many contributors to the project remain vigilant about the social and political implications of technological developments, and emphasize the importance of solidarity and alignment with broader movements such as feminism, LGBTQIA+ rights and visibility, environmental justice and social justice. We stand firmly against fascism, sexism, racism, xenophobia, [bigotry](https://simple.wikipedia.org/wiki/Bigotry), ableism, imperialism, extractivism, [eugenics](https://en.wikipedia.org/wiki/Eugenics), and right-wing libertarianism. If you are not aligned with these values, you are encouraged to *not* use YunoHost and look for a different system.
fr: YunoHost en tant que projet n'est *pas* apolitique. Par sa nature même, YunoHost promeut un internet décentralisé et des technologies qui donnent du pouvoir au plus grand nombre. Nous rejetons l'idée selon laquelle la technologie serait intrinsèquement neutre, ou que les projets logiciels devraient rester neutres. De nombreux contributeurices au projet restent vigilant⋅e⋅s quant aux implications sociales et politiques de l'évolution des technologies, et soulignent l'importance d'être solidaire et de converger avec d'autres luttes telles que le féminisme, les droits et la visibilité des personnes LGBTQIA+, la justice environnementale et la justice sociale. Nous nous opposons fermement au fascisme, au sexisme, au racisme, à la xénophobie, à la [bigoterie](https://fr.wikipedia.org/wiki/Bigoterie), au validisme, à l'impérialisme, à l'extractivisme, à l'eugénisme et au [libertarianisme](https://fr.wikipedia.org/wiki/Libertarianisme) de droite. Si vous n'êtes pas en accord avec ces valeurs, nous vous encourageons à ne pas utiliser YunoHost et à chercher un autre système.

source: YunoHost is *not* designed to "scale" in the traditional sense. It is intended for a relatively modest number of user accounts and simultaneous users. While there is no strict limit—since performance depends heavily on your specific setup — , we estimate that some technical adjustments may be necessary when reaching 250~500 user accounts, or about 50 simultaneous users on resource-intensive apps. That said, YunoHost can comfortably handle hosting a website or several lightweight services, even with thousands of daily visitors.
fr: YunoHost n'est *pas* conçu pour « passer à l'échelle » au sens traditionnel du terme. Il est conçu pour un nombre relativement modeste de comptes et d'utilisateur⋅ice⋅s simultané⋅e⋅s. Bien qu'il n'y ait pas de limite stricte - puisque les performances dépendent fortement de votre configuration spécifique - nous estimons que des ajustements techniques peuvent s'avérer nécessaires à partir de 250 à 500 comptes, ou de ~50 utilisateur⋅ice⋅s simultanés sur des applications gourmandes. Ceci étant dit, YunoHost peut aisément héberger des sites web ou autres services légers recevant des milliers de visites quotidiennes.

source: YunoHost is primarily designed for people who want things to "just work". Of course, it’s not perfect — we're constantly working to improve the user experience, robustness, and simplicity. Though YunoHost is "tinkerable", the first target public is *not* power users with complex or highly customized use cases in mind. We encourage you to keep your setup as simple as possible. That said, you are than welcome to experiment and share your feedback with us!
fr: YunoHost est avant tout conçu pour les personnes qui veulent que ça "juste marche". Évidemment, le projet n'est pas parfait - nous travaillons constamment à l'amélioration de l'expérience utilisateur⋅ice, à la robustesse et à la simplicité du système. Bien que YunoHost soit "bidouillable", la cible principale n'est *pas* les "power users" qui ont en tête des cas d'utilisation complexes ou hautement avancés. Nous vous encourageons à garder votre installation aussi simple que possible. Ceci étant dit, vous êtes les bienvenu⋅e⋅s à expérimenter et à nous faire part de vos retours !

source: YunoHost is *not* designed to be a *heavy* multi-tenant solution for providing services to completely separate organizations across different domains. While you *can* manage multiple domains and subdomains — such as hosting apps for friends, colleagues, an association — you should keep in mind that there is no strict isolation between apps. Under the hood, all applications share the same system and environment.
fr: YunoHost n'est *pas* conçu pour être une solution de mutualisation *lourde* fournissant des services à de multiples organisations complètement séparées à travers différents domaines. Bien qu'il soit possible d'héberger des services pour des amis, des collègues, une association - le tout sous des domaines différents -, vous devez garder à l'esprit qu'il n'y a pas d'isolation stricte entre les applications. Sous le capot, toutes les applications partagent le même système et le même environnement.

source: (Note for power users) YunoHost does not use "hard" containerization technologies such as Docker for its apps. This is partly for historical reasons, but also to keep the system lightweight — both in terms of resource usage and technical complexity. That said, we do take security seriously: applications run under dedicated user accounts with limited privileges and capabilities, and we're continuously working to enhance the system’s security.
fr: (Note pour les utilisateurs expérimentés) YunoHost n'utilise pas de technologie de conteneurisation "dure" telles que Docker pour les applications. Ceci découle à la fois de raisons historiques, mais aussi pour garder le système léger - à la fois en termes de ressources et de complexité technique. Cela dit, nous prenons la sécurité au sérieux : les applications fonctionnent sous des comptes d'utilisateurs dédiés avec des privilèges et des capacités limités, et nous travaillons continuellement à l'amélioration de la sécurité du système.

source: Artworks
fr: Logo
gl: Deseños

source: Black and white YunoHost by ToZz. Licence: CC-BY-SA 4.0. Logos and other artwork are available in [the Artworks repository](https://github.com/YunoHost/yunohost-artwork).
fr: Logo YunoHost noir et blanc réalisé par ToZz. Licence : CC-BY-SA 4.0. Les logos et autres artworks sont disponibles dans le [répertoire Github](https://github.com/YunoHost/yunohost-artwork).
gl: YunoHost en branco e negro, por ToZz. Licenza: CC-BY-SA 4.0. Logos e outros deseños dispoñibles en [the Artworks repository](https://github.com/YunoHost/yunohost-artwork).
