Repository: YunoHost/doc
Catalog: i18n/docs/admin/index/*.po
Languages: gl

source: Welcome!
gl: Benvida!

source: <img class="text--center" src="/img/icons/logo-ynh-roundcorner.png" alt="YunoHost logo" style={{ marginTop: "-2em", maxWidth: "7rem", }} />
gl: <img class="text--center" src="/img/icons/logo-ynh-roundcorner.png" alt="logotipo de YunoHost" style={{ marginTop: "-2em", maxWidth: "7rem", }} />

source: This is the documentation for YunoHost,<br/> an **operating system** aiming to **simplify server administration**!
gl: Esta 칠 a documentaci칩n para YunoHost,<br/> un **sistema operativo** co obxectivo de **simplificar a administraci칩n dun servidor**!

source: If you are an **impatient power user**, you may want to try YunoHost, or jump right away to install:
gl: Se es **unha usuaria con experiencia e pouca paciencia**, podes primeiro probar YunoHost, ou ir directamente 치 instalaci칩n:

source: <Button url="/admin/what_is_yunohost">游뱂 What's YunoHost?!</Button> <Button url="/admin/what_is_yunohost/demo">丘勇 Try YunoHost</Button> <Button url="/admin/get_started/install_on">游 Install</Button>
gl: <Button url="/admin/what_is_yunohost">游뱂 Que 칠 YunoHost?!</Button> <Button url="/admin/what_is_yunohost/demo">丘勇 Probar YunoHost</Button> <Button url="/admin/get_started/install_on">游 Instalar</Button>

source: <Button url="https://apps.yunohost.org/">游닍 Browse the app catalog</Button>
gl: <Button url="https://apps.yunohost.org/">游닍 Olla o cat치logo de aplicaci칩ns</Button>

source: Are you **new to self-hosting and servers in general**? We recommend to take it slow and go through the pages presenting [self-hosting](/admin/about_self_hosting), the [different modes](/admin/get_started/methods) and [other](/admin/get_started/why_should_you_not_host_yourself) [things](/category/providers) you should know prior to jumping into the action!
gl: **Non tes experiencia previa** no tema de auto hospedaxe? Recomend치mosche ir con calma e revisar as p치xinas relativas ao [auto-hospedaxe](/admin/about_self_hosting), the [different modes](/admin/get_started/methods) as칤 como [outras consideraci칩ns](/admin/get_started/why_should_you_not_host_yourself) e [asuntos](/category/providers) que deber칤as co침ecer antes de pasar 치 acci칩n!

source: Are you **already using YunoHost**? You may want to get in touch with the community or reach for help:
gl: Xa **utilizas YunoHost**? Pode interesarche relacionarte coa comunidade ou pedir axuda:

source: <Button url="https://forum.yunohost.org">游닉 Forum</Button> <Button url="/community/chat_rooms">游딞 Chat rooms</Button> <Button url="/community/help">游 Help</Button>
gl: <Button url="https://forum.yunohost.org">游닉 Foro</Button> <Button url="/community/chat_rooms">游딞 Salas de conversa</Button> <Button url="/community/help">游 Axuda</Button>

source: Finally, you can **support the project** or get involve in [different ways](/dev):
gl: Para rematar, podes **apoiar o proxecto** ou colaborar de [varios xeitos](/dev):

source: <Button url="https://yunohost.org/donate.html">游눯 Donate</Button> <Button url="/dev/doc">游닇 Improve the documentation</Button> <Button url="/dev/doc">游깷 Work on translations</Button> <Button url="/dev/packaging">游닍 Learn app packaging</Button> <Button url="/dev/core">丘뙖잺 Develop on the core</Button>
gl: <Button url="https://yunohost.org/donate.html">游눯 Doar</Button> <Button url="/dev/doc">游닇 Mellorar a documentaci칩n</Button> <Button url="/dev/doc">游깷 Traballar na traduci칩n</Button> <Button url="/dev/packaging">游닍 Aprender a empaquetar aplicaci칩ns</Button> <Button url="/dev/core">丘뙖잺 Desenvolvemento do n칰cleo</Button>
