Repository: YunoHost/doc
Catalog: i18n/docs/admin/43.upgrade__12.0-bookworm__index/*.po
Languages: fr

source: Important notes
fr: Notes importantes

source: - The YunoHost team did its best to make sure that the migration is as smooth as possible and was tested over the course of several months in several cases.
fr: - L'équipe YunoHost a fait tout son possible pour que la migration se déroule dans les meilleures conditions possibles et l'a testée pendant plusieurs mois dans différents cas de figure.

source: - Please don't rush into thinking that you should need to reinstall your system from scratch thinking it would be "simpler" (sigh). (A common attitude is to be willing to reinstall a server at the slightest complication...). Instead, if you happen to run into issues, we encourage you to try to investigate and understand what's going on and [reach for help on the chat and the forum](/community/help).
fr: - Ne vous précipitez pas en pensant que vous devriez réinstaller votre système à partir de zéro, croyant que ce serait "plus simple" (soupir). (Une attitude courante consiste à vouloir réinstaller un serveur à la moindre complication ...). Au contraire, si vous rencontrez des problèmes, nous vous encourageons à essayer de comprendre ce qui se passe et à [demander de l'aide sur le chat et le forum](/community/help).

source: - **You should watch the known issues at the bottom of this page, to be sure your migrations will work properly.**
fr: - **Vous devriez consulter les problèmes connus au bas de cette page, afin de vous assurer que vos migrations fonctionneront correctement.**

source: Migration procedure
fr: Procédure de migration

source: From the webadmin
fr: Depuis la webadmin

source: From the command line
fr: Depuis la ligne de commande

source: then read carefully and accept the disclaimer.
fr: puis lisez attentivement et acceptez la clause de non-responsabilité.

source: During the migration
fr: Pendant la migration

source: Note that even if you close the webadmin page for some reason, the migration will continue in the background (but the webadmin will be partially unavailable).
fr: Notez que même si vous fermez la page webadmin pour une raison quelconque, la migration se poursuivra en arrière-plan (mais la webadmin sera partiellement indisponible).

source: Check that your applications are working
fr: Vérifiez que vos applications fonctionnent correctement

source: Test that your applications are working. If they aren't, you should try to upgrade them (it is also a good idea to upgrade them even if they are working anyway).
fr: Vérifiez que vos applications fonctionnent correctement. Si ce n'est pas le cas, essayez de les mettre à jour (il est également recommandé de les mettre à jour même si elles fonctionnent correctement).

source: If your app is broken and you were already with the latest version, you can rerun the upgrade thanks to the `-F|--force` option:
fr: Si votre application ne fonctionne plus et que vous disposiez déjà de la dernière version, vous pouvez relancer la mise à niveau grâce à l'option `-F|--force` :

source: Current known issues after the migration
fr: Problèmes courants connus après la migration

source: Migrating from 11.x to 12.x
fr: Migration de la version 11.x à la version 12.x

source: This page is dedicated to help you migrating an instance from YunoHost 11.x (running on Debian Bullseye) to YunoHost 12 (running on Debian Bookworm).
fr: Cette page est destinée à vous aider à migrer une instance de YunoHost 11.x (fonctionnant sous Debian Bullseye) vers YunoHost 12 (fonctionnant sous Debian Bookworm).

source: - Please [backup your data and server](/admin/backups)! This migration is a complex operation and covering every pitfall is quite hard. And in any case, be patient and attentive during the migration.
fr: - [Faites des sauvegardes](/admin/backups) de votre serveur et de vos données ! Cette migration est une opération complexe et éviter tous les problèmes possibles est difficile. Dans tous les cas, soyez patients et attentifs durant la migration.

source: You first need to ensure your system is up to date. The migration is available starting with the version 11.3.
fr: Vous devez d'abord vous assurer que votre système est à jour. La migration est disponible à partir de la version 11.3.

source: It is recommended to run the migration from the command line, but it can still be done from the webadmin.
fr: Il est recommandé d'exécuter la migration à partir de la ligne de commande, mais cela peut également être fait à partir de l'interface d'administration web.

source: Go to Tools > Migrations to access the migrations interface. You will have to read carefully and accept the disclaimer then launch the migration.
fr: Allez dans Outils > Migrations pour accéder à l'interface de migration. Vous devrez lire attentivement et accepter la clause de non-responsabilité, puis lancer la migration.

source: Run :
fr: Exécuter :

source: Depending on your hardware and installed apps and packages, the migration can take up to one or two hours.
fr: En fonction de votre matériel, des applications et autres paquets installés, la migration peut prendre jusqu'à une ou deux heures.

source: Logs will be displayed in the webadmin's modal window in the middle of the page. They will also be browsable after the migration like any other major operation under Tools > Logs.
fr: Les journaux (logs) seront affichés dans la fenêtre modale de l'administration Web au milieu de la page. Ils pourront également être consultés après la migration, comme toute autre opération importante, sous Outils > Journaux.

source: If the migration fails at some point
fr: Si la migration échoue à un moment donné

source: If the migration fails, the first thing to try should be relaunch it. If it still doesn't work, your should [ask for help to the community](/community/help) (please provide error message, full logs and any context element that would help debugging the issue).
fr: Si la migration échoue, la première chose à essayer est de la relancer. Si cela ne fonctionne toujours pas, vous devez [demander de l'aide à la communauté](/community/help) (veuillez fournir le message d'erreur, les journaux complets et tous les éléments contextuels susceptiblent d'aider à déboguer le problème).

source: After the migration
fr: Après la migration

source: Check that you actually are on Debian Bookworm and YunoHost 12.x
fr: Vérifiez que vous êtes bien sous Debian Bookworm et YunoHost 12.x

source: Go to Diagnosis (category Base system) or look at the bottom-right of the webadmin to check YunoHost's version.
fr: Allez dans Diagnostic (catégorie Système de base) ou regardez en bas à droite de l'interface d'administration web pour vérifier la version de YunoHost.

source: From the command line, you can use `lsb_release -a` and `yunohost --version`.
fr: À partir de la ligne de commande, vous pouvez utiliser `lsb_release -a` et `yunohost --version`.

source: Run the new pending migrations
fr: Exécutez les nouvelles migrations en attente

source: Some more migrations appeared after the upgrade:
fr: D'autres migrations sont apparues après la mise à niveau :

source: - Rebuilding the virtualenvs of your Python apps - Migrate from PostgreSQL 13 to 15
fr: - Reconstruction des virtualenvs de vos applications Python - Migration de PostgreSQL 13 vers 15

source: You should run those as soon as possible to ensure your apps work properly.
fr: Vous devriez les exécuter dès que possible pour vous assurer que vos applications fonctionnent correctement.

source: Agreeing to the new Terms of Service via command line
fr: Accepter les nouvelles conditions d'utilisation via la ligne de commande

source: YunoHost 12.x now requires that you agree to the new [Terms of Service](https://doc.yunohost.org/terms_of_services/). After reading and accepting them you can run:
fr: YunoHost 12.x exige désormais que vous acceptiez les nouvelles [Conditions d'utilisation](https://doc.yunohost.org/terms_of_services/). Après les avoir lues et acceptées, vous pouvez démarrer la migration :

source: Check the Diagnosis
fr: Vérifiez le diagnostic

source: In the webadmin Diagnosis section, make sure that no specific issue appeared after running the migration (for example a service that crashed for some reason).
fr: Dans la section Diagnostic de l'interface d'administration Web, assurez-vous qu'aucun problème spécifique n'est apparu après l'exécution de la migration (par exemple, un service qui s'est arrêté pour une raison quelconque).

source: Please check the [issues FAQ](/admin/upgrade/12.0-bookworm/issues_faq/).
fr: Veuillez consulter la [FAQ sur les problèmes courants connus après la migration](/admin/upgrade/12.0-bookworm/issues_faq/).
