Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__10.providers__15.vpn__index/*.po
Languages: fr

source: VPN providers
fr: Fournisseurs VPN

source: Since setting up a server at home is an uncommon practice, most Internet connections provided to individuals are unsuitable for this purpose especially if you desire to send mail. A net neutral VPN providing a dedicated fixed public IPv4 address and IPv6 addresses [can help to circumvent some limitations or difficulties](/admin/get_started/providers/vpn/vpn_advantage).
fr: Étant donné que la mise en place d'un serveur à domicile est une pratique peu courante, la plupart des connexions internet fournies aux particuliers ne sont pas adaptées à cette fin, en particulier si vous souhaitez envoyer des courriels. Un VPN neutre fournissant une adresse IPv4 publique fixe dédiée et des adresses IPv6 [peut aider à contourner certaines limitations ou difficultés](/admin/get_started/providers/vpn/vpn_advantage).

source: Note that except if you have a <a href="https://en.wikipedia.org/wiki/Threat_model">threat model</a> that implies to really be "hidden", you do not need to hide your home IP address using a VPN. It is really not a huge deal to expose your IP address, do not trust the big commercial VPN companies who tries to sell you a product by inducing fear. If you *do* have such a threat model, especially against state threats, most of the providers listed below will **not** be of any help to you, since they will have to comply with police and judicial demands. However, a VPN can help you to bypass port-forwarding limitations, or to get a stable IP address (if you ISP only provide dynamic IP) and this page will help you for that!
fr: Notez que, sauf si votre <a href="https://fr.wikipedia.org/wiki/Mod%C3%A8le_de_menace">modèle de menace</a> implique d'être réellement "caché", vous n'avez pas besoin de cacher votre adresse IP en utilisant un VPN. Ce n'est pas spécialement un problème d'exposer son adresse IP, méfiez vous des entreprises de VPN commerciales qui essayent de vous vendre un produit en vous faisant peur. Si vous *êtes* dans le cadre d'un tel modèle de menace, en particulier contre des acteurs étatiques, la plupart des fournisseurs listés ci-dessous ne seront **pas** appropriés, car contraints de se conformer aux requêtes policières et judiciaires. Cependant, un VPN peut vous aider à contourner les limitations de redirection de port ou à obtenir une adresse IP stable (si votre FAI ne fournit qu'une adresse IP dynamique). Cette page vous aidera à y parvenir !

source: Below, you can find a list of providers compatible for self-hosting and especially those providing .cube format for VPNClient apps and those providing [internetcube](https://internetcu.be).
fr: Ci-dessous, vous trouverez une liste de fournisseurs compatibles avec l'auto-hébergement et en particulier ceux qui fournissent le format .cube pour les applications VPNClient et ceux qui fournissent [internetcube](https://internetcu.be).

source: By **compatible for self-hosting** we means VPN offers with at least: - a fixed dedicated public IPv4 - port forwarding or opened features - net neutrality: no traffic analysis, no user data resale, no alteration of traffic (without legal obligations)...
fr: Par **compatible pour l'auto-hébergement**, nous entendons des offres VPN avec au moins : - un IPv4 public dédié fixe - des fonctionnalités de redirection de port ou d'ouverture - neutralité du réseau : pas d'analyse du trafic, pas de revente des données des utilisateurs, pas d'altération du trafic (sans obligations légales)...

source: English-speaking sites
fr: Sites anglophones

source: | VPN provider | [VPNClient](https://github.com/labriqueinternet/vpnclient_ynh) compatibility | IPv6 | rDNS IPv4 | rDNS IPv6 | Price | Membership | Net Neutrality | | ------------ | ---------------------------------------------------------------------------- | ---- | --------- | --------- | ----- | ---------- | -------------- | | [Neutrinet](https://neutrinet.be/en/vpn) | ✔ (.cube + [internetcube](https://internetcu.be)) | ✔ | ✔ | ✔ | ~10€¹/month or 30€/year | included | <HighlightFFDN/> <HighlightNonProfit/> |
fr: | Fournisseur VPN | Compatibilité [VPNClient](https://github.com/labriqueinternet/vpnclient_ynh) | IPv6 | rDNS IPv4 | rDNS IPv6 | Prix | Adhésion | Neutralité du net | | ------------ | ---------------------------------------------------------------------------- | ---- | --------- | --------- | ----- | ---------- | -------------- | | [Neutrinet](https://neutrinet.be/en/vpn) | ✔ (.cube + [internetcube](https://internetcu.be)) | ✔ | ✔ | ✔ | ~10€¹/month or 30€/year | included | <HighlightFFDN/> <HighlightNonProfit/> |

source: ¹ [Pay what you want](https://en.wikipedia.org/wiki/Pay_what_you_want)
fr: ¹ [Prix libre / payez ce que vous voulez](https://en.wikipedia.org/wiki/Pay_what_you_want)

source: If you try an other VPN provider that include **public dedicated ipv4 and port forwarding**, feel free to contribute to this documentation. We need people to test specific offers of those commercial providers: - ✘ [VPN area](https://vpnarea.com/front/home/dedicated-ip) does not allow forwarding port 80. Running a webserver is against their TOS. - [Trust zone](https://trust.zone/fr/order?p=25) - [PureVPN](https://www.purevpn.fr/ip-vpn-dedie) - [RapidVPN](https://www.rapidvpn.com/vpn)
fr: Si vous essayez un autre fournisseur de VPN qui inclut **l'ipv4 public dédié et la redirection de port**, n'hésitez pas à contribuer à cette documentation. Nous avons besoin de personnes pour tester les offres spécifiques de ces fournisseurs commerciaux : - ✘ [VPN area](https://vpnarea.com/front/home/dedicated-ip) n'autorise pas la redirection du port 80. L'exécution d'un serveur web est contraire à leurs conditions d'utilisation. - [Trust zone](https://trust.zone/fr/order?p=25) - [PureVPN](https://www.purevpn.fr/ip-vpn-dedie) - [RapidVPN](https://www.rapidvpn.com/vpn)

source: French-speaking sites
fr: Sites francophones

source: German-speaking sites
fr: Sites germanophones

source: | VPN provider | [VPNClient](https://github.com/labriqueinternet/vpnclient_ynh) compatibility | IPv6 | rDNS IPv4 | rDNS IPv6 | Price | Membership | Net Neutrality | | ------------ | ---------------------------------------------------------------------------- | ---- | --------- | --------- | ----- | ---------- | -------------- | | [In-Berlin](https://in-vpn.de/provider/vpn.html) | ✔ (manuelle) | ✔ | ✔ | ✔ | 9 or 14€ / month | 20€ / an | <HighlightNonProfit/> | | [Portunity](https://www.portunity.de/access/produkte/vpn-loesungen/vpn-tunnel.html) | ✔ (manuelle) | ✔ | ✔ | ✔ | from 6,80€ / month | | | | [FesteIP-Kit (Portunity)](https://www.festeip-kit.de/) | ✘ (managed ready-to-use router utilizing a Raspberry Pi) | ✔ | ✔ | ✔ | from 10,80€ / month | | |
fr: | Fournisseur VPN | Compatibilité [VPNClient](https://github.com/labriqueinternet/vpnclient_ynh) | IPv6 | rDNS IPv4 | rDNS IPv6 | Prix | Adhésion | Neutralité du Net | | ------------ | -------------------------- -------------------------------------------------- | ---- | --------- | --------- | ----- | --------- - | -------------- | | [In-Berlin](https://in-vpn.de/provider/vpn.html) | ✔ (manuelle) | ✔ | ✔ | ✔ | 9 ou 14 € / mois | 20 € / an | <HighlightNonProfit/> | | [Portunity](https://www.portunity.de/access/produkte/vpn-loesungen/vpn-tunnel.html) | ✔ (manuelle) | ✔ | ✔ | ✔ | à partir de 6,80 € / mois | | | | [FesteIP-Kit (Portunity)](https://www.festeip-kit.de/) | ✘ (routeur géré prêt à l'emploi utilisant un Raspberry Pi) | ✔ | ✔ | ✔ | à partir de 10,80 € / mois | | |
