Repository: YunoHost/doc
Catalog: po4a/admin/45.tutorials__45.certificate_custom/*.po
Languages: fr, it

source: Custom certificates
fr: Certificats personnalisés
it: Certificati personalizzati

source: Since version 2.5, YunoHost integrates Let's Encrypt certificates automated management. You can easily and freely [install a Let's Encrypt certificate](/admin/domains/certificate). The following document describes the steps for installing a paid certificate from a certification authority (**Gandi**, **RapidSSL**, **StartSSL**, **Cacert**).
fr: Depuis la version 2.5, YunoHost intègre la gestion automatisée de certificats Let's Encrypt. Vous pouvez donc facilement et gratuitement [installer un certificat Let's Encrypt](/admin/domains/certificate). Le document suivant décrit la méthodologie pour installer un certificat, payant, d'une autre autorité de certification (**Gandi**, **RapidSSL**, **StartSSL**, **Cacert**).
it: Dalla versione 2.5 YunoHost integra la gestione automatizzata dei certificati Let's Encrypt. Potete quindi facilmente e gratuitamente [installare un certificato Let's Encrypt](/admin/domains/certificate). Questa guida descrive la procedura per installare un certificato, a pagamento, di una diversa autorità di certificazione (**Gandi**, **RapidSSL**, **StartSSL**, **Cacert**).

source: Some changes have taken place which impact the procedures indicated below:
fr: Quelques changements ont eu lieu qui impactent les procédures indiquées ci-dessous :
it: Nel corso delle versioni, sono state introdotte delle modifiche che possono impattare sulle procedure descritte di seguito:

source: Adding a signed certificate by an authority (other than Let's Encrypt)
fr: Ajout d’un certificat signé par une autorité (autre que Let's Encrypt)
it: Installazione di un certificato firmato da un'autorità diversa da Let's Encrypt

source: After the certificate creation with your registration authority, you must have a private key, the key file, and a public certificate, the crt file.
fr: Après création du certificat auprès de votre autorité d’enregistrement, vous devez être en possession d’une clé privée, le fichier *key* et d’un certificat public, le fichier *crt*.
it: Dopo aver creato il certificato presso l'autorità di certificazione scelta, sarete in possesso di una chiave privata, il file key e di un certificato pubblico, il file crt.

source: Note that the key file is very sensitive, it is strictly personal and must be very well secured.
fr: Attention, le fichier *key* est très sensible, il est strictement personnel et doit être très bien sécurisé.
it: Il file key contiene dati sensibili, è strettamente personale e deve essere conservato in un luogo sicuro.

source: These two files should be copied to the server, if they are not already there.
fr: Ces deux fichiers doivent être copiés sur le serveur, s’ils ne s’y trouvent pas déjà.
it: Questi due file devono essere copiati sul server.

source: From Windows, scp can be used with Putty, by downloading the tool [pscp](http://the.earth.li/~sgtatham/putty/latest/x86/pscp.exe)
fr: Depuis Windows, scp est exploitable avec Putty, en téléchargeant l’outil [pscp](http://the.earth.li/~sgtatham/putty/latest/x86/pscp.exe)
it: Nelle versioni precedenti Windows 10, per utilizzare scp dovrete installare Putty e il plugin [pscp](http://the.earth.li/~sgtatham/putty/latest/x86/pscp.exe).

source: As soon as the files are on the server, the rest of the work will be done on it. In [ssh](/admin/command_line) or locally. First, create a folder to store the obtained certificates.
fr: Dès lors que les fichiers sont sur le serveur, le reste du travail se fera sur celui-ci. En [ssh](/admin/command_line) ou en local. Tout d’abord, créez un dossier pour stocker les certificats obtenus.
it: Una volta copiati i file, i passi successivi si faranno sul server via [ssh](/admin/command_line) o in locale. Per prima cosa create una directory per salvare i certificati in vostro possesso.

source: Then, go to the parent folder to continue.
fr: Puis allez dans le dossier parent pour poursuivre.
it: Spostatevi nella directory superiore

source: As a caution, back up the certificates of origin from YunoHost.
fr: Faites une sauvegarde des certificats d’origine de YunoHost, par précaution.
it: Eseguite un backup dei certificati auto firmati di YunoHost.

source: Depending on the registration authority, intermediate and root certificates must be obtained.
fr: En fonction de l’autorité d’enregistrement, des certificats intermédiaires et racines doivent être obtenus.
it: Per alcune autorità di certificazione, è necessario ottenere di altri certificati (intermediate e root).

source: Intermediate and root certificates must be combined with the obtained certificate to create a unified certificate chain.
fr: Les certificats intermédiaires et root doivent être réunis avec le certificat obtenu pour créer une chaîne de certificats unifiés.
it: I certificati intermedi e root devono essere collegati con il certificato "principale" a creare una unica catena di certificati.

source: The private key must be converted to `.pem` format.
fr: La clé privée doit être, elle, convertie au format `.pem`.
it: La chiave privata deve esser convertita nel formato `.pem`.

source: To ensure the certificates syntax, check the files contents.
fr: Afin de s’assurer de la syntaxe des certificats, vérifiez le contenu des fichiers.
it: Controllate la sintassi dei certificati, verificando il contenuto dei file.

source: The certificates and private key should look like this:
fr: Les certificats et la clé privée doivent ressembler à cela :
it: I certificati e la chiave privata, devono assomigliare a questo:

source: Finally, secure your certificate files.
fr: Enfin, sécurisez les fichiers de votre certificat.
it: Infine mettete al sicuro i file del vostro certificato.

source: Now the certificates (two files with the extension `.pem`) must be copied in `/etc/yunohost/certs/DOMAIN.TLD`.
fr: Maintenant les certificats (les deux fichiers avec l'extension `.pem`) doivent être recopiés dans `/etc/yunohost/certs/DOMAIN.TLD`.
it: Adesso i certificati (i due files con estensione `.pem`) devono essere copiati in `/etc/yunohost/certs/DOMAIN.TLD`.

source: Reload NGINX configuration to take into account the new certificate.
fr: Rechargez la configuration de NGINX pour prendre en compte le nouveau certificat.
it: Ricaricate la configurazione di NGINX per rendere effettive le modifiche effettuate.

source: Your certificate is ready. However, you can ensure that it is in place by testing the certificate using the [geocerts](https://www.geocerts.com/ssl_checker).
fr: Votre certificat est prêt à servir. Vous pouvez toutefois vous assurer de sa mise en place en testant le certificat à l’aide du service de [geocerts](https://www.geocerts.com/ssl_checker).
it: Il certificato è pronto. Potete controllare la corretta configurazione e installazione utilizzando il servizio di [geocerts](https://www.geocerts.com/ssl_checker).
