Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__20.install_on___configuration/*.po
Languages: fr, gl

source: <FAIcon icon="fa-cog"/> Proceed with the initial configuration
fr: <FAIcon icon="fa-cog"/> Lancer la configuration initiale
gl: <FAIcon icon="fa-cog"/> Comezar coa configuración inicial

source: If you are in the process of restoring a server using a YunoHost backup, you should skip this step and instead [restore the backup instead of the postinstall step](/admin/backups).
fr: Si vous êtes en train de restaurer une sauvegarde YunoHost, vous devez sauter cette étape et vous référer à la section [Restaurer durant la post-installation à la place de cette étape de configuration initiale](/admin/backups).
gl: Se estás restablecendo un servidor usando unha copia de apoio YunoHost, debes omitir este paso e [restablecer a copia no lugar do paso da post-instalación](/admin/backups).

source: This documentation assumes you're on the same local network as your YunoHost installation. For a VPS, please use the public IP address instead of the local domain or address.
fr: Cette documentation suppose que vous êtes sur le même réseau local que votre YunoHost. Pour un VPS, utilisez l'adresse IP publique au lieu du domaine ou adresse locale.
gl: Esta documentación asume que estás na mesma rede local que o servidor YunoHost. Para un VPS, utiliza o enderezo IP público en lugar do dominio ou enderezo locais.

source: <TabItem value="web" label="From the web interface">
fr: <TabItem value="web" label="Depuis la webadmin">
gl: <TabItem value="web" label="desde a interface web">

source: On a computer, open a browser and try to reach the webadmin: - if you're installing on a VPS, you probably used the `curl | bash` install method, and it should have pointed you with the address, typically `https://xx.xx.xx.xx` (with the **public IPv4** of your server) - if you're installing at home, and assuming that *you are on the same local network as the server* - you can try to open https://yunohost.local (this may or may not work depending if your computer and network supports the Bonjour protocol) - if you already know the local IP of the machine, go to `https://xx.xx.xx.xx` (with the **local** IP, typically starting with `192.168.`) - otherwise you will need to [find out its local IP ](/admin/get_started/post_install/find_ip) before continuing.
fr: Depuis un ordinateur, ouvrez un navigateur et tenter d'accéder à la webadmin: - si vous installez sur un VPS, vous avez probablement utilisé la méthode d'installation basée sur `curl | bash`, et le script aurait du vous pointer vers l'adresse, typiquement `https://xx.xx.xx.xx` (avec l'**IPv4 publique** du serveur) - si vous installez à la maison, et en supposant que vous êtes *sur le même réseau local que le serveur* - vous pouvez tenter d'ouvrir https://yunohost.local (ceci peut ou peut ne pas fonctionner en fonction de si votre machine et réseau supporte le protocole Bonjour) - si vous connaissez déjà l'IP locale du serveur, allez sur `https://xx.xx.xx.xx` (avec l'IP **locale**, typiquement qui commence par `192.168.`) - autrement, il vous faut [trouver l'IP locale du serveur](/admin/get_started/post_install/find_ip) pour continuer.
gl: Nunha computadora, abre o navegador e intenta acadar a interface web: - se estás instalando nun VPS, probablemente usaches o instalador `curl | bash` e debería informarte sobre o enderezo, normalmente `https://xx.xx.xx.xx` (co enderezo **IPv4 público** do teu servidor) - se estás instalando na casa, e supoñendo que *estás na mesma rede local que o servidor* - podes intentar abrir https://yunohost.local (que igual non é accesible dependendo de se a túa computadora e rede son compatibles co protocolo Bonjour) - se coñeces o enderezo IP local da máquina, vai a `https://xx.xx.xx.xx` (co enderezo IP **local**, que normalmente comeza por `192.168.`) - tamén podes intentar [o seu enderezo IP local](/admin/get_started/post_install/find_ip) antes de continuar

source: During the first visit, you will very likely encounter a security warning related to the certificate used by the server. For now, your server uses a self-signed certificate. You will later be able to add a certificate automatically recognized by web browsers as described in the [certificate documentation](/admin/domains/certificate). For now, you should add a security exception to accept the current certificate. (Though, PLEASE, do not take the habit of blindly accepting this kind of security alert!)
fr: Lors de la première visite, vous rencontrerez très probablement un avertissement de sécurité lié au certificat utilisé. Pour le moment, votre serveur utilise un certificat auto-signé. Vous pourrez plus tard ajouter un certificat automatiquement reconnu par les navigateurs comme décrit dans [la page sur les certificats](/admin/domains/certificate). En attendant, ajoutez une exception de sécurité pour accepter le certificat actuel. (Toutefois, **s'il vous plaît**, ne prenez pas l'habitude d'accepter ce genre d'alerte de sécurité !)
gl: Na primeira visita probablemente recibas un aviso de seguridade informando sobre o certificado que utiliza o servidor. Polo de agora o teu servidor utiliza un certificado auto-asinado. Máis adiante poderás engadir un certificado que recoñezan automaticamente os navegadores, tal como se describe na [documentación sobre certificados](/admin/domains/certificate). Polo momento, tes que engadir unha excepción de seguridade para aceptar o certificado actual. (POR FAVOR, non fagas isto de xeito habitual, non aceptes sen pensar este tipo de advertencias!)

source: You should then land on this page:
fr: Vous devriez arriver sur cette page:
gl: E entón deberías ver esta páxina:

source: <Figure caption="Preview of the Web initial configuration page" src="/img/webadmin/postinstall_web.png"/>
fr: <Figure caption="Capture d'écran de la page de configuration initiale" src="/img/webadmin/postinstall_web.png"/>
gl: <Figure caption="vista da páxina web inicial de configuración" src="/img/webadmin/postinstall_web.png"/>

source: <TabItem value="cli" label="From the command line">
fr: <TabItem value="cli" label="Depuis la ligne de commande">
gl: <TabItem value="cli" label="desde a liña de ordes">

source: You can also perform the postinstallation with the command `yunohost tools postinstall` directly on the server, or [via SSH](/admin/command_line).
fr: Vous pouvez aussi lancer la post-installation avec la commande `yunohost tools postinstall` directement sur le serveur ou [via SSH](/admin/command_line).
gl: Tamén podes realizar a post-instalación coa orde `yunohost tools postinstall` directamente no servidor, ou [vía SSH](/admin/command_line).

source: <Figure caption="Preview of the command-line post-installation" src="/img/postinstall_cli.png"/>
fr: <Figure caption="Capture d'écran de la configuration initiale en ligne de commande" src="/img/postinstall_cli.png"/>
gl: <Figure caption="vista da liña de ordes coa post-instalación" src="/img/postinstall_cli.png"/>

source: <FAIcon icon="fa-globe"/> Main domain
fr: <FAIcon icon="fa-globe"/> Domaine principal
gl: <FAIcon icon="fa-globe"/> Dominio principal

source: WSL specific configuration
fr: Configuration spécifique WSL
gl: Configuración WSL específica

source: You will have to choose a fake domain, since it will not be accessible from outside. For example, `ynh.wsl`. The tricky part is advertising this domain to your host.
fr: Vous devrez choisir un faux nom de domaine, car il ne sera pas accessible de l'extérieur. Par exemple, `ynh.wsl`. L'étape compliqué est d'exposer ce nom de domaine à votre hôte.
gl: Vas ter que escoller un dominio falso, que non será accesible desde o exterior. Por exemplo, `ynh.wsl`. A parte complicada é comunicarlle este dominio ao teu ordenador.

source: Alter your `C:\Windows\System32\drivers\etc\hosts` file. You should have a line starting by `::1`, update it or add it if needed to get:
fr: Éditez le fichier `C:\Windows\System32\drivers\etc\hosts`. Vous devriez avoir une ligne commençant par `::1`, créez la si elle n'existe pas, et rajoutez votre domaine à la fin:
gl: Edita o teu ficheiro `C:\Windows\System32\drivers\etc\hosts`. Deberías ver unha liña que comeza por `::1`, actualízaa ou engádea se fose preciso para ter:

source: If you want to create subdomains, do not forget to add them in the `hosts` file too:
fr: Si vous voulez des sous-domaines, n'oubliez pas de les y rajouter auss dans le fichier `hosts`:
gl: Se queres crear subdominios, non esquezas engadilos tamén no ficheiro `hosts`:

source: This will be the domain used by your server's users to access the **authentication portal**. You can later add other domains, and change which one is the main domain if needed.
fr: C’est le nom de domaine qui permettra l’accès à votre serveur ainsi qu’au **portail d’authentification** des utilisateurs. Vous pourrez ensuite ajouter d'autres domaines, et changer celui qui sera le domaine principal si besoin.
gl: Este vai ser o dominio que usen as túas usuarias para acceder ao servidor no **portal de autenticación**. Posteriormente poderás engadir outros dominios, e cambiar o dominio que queres usar como dominio principal.

source: - If you're new to self-hosting and do not already have a domain name, we recommend using a **.nohost.me** / **.noho.st** / **.ynh.fr** (e.g. `homersimpson.nohost.me`). Provided that it's not already taken, the domain will be configured automatically and you won't need any further configuration step. Please note that the downside is that you won't have full-control over the DNS configuration. - If you already own a domain name, you probably want to use it here. You will later need to configure DNS records as explained [here](/admin/get_started/post_install/dns_config).
fr: - Si l'auto-hébergement est tout nouveau pour vous, et que vous n'avez pas encore de nom de domaine, nous recommandons d'utiliser un domaine en **.nohost.me** / **.noho.st** / **.ynh.fr** (exemple : `homersimpson.nohost.me`). S'il n'est pas déjà utilisé, le domaine sera automatiquement rattaché à votre serveur, et vous n’aurez pas d’étape de configuration supplémentaire. Toutefois, notez que l'utilisation d'un de ces noms de domaines implique que vous n'aurez pas le contrôle complet sur votre configuration DNS. - Si vous disposez déjà d'un nom de domaine, alors vous voulez probablement l'utiliser ici. Il vous faudra plus tard configurer les enregistrements DNS comme expliqué [ici](/admin/get_started/post_install/dns_config).
gl: - Se non tes experiencia coa auto-hospedaxe e aínda non posúes un nome de dominio, recomendamos utilizar un de *.nohost.me** / **.noho.st** / **.ynh.fr** (ex. `miropereira.nohost.me`). Dando por feito que non estea xa en uso por outra persoa, o domino configurarase de xeito automático e non precisarás facer ningún outro paso. Ten en conta que non terás control completo sobre a configuración DNS. - Se xa posúes un nome de dominio, probablemente queiras utilizalo aquí. Máis tarde poderás configurar os rexistros DNS tal como se explica [aquí](/admin/get_started/post_install/dns_config).

source: Yes, you *have to* configure a domain name. If you don't have any domain name and don't want a **.nohost.me** / **.noho.st** / **.ynh.fr** either, you can set up a dummy domain such as `yolo.test` and tweak your **local** `/etc/hosts` file such that this dummy domain [points to the appropriate IP, as explained here](/admin/tutorials/domains/dns_local_network).
fr: Oui, vous *devez* configurer un nom de domaine. Si vous n'avez pas de nom de domaine et que vous n'en voulez pas en **.nohost.me**, **.noho.st** ou **.ynh.fr**, vous pouvez utilisez un « faux » domaine comme par exemple `yolo.test` et [modifier votre fichier `/etc/hosts` **sur votre ordinateur local** pour que ce domaine pointe vers l'IP de votre serveur, comme expliqué ici](/admin/tutorials/domains/dns_local_network).
gl: Si, *tes que* configurar un nome de dominio. Se non posúes ningún nome de dominio e tampouco queres un de **.nohost.me** / **.noho.st** / **.ynh.fr** , podes poñer un dominio de pega como `yolo.test` e modificar o teu ficheiro **local** `/etc/hosts`para que este dominio falso apunte ao [enderezo IP axeitado, tal como se indica aquí](/admin/tutorials/domains/dns_local_network).

source: <FAIcon icon="fa-key"/> First user
fr: <FAIcon icon="fa-key"/> Premier compte utilisateur⋅ice
gl: <FAIcon icon="fa-key"/> Primeira usuaria

source: The first user is now created at this stage. You should pick a username and a reasonably complex password. (We cannot stress enough that the password should be **robust**!) This user will be added to the Admins group, and will therefore be able to access the user portal, the web admin interface, and connect [via **SSH**](/admin/command_line) or [**SFTP**](/admin/tutorials/filezilla). Admins will also receive emails sent to `root@yourdomain.tld` and `admin@yourdomain.tld`: these emails may be used to send technical informations or alerts. You can later add additional users, which you can also add to the Admins group.
fr: Le premier compte utilisateur est créé à cette étape. Il vous faudra choisir un nom d'utilisateur et un mot de passe raisonablement complexe. (Nous ne pouvons que souligner l'importance du choix d'un mot de passe **robuste** !) Ce compte utilisateur sera ajouté au groupe Admins, et pourra se connecter au portail utilisateur, à la webadmin, et se connecter [via **SSH**](/admin/command_line) ou [**SFTP**](/admin/tutorials/filezilla). Les admins recevront aussi les mails envoyés à `root@votredomaine.tld` et `admin@votredomaine.tld` : ces emails peuvent être utilisés pour envoyer des informations ou des alertes techniques. Vous pourrez plus tard ajouter d'autres comptes supplémentaires, qu'il est aussi possible d'ajouter au groupe Admins.
gl: A primeira usuaria créase neste paso. Debes escoller un nome de usuaria (identificador) e un contrasinal razoablemente complexo. (Permítenos subliñar a importancia de que o contrasinal sexa **forte**!) Esta usuaria será engadida ao grupo de Administración, e terá acceso ao portal de usuaria, á interface web de administración, e poderá conectarse [vía **SSH**](/admin/command_line) ou [**SFTP**](/admin/tutorials/filezilla). As contas Administradoras recibirán os correos enviados a `root@yourdomain.tld` e `admin@yourdomain.tld`: estes correo poden utilizarse para enviar información técnica ou alertas. Podes engadir máis tarde outras usuarias, que tamén poderás engadir ao grupo de Administración.

source: This user replaces the old `admin` user, which some old documentation page may still refer to. In which case: just replace `admin` with your username.
fr: Ce compte remplace l'ancien compte `admin`, qui est peut être toujours mentionné dans certaines pages de documentation. Dans ce cas, remplacez simplement `admin` par votre identifiant.
gl: Esta usuaria substitúe á antiga usuaria `admin`, que podería aparecer referida nalgunha páxina antiga na documentación. Nese caso, substitúe `admin`co teu nome de usuaria.

source: <FAIcon icon="fa-stethoscope"/> Run the initial diagnosis
fr: <FAIcon icon="fa-stethoscope"/> Lancer le diagnostic
gl: <FAIcon icon="fa-stethoscope"/> Diagnóstico inicial

source: Once the postinstall is done, you should be able to actually log in the web admin interface using the credentials of the first user you just created.
fr: Une fois la postinstall terminée, vous devriez pouvoir vous connecter à la webadmin en utilisant les identiants du premier compte que vous venez de créer.
gl: Unha vez remata a post-instalación, deberías poder acceder á interface web de administración usando as credenciais da primeira usuaria que creaches.

source: The diagnosis system is meant to provide an easy way to validate that all critical aspects of your server are properly configured - and guide you in how to fix issues. The diagnosis will run twice a day and send an alert by email if issues are detected.
fr: Le système de diagnostic est conçu comme un moyen facile de valider que tous les aspects critiques de votre serveur sont proprement configurés et pour vous guider dans la résolution des problèmes soulevés. Le diagnostic se lance deux fois par jour et envoie une alerte par email si un dysfonctionnement est détecté.
gl: O sistema de diagnóstico procura ofrecerche un xeito doado para comprobar que varios compoñentes importantes do teu servidor están correctamente configurados - e axudarche a solucionar posibles incidencias. O diagnóstico realízase dúas veces ao día e envía una alerta por correo se detecta incidencias.

source: **Don't run away** ! The first time you run the diagnosis, it is quite expected to see a bunch of yellow/red alerts because you typically need to [configure DNS records](/admin/get_started/post_install/dns_config) (if not using a `.nohost.me`/`noho.st`/`ynh.fr` domain), as well as [port forwarding](/admin/get_started/post_install/port_forwarding) on your home's router.
fr: **Ne partez pas en courant** ! La première fois que vous lancerez le diagnostic, il est assez normal d'avoir plusieurs alertes rouges ou jaunes car vous devez généralement [configurer les enregistrements DNS](/admin/get_started/post_install/dns_config) (si vous n'utilisez pas un domaine `.nohost.me`, `.noho.st` ou `.ynh.fr`), ajouter un fichier de swap ainsi que [configurer la redirection des ports](/admin/get_started/post_install/port_forwarding) sur votre box.
gl: **Non fuxas!!** A primeira vez que se realiza o diagnóstico cabe agardar que aparezan avisos amarelos/vermellos porque normalmente é preciso [configurar os rexistros DNS](/admin/get_started/post_install/dns_config) (se non usas `.nohost.me`/`noho.st`/`ynh.fr` domain) e tamén a [redireccións de portos](/admin/get_started/post_install/port_forwarding) no encamiñador da casa.

source: If an alert is not relevant (for example because you don't intend on using a specific feature), it is perfectly fine to flag the issue as 'ignored' by going in the webadmin > Diagnosis, and clicking the ignore button for this specifc issue.
fr: Si une alerte n'est pas pertinente (par exemple parce que vous ne pensez pas utiliser une fonctionnalité spécifique), il est tout à fait convenable d'indiquer le dysfonctionnement comme « À ignorer » en allant dans l'administration web > Diagnostic, et en cliquant sur le bouton « Ignorer » pour ce dysfonctionnement spécifique.
gl: Se unha alerta non é relevante (por exemplo porque non vas usar unha característica concreta) é perfectamente axeitado marcar a incidencia como 'ignorada' indo á Web de administración > Diagnóstico, e premer no botón ignorar para este asunto en concreto.

source: Especially, installations on WSL or virtual machines will likely not be reachable from outside without further network configuration on Virtualbox and your machine.
fr: Notamment, les installations WSL ou sur machines virtuelles ne seront généralement pas accessibles de l'extérieur sans une configuration réseau avancée sur Virtualbox et son hôte.
gl: Especialmente, en instalacións WSL ou máquinas virtuais é probable que non sexan accesibles desde o exterior se non está configurada a rede en Virtualbox e na túa máquina.

source: <TabItem value="web" label="(Recommended) From the web interface">
fr: <TabItem value="web" label="(Recommandé) Depuis l'interface web">
gl: <TabItem value="web" label="(Recomendado) desde a interface web">

source: To run a diagnosis, go on Web Admin in the Diagnosis section. Click Run initial diagnosis and you should get a screen like this:
fr: Pour lancer le diagnostic, allez dans la webadmin, dans la partie Diagnostic. Vous devriez obtenir un écran comme celui-ci :
gl: Para realizar o diagnóstico, vai á Web de Administración e á sección Diagnóstico. Preme en Realizar o diagnóstico inicial e deberías ver unha pantalla coma esta:

source: <Figure caption="Preview of the diagnostic panel" src="/img/webadmin/diagnostic.png"/>
fr: <Figure caption="Capture d'écran du panneau de diagnostic" src="/img/webadmin/diagnostic.png"/>
gl: <Figure caption="vista previa do panel de diagnóstico" src="/img/webadmin/diagnostic.png"/>

source: <FAIcon icon="fa-lock"/> Get a Let's Encrypt certificate
fr: <FAIcon icon="fa-lock"/> Obtenir un certificat Let's Encrypt
gl: <FAIcon icon="fa-lock"/> Obter un Certificado Let's Encrypt

source: Once you configured DNS records and port forwarding (if needed), you should be able to install a Let's Encrypt certificate. This will get rid of the spooky security warning from earlier for new visitors.
fr: Une fois que vous avez configuré, si nécessaire, les enregistrements DNS et la redirection de ports, vous devriez être en mesure d'installer un certificat Let's Encrypt. Ceci permettra de supprimer l'effrayante alerte de sécurité vue plus tôt.
gl: Unha vez están configurados os rexistros DNS e a redirección de portos (se fose preciso), deberías poder instalar o certificado de Let's Encrypt. Isto desbotará o molesto aviso de seguridade que vimos con anterioridade.

source: For more detailed instructions, or to lean more about SSL/TLS certificates, see [the corresponding page here](/admin/domains/certificate).
fr: Pour plus d'instructions détaillées, ou pour en savoir plus à propos des certificats SSL/TLS, voir [la page correspondante ici](/admin/domains/certificate).
gl: Para ter instrucións máis detalladas, ou saber máis sobre certificados SSL/TLS, le [a páxina correspondente aquí](/admin/domains/certificate).

source: Go in Domains > Click on your domain > Certificate
fr: Allez dans Domaines > le domaine concerné > Certificat
gl: Vai a Dominios > Preme no teu dominio > Certificado

source: <Figure caption="Preview of the diagnostic panel" src="/img/webadmin/certificate-before-LE.png"/>
fr: <Figure caption="Capture d'écran du panneau pour installer un certificat Let's Encrypt" src="/img/webadmin/certificate-before-LE.png"/>
gl: <Figure caption="vista previa da obtención do certificado" src="/img/webadmin/certificate-before-LE.png"/>

source: 🎉 Congratz!
fr: 🎉 Félicitations !
gl: 🎉 Parabéns!

source: You now have a pretty well configured server. If you're new to YunoHost, we recommend to have a look at [the guided tour](/admin/webadmin). You should also be able to [install your favourite applications](https://apps.yunohost.org/). Don't forget to [plan backups](/admin/backups) !
fr: Vous avez maintenant un serveur plutôt bien configuré. Si vous découvrez YunoHost, nous vous recommandons de jeter un œil à [la visite guidée](/admin/webadmin). Vous devriez aussi être en mesure d'[installer vos applications favorites](https://apps.yunohost.org). N'oubliez pas de [prévoir des sauvegardes](/admin/backups) !
gl: Agora xa tes bastante ben configurado o servidor. Se nunca usaches YunoHost, recomendámosche botar un ollo a [guía da interface web](/admin/webadmin), desde onde poderás [instalar as túas aplicacións preferidas](https://apps.yunohost.org/). Non esquezas [planificar as copias de apoio](/admin/backups)!
