Repository: YunoHost/doc
Catalog: i18n/docs/admin/45.tutorials__05.domains__dns_nohost_me/*.po
Languages: fr

source: In order to make self-hosting as accessible as possible, the YunoHost Project provides a *free* and *automatically configured* domain name service. By using this service, you won't have to [configure DNS records](/admin/get_started/post_install/dns_config) yourself, which can be tedious and technical.
fr: Afin de rendre l'auto-hébergement aussi accessible que possible, le projet YunoHost fournit un service de nom de domaine *gratuit* et *configuré automatiquement*. En utilisant ce service, vous n'aurez pas à [configurer les enregistrements DNS](/admin/get_started/post_install/dns_config) vous-même, ce qui peut être fastidieux et technique.

source: The following (sub)domains are offered:
fr: Les (sous-)domaines suivants sont proposés :

source: - `whateveryouwant.nohost.me`; - `whateveryouwant.noho.st`; - `whateveryouwant.ynh.fr`.
fr: - `cequevousvoulez.nohost.me` ; - `cequevousvoulez.noho.st` ; - `cequevousvoulez.ynh.fr`.

source: Nohost.me domains
fr: Domaines nohost.me

source: To use this service, you simply have to choose such a domain during the post-installation set up. It will then be automatically configured by YunoHost!
fr: Pour utiliser ce service, il vous suffit de choisir un tel domaine lors de la configuration post-installation. Il sera alors automatiquement configuré par YunoHost !

source: As a fairness measure, each instance may only have **one such domain** setup at any given time.
fr: Par souci d'équité, chaque instance ne peut disposer **que d'un seul domaine de ce type** à un moment donné.

source: Subdomains
fr: Sous-domaines

source: The `nohost.me`, `noho.st` and `ynh.fr` domain service allows the creation of subdomains.
fr: Les noms de domaine `nohost.me`, `noho.st` et `ynh.fr` permettent la création de sous-domaines.

source: YunoHost allows the installation of applications on subdomains (for example, having the Nextcloud application accessible from the `cloud.mydomain.org` address), this feature is also allowed with the `nohost.me`, `noho.st` and `ynh.fr` domains and so it is possible to have a subdomain such as `my.application.mydomain.nohost.me`. To create a subdomain on `nohost.me`, `noho.st` and `ynh.fr`, you just have to add the subdomain to YunoHost like any other domains.
fr: YunoHost permet l'installation d'applications sur des sous-domaines (par exemple, rendre l'application Nextcloud accessible depuis l'adresse `cloud.mydomain.org`). Cette fonctionnalité est également disponible avec les domaines `nohost.me`, `noho.st` et `ynh.fr`, ce qui permet d'avoir un sous-domaine tel que `mon.application.mondomain.nohost.me`. Pour créer un sous-domaine sur `nohost.me`, `noho.st` et `ynh.fr`, il suffit d'ajouter le sous-domaine à YunoHost comme n'importe quel autre domaine.

source: Adding a `nohost.me`, `noho.st` or `ynh.fr` domain after the post-installation
fr: Ajouter un domaine `nohost.me`, `noho.st` ou `ynh.fr` après la post-installation

source: If you already did the postinstall and want to add an automatic domain, you may do so from the "Domains" web interface, selecting the option "I don't have a domain name..."
fr: Si vous avez déjà effectué l'installation et que vous souhaitez ajouter un domaine automatique, vous pouvez le faire à partir de l'interface web "Domaines", en sélectionnant l'option "Je n'ai pas de nom de domaine ...".

source: Alternatively, the following commands can be used.
fr: Il est également possible d'utiliser les commandes suivantes.

source: Retrieve a `nohost.me`, `noho.st` or `ynh.fr` domain
fr: Récupérer un domaine `nohost.me`, `noho.st` ou `ynh.fr`

source: If you reinstall your server and want to use a domain already used previously, you must request a domain reset on the forum [in the dedicated thread](https://forum.yunohost.org/t/nohost-domain-recovery/442).
fr: Si vous réinstallez votre serveur et souhaitez utiliser un domaine déjà utilisé précédemment, vous devez demander une réinitialisation du domaine sur le forum [dans le fil de discussion dédié](https://forum.yunohost.org/t/nohost-domain-recovery/442).

source: Change a `nohost.me`, `noho.st` or `ynh.fr` domain
fr: Modifier un domaine `nohost.me`, `noho.st` ou `ynh.fr`

source: If you wish to use a different automatic domain, you first have to remove your present domain registration. This is done in 3 steps:
fr: Si vous souhaitez utiliser un autre domaine automatique, vous devez d'abord supprimer votre enregistrement de domaine actuel. Cela se fait en 3 étapes :

source: 1. Remove the domain from your instance (via webadmin or the `yunohost domain remove` in the CLI). 2. Since YunoHost 11.2, you can now define a recovery password for your nohost.me, noho.st or ynh.fr domain **during postinstall**, so that the recovery is automatic and no longer requires intervention from the YunoHost team via [the old, deprecated forum thread](https://forum.yunohost.org/t/nohost-domain-recovery/442). - If you didn't set the recovery password during postinstall, you can use `yunohost domain dyndns set-recovery-password` (add `--help` for help) to define one. 3. Remove automatic domain configuration files on your server, via CLI only: `sudo rm /etc/cron.d/yunohost-dyndns && sudo rm -r /etc/yunohost/dyndns`
fr: 1. Supprimez le domaine de votre instance (via webadmin ou la commande `yunohost domain remove` dans l'interface CLI). 2. Depuis YunoHost 11.2, vous pouvez désormais définir un mot de passe de récupération pour votre domaine nohost.me, noho.st ou ynh.fr **lors de la post-installation**, afin que la récupération soit automatique et ne nécessite plus l'intervention de l'équipe YunoHost via [l'ancien fil de discussion obsolète du forum](https://forum.yunohost.org/t/nohost-domain-recovery/442) . - Si vous n'avez pas défini le mot de passe de récupération pendant la post-installation, vous pouvez utiliser `yunohost domain dyndns set-recovery-password` (ajoutez `--help` pour obtenir de l'aide) pour en définir un. 3. Supprimez les fichiers de configuration automatique du domaine sur votre serveur, via l'interface CLI uniquement : `sudo rm /etc/cron.d/yunohost-dyndns && sudo rm -r /etc/yunohost/dyndns`

source: You may then add a new domain.
fr: Vous pouvez ensuite ajouter un nouveau domaine.
