Repository: YunoHost/doc
Catalog: i18n/docs/admin/50.troubleshooting__25.blacklist_forms/*.po
Languages: fr

source: Removing your server’s IP/domain from antispam listings
fr: Suppression de l'adresse IP/ou le domaine de votre serveur des listes antispam

source: For various reasons, your IP or domain may end up in blocklists and get rejected by specific email providers, or anti-spam services. If you receive an alert from the diagnosis tool, clicking Details should point you to the appropriate form to contest the listing and get your server removed from it.
fr: Pour diverses raisons, votre adresse IP ou votre domaine peut se retrouver sur des listes de blocage et être rejeté par certains fournisseurs de messagerie électronique ou services anti-spam. Si vous recevez une alerte de l'outil de diagnostic, cliquez sur Détails pour accéder au formulaire approprié afin de contester l'inscription et faire supprimer votre serveur de la liste.

source: Test your server
fr: Testez votre serveur

source: To check your Email deliverability, YunoHost provide automatic tests in the Diagnosis section of the webadmin, checking the presence of your server on blocklists / RBL (Realtime Blackhole List), as well as compliance with other standard practice demonstrating that your server is legitimately sending email (as opposed to infected machines used by hackers/spammers/botnet), such as DNS records and reverse DNS configuration. The diagnosis will also indicate if there is a suspiciously high number of emails pending in the send queue.
fr: Pour vérifier la délivrabilité de vos e-mails, YunoHost propose des tests automatiques dans la section Diagnostic de l'interface d'administration web. Ceux-ci vérifient la présence de votre serveur sur les listes de blocage / RBL (Realtime Blackhole List), ainsi que la conformité à d'autres pratiques standard démontrant que votre serveur envoie légitimement des e-mails (par opposition aux machines infectées utilisées par des pirates/spammeurs/botnets), telles que les enregistrements DNS et la configuration DNS inverse. Le diagnostic indiquera également s'il y a un nombre anormalement élevé d'e-mails en attente dans la file d'attente d'envoi.

source: Complementary to these checks, you may be interested in the following services: - by sending an email to the random test address indicated on [Mail tester](https://www.mail-tester.com) ... though most of the checks are covered by YunoHost's diagnosis. - by checking your server's public IP on : [MultiRBL Valli](https://multirbl.valli.org/) or [Whatismyip](https://whatismyipaddress.com/blacklist-check)
fr: En complément de ces vérifications, ces services suivants pourraient vous intéresser : - en envoyant un e-mail à l'adresse de test aléatoire indiquée sur [Mail tester](https://www.mail-tester.com) ... bien que la plupart des vérifications soient couvertes par le diagnostic de YunoHost. - en vérifiant l'adresse IP publique de votre serveur sur : [MultiRBL Valli](https://multirbl.valli.org/) ou [Whatismyip](https://whatismyipaddress.com/blacklist-check)

source: Checking email-related logs
fr: Vérification des journaux liés aux e-mails

source: This command can help you to summarize which emails sent by your server got refused by other SMTP servers, and why:
fr: Cette commande peut vous aider à résumer quels e-mails envoyés par votre serveur ont été refusés par d'autres serveurs SMTP, et pourquoi :

source: You might want to compare this to [the list of SMTP return codes](https://en.wikipedia.org/wiki/List_of_SMTP_server_return_codes).
fr: Vous pouvez comparer cela à [la liste des codes de retour SMTP](https://en.wikipedia.org/wiki/List_of_SMTP_server_return_codes).

source: Specific email providers
fr: Fournisseurs de messagerie électronique spécifiques

source: YunoHost is only able to test generic blocklists using the DNS RBL mechanism. However, Gmail, Microsoft, Yahoo or Free maintains their own blocklisting mechanism. In some situation, you may need to contact their teams through dedicated forms or use dedicated tools.
fr: YunoHost ne peut tester que les listes de blocage génériques utilisant le mécanisme DNS RBL. Cependant, Gmail, Microsoft, Yahoo ou Free gèrent leur propre mécanisme de liste de blocage. Dans certains cas, vous devrez peut-être contacter leurs équipes via des formulaires dédiés ou utiliser des outils spécifiques.

source: - No way to test easily IP reputation - [Microsoft guide for postmaster](https://sendersupport.olc.protection.outlook.com/pm/) - [Information about SMTP return code from Microsoft](https://sendersupport.olc.protection.outlook.com/pm/troubleshooting.aspx#Codes) - Reputation Management tools : - [Junk Email Reporting Program (JMRP)](https://postmaster.live.com/snds/JMRP.aspx) - [Smart Network Data Services (SNDS)](https://postmaster.live.com/snds/index.aspx) - [Get support form for deliverability issues](https://support.microsoft.com/supportrequestform/8ad563e3-288e-2a61-8122-3ba03d6b8d75) (Sadly you need a Microsoft account :/ )
fr: - Impossible de tester facilement la réputation IP - [Guide Microsoft pour les gestionnaires de messagerie](https://sendersupport.olc.protection.outlook.com/pm/) - [Informations sur les codes de retour SMTP de Microsoft](https://sendersupport.olc.protection.outlook.com/pm/troubleshooting.aspx#Codes) - Outils de gestion de la réputation : - [Programme de signalement des courriers indésirables (JMRP)](https://postmaster.live.com/snds/JMRP.aspx) - [Services de données réseau intelligents (SNDS)](https://postmaster.live.com/snds/index.aspx) - [Obtenir un formulaire d'assistance pour les problèmes de délivrabilité](https://support.microsoft.com/supportrequestform/8ad563e3-288e-2a61-8122-3ba03d6b8d75) (Malheureusement, vous devez disposer d'un compte Microsoft :/ )

source: - No way to test easily IP reputation - [Google guide for postmaster](https://support.google.com/a/topic/1354753) - [Information about SMTP return code from Google](https://support.google.com/a/answer/3726730) - Reputation Management tools : [Google Postmaster Tools](https://postmaster.google.com) - [Get support form for deliverability issues](https://support.google.com/mail/contact/bulk_send_new)
fr: - Impossible de tester facilement la réputation IP - [Guide Google pour les gestionnaires de messagerie](https://support.google.com/a/topic/1354753) - [Informations sur le code de retour SMTP de Google](https://support.google.com/a/answer/3726730) - Outils de gestion de la réputation : [Outils Google pour les gestionnaires de messagerie](https://postmaster.google.com) - [Obtenir un formulaire d'assistance pour les problèmes de délivrabilité](https://support.google.com/mail/contact/bulk_send_new)

source: - No way to test easily IP reputation - [Yahoo guide for postmaster](https://senders.yahooinc.com/best-practices) - [Information about SMTP return code from Yahoo](https://senders.yahooinc.com/smtp-error-codes) - Reputation Management tools : [Complaint Feedback Loop](https://io.help.yahoo.com/contact/index?page=contactform&locale=en_US&token=Zh%2FBBVqXzLHlIbokbUqVWTUbuuQeXGkGnZzhKR2JQ4O6mMQdy9JSWdtWFXvjthcYCRj9bUIFfycOfG%2B4GOHPHoOGa8HwDO2%2B0kYRtTcdR8Nja5P9HWkKh3VWfS3pyu4UdjhvwG%2BBCvnYFl5dToDK%2Fw%3D%3D&selectedChannel=email-icon) - [Get support form for deliverability issues](https://senders.yahooinc.com/contact)
fr: - Impossible de tester facilement la réputation IP - [Guide Yahoo pour les administrateurs de messagerie](https://senders.yahooinc.com/best-practices) - [Informations sur le code de retour SMTP de Yahoo](https://senders.yahooinc.com/smtp-error-codes) - Outils de gestion de la réputation : [Réclamation et retour d'information](https://io. help.yahoo.com/contact/index?page=contactform&locale=en_US&token=Zh%2FBBVqXzLHlIbokbUqVWTUbuuQeXGkGnZzhKR2JQ4O6mMQdy9JSWdtWFXvjthcYCRj9bUIFfycOfG%2B4GOHPHoOGa8HwDO2%2B0kYRtTcdR8Nja5P9HWkKh3VWfS3pyu4UdjhvwG%2BBCvnYFl5dToDK%2Fw%3D%3D&selectedChannel=email-icon) - [Obtenir un formulaire d'assistance pour les problèmes de délivrabilité](https://senders.yahooinc.com/contact)

source: Free (french ISP)
fr: Free (FAI français)

source: You can find a tool to test your IP, advices, explanation of error code and a way to contact Free on [this page](https://postmaster.free.fr/)
fr: Vous trouverez un outil pour tester votre adresse IP, des conseils, des explications sur les codes d'erreur et un moyen de contacter Free sur [cette page](https://postmaster.free.fr/).

source: Receving alerts about emails sent without SPF or DKIM
fr: Recevoir des alertes concernant les e-mails envoyés sans SPF ou DKIM

source: If you use your own domains and think that some mails are sent by unauthorized servers (so without SPF/DKIM), you can obtain reports from other mail server by declaring an email address in the DMARC DNS record:
fr: Si vous utilisez vos propres domaines et pensez que certains e-mails sont envoyés par des serveurs non autorisés (donc sans SPF/DKIM), vous pouvez obtenir des rapports d'autres serveurs de messagerie en déclarant une adresse e-mail dans l'enregistrement DNS DMARC :
