Repository: YunoHost/doc
Catalog: i18n/docs/admin/05.get_started__10.providers__15.vpn__vpn_advantage/*.po
Languages: de, fr, it

source: Advantages
de: Vorteile
fr: Avantages
it: Vantaggi

source: Advantage of a VPN for self-hosting
de: Vorteil eines VPN für Selbst-Hosting
fr: Avantages d’un VPN pour l’auto-hébergement
it: Vantaggi di una VPN per il self-hosting

source: Since setting up a server at home is an uncommon practice, most Internet connections provided to individuals are unsuitable for this purpose. A net neutral VPN providing a static IPv4 address and IPv6 addresses can help to circumvent some limitations or difficulties.
de: Es ist unüblich, zu Hause einen Server einzurichten, und die meisten Internetanschlüsse, die Privatpersonen zur Verfügung stehen, sind für diesen Zweck ungeeignet. Ein netzneutrales VPN, das eine feste IPv4-Adresse und IPv6-Adressen bereitstellt, kann helfen, einige der Einschränkungen oder Schwierigkeiten zu überwinden.
fr: L'installation d'un serveur chez soi étant une pratique peu courante, la plupart des connexions Internet fournies aux particuliers sont inadaptées à sa mise en pratique. Un VPN respectant la neutralité du net et fournissant une adresse IPv4 fixe et des adresses IPv6 peut permettre de contourner certaines limitations ou certaines difficultés.
it: Poiché installare un server a casa è una pratica abbastanza poco comune molte connessioni Internet casalinghe non sono realmente utilizzabili per questo scopo. Una VPN rispettosa della neutralità di rete (net neutrality) con un indirizzo IPv4 fisso e indirizzi IPv6 può aiutare a superare alcune limitazioni e difficoltà.

source: Not all existing [VPN providers](/admin/get_started/providers/vpn/) meet these conditions, make sure the one you choose meets them.
fr: Tous les [fournisseurs VPN](/admin/get_started/providers/vpn/) existants ne remplissent pas ces conditions, assurez-vous bien que celui que vous choisissez les remplit.
it: Non tutti i [provider di VPN](/admin/get_started/providers/vpn/) rispettano queste condizioni, controllate che quello scelto le rispetti.

source: By setting up a VPN on your server, you'll be able to make it accessible to the rest of the Internet without having to change the configuration of the router you connect it to. This can be really handy if you are going on vacation, moving or have an Internet disconnection, as you will be able to easily connect it to someone you trust without having to configure the router of the person who is helping you.
de: Indem Sie ein VPN auf Ihrem Server einrichten, können Sie ihn für den Rest des Internets zugänglich machen, ohne die Konfiguration des Routers, an den Sie ihn anschließen, ändern zu müssen. Dies kann sehr praktisch sein, wenn Sie in den Urlaub fahren, umziehen oder einen Internetausfall haben, da Sie das Gerät einfach an eine Person Ihres Vertrauens anschließen können, ohne den Router der Person konfigurieren zu müssen, die Ihnen hilft.
fr: En configurant un VPN sur votre serveur, vous serez en mesure de le rendre accessible au reste d'Internet sans avoir à modifier la configuration du routeur auquel vous le branchez. Ce point peut être vraiment pratique si vous partez en vacances, que vous déménagez ou si vous avez une coupure d'Internet, car vous serez en mesure de le brancher facilement chez une personne de confiance sans avoir besoin de configurer le routeur de la personne qui vous aide.
it: Usare una VPN per il vostro server vi permetterà di renderlo accessibile a tutta Internet senza dover fare alcun cambiamento al router al quale lo connettete. Questa cosa risulta estremamente comoda se state andando in vacanza, se state traslocando o nel caso di una disconnessione da Internet poiché potrete facilmente riconnettere il server da qualcuno di fiducia senza necessità di riconfigurare il router della persone che vi sta aiutando.

source: In the same way, you save yourself the trouble of opening your router's ports and bypassing hairpinning.
de: Außerdem ersparen Sie sich die Mühe, die Ports Ihres Routers zu öffnen und das Hairpinning zu umgehen.
fr: De la même façon, vous vous économisez l'ouverture des ports de votre routeur ainsi que le contournement du hairpinning.
it: Allo stesso modo vi risparmierete il problema di aprire le porte del vostro router per bypassare l'hairpinning.

source: No micro DNS outages
de: Keine Mikro-DNS-Ausfälle
fr: Pas de micro-coupure DNS
it: Nessun micro distacco del DNS

source: If your Internet connection does not have a fixed public IP, you will be forced to set up a dynamic domain name (Dynamic DNS). This solution may be acceptable, but the DNS will only be updated at regular intervals (every two minutes if it is a `noho.st` or `nohost.me` domain name). So there is a chance that this will cause some display errors in the browser from time to time, or even that another site will be displayed (the risks are however reduced because the practice of self-hosting is not widespread).
de: Wenn Ihr Internetanschluss keine feste öffentliche IP hat, müssen Sie einen dynamischen Domänennamen (Dynamic DNS) einrichten. Diese Lösung mag akzeptabel sein, aber das DNS wird nur in regelmäßigen Abständen aktualisiert (alle zwei Minuten, wenn es sich um einen `noho.st` oder `nohost.me` Domänennamen handelt). Es besteht also die Möglichkeit, dass dies gelegentlich zu Darstellungsfehlern im Browser führt oder dass sogar eine andere Website angezeigt wird (die Risiken sind jedoch geringer, da die Praxis des Self-Hosting nicht weit verbreitet ist).
fr: Si votre connexion Internet n'a pas d'IP publique fixe, vous serez obligé de mettre en place un nom de domaine dynamique (Dynamique DNS). Cette solution peut être acceptable, mais la mise à jour du DNS ne se fera qu'à intervalle régulier (Toutes les deux minutes si c'est un nom de domaine en `noho.st` ou `nohost.me`). Il y a donc une chance que cela provoque de temps en temps des erreurs d'affichage dans le navigateur, voir même qu'un autre site s'affiche (les risques sont toutefois réduits car la pratique de l'auto-hébergement n'est pas répandue).
it: Se la vostra connessione ad Internet non ha un IP pubblico fisso dovrete utilizzare un sistema di nome a dominio dinamico (Dynamic DNS). La soluzione è accettabile però il DNS verrà aggiornato ad intervalli regolari (ad esempio con i domini registrati su `noho.st` e `nohost.me` ogni due minuti). Di conseguenza è possibile che i browser possano mostrare degli errori di tanto in tanto o che addirittura venga mostrato un altro sito (anche se questa possibilità è abbastanza remota in quanto il self-hosting non è ancora molto diffuso).

source: With a neutral VPN, this problem is circumvented because the VPN can be compared to a Virtual Internet connection, which has its own fixed IPv4 address, so no need to update the domain name.
de: Mit einem neutralen VPN wird dieses Problem umgangen, da das VPN mit einer virtuellen Internetverbindung verglichen werden kann, die eine eigene feste IPv4-Adresse hat, so dass der Domänenname nicht aktualisiert werden muss.
fr: Avec un VPN neutre, ce problème est contourné car le VPN peut être comparé à une connexion Internet Virtuelle, qui a sa propre adresse IPv4 fixe, dès lors plus besoin de mettre à jour le nom de domaine.
it: Con una VPN neutrale il problema è bypassato in quanto la VPN può essere assimilata ad una connessione ad Internet virtuale con un indirizzo IPv4 fisso e quindi il dominio non deve essere aggiornato.

source: The case of email
de: Der Fall der E-Mail
fr: Le cas du mail
it: La questione della posta elettronica

source: Email is one of the most complex protocols to self-host, usually it is what a user self-hosts last. Indeed, it is very easy to find yourself in a situation where emails sent by the server are refused by the recipient SMTP servers.
de: E-Mail ist eines der komplexesten Protokolle, die man selbst hosten kann, und in der Regel ist es das, was ein Benutzer zuletzt selbst hostet. In der Tat kann es leicht passieren, dass vom Server gesendete E-Mails von den SMTP-Servern der Empfänger abgelehnt werden.
fr: Le mail est un des protocoles les plus complexes à auto-héberger, en général c'est ce qu'un utilisateur auto-héberge en dernier. En effet, il est très facile de se retrouver dans une situation où les emails envoyés par le serveur sont refusés par les serveurs SMTP destinataires.
it: La posta elettronica è uno dei protocolli più complessi per il self-hosting e di conseguenza quello che viene impostato per ultimo. E difatti è molto facile trovarsi nella situazione in cui le email inviate dal server vengono rifiutate dai server SMTP di destinazione.

source: To avoid this you need to:
de: Um dies zu vermeiden, müssen Sie u. a. :
fr: Pour éviter ça il faut entre autre :
it: Per evitare questa situazione dovete:

source: - configure the reverse DNS of the server's Internet connection (or VPN) - a fixed IPv4 - that this IPv4 is removable from all blacklists (notably the IP must not be on the DUL) - to be able to open port 25 (as well as the other SMTP ports)
fr: - configurer le reverse DNS de la connexion Internet (ou du VPN) du serveur - une IPv4 fixe - que cette IPv4 soit enlevable de toutes les listes noires (notamment l'IP ne doit pas être sur le DUL) - pouvoir ouvrir le port 25 (ainsi que les autres ports SMTP)

source: Unfortunately, none of the most common French ISPs respect all these points.
de: Leider beachtet keiner der gängigsten französischen Internetanbieter alle diese Punkte.
fr: Malheureusement, aucun des FAI français les plus courants ne respecte la totalité de ces points.
it: Purtroppo quasi nessun IPS francese diffuso (e neanche italiano) permette di rispettare tutte queste necessità.

source: To overcome this, the use of a VPN respecting these points can be an alternative.
de: Um dies zu vermeiden, kann die Verwendung eines VPN, das diese Punkte berücksichtigt, eine Alternative darstellen.
fr: Pour pallier cela, l'usage d'un VPN respectant ces points peut être une alternative.
it: Di conseguenza usare una VPN che rispetta queste richieste è una valida alternativa.

source: Trust
de: Vertrauen
fr: Confiance
it: Fiducia

source: Finally, if you do not want the content of your server's communications to be spied on by equipment present on your ISP's network, you can use a VPN to encrypt your communications and deport your trust to a VPN provider. Remember, since 2015, the government officially deploys black boxes at the large network operators whose objective is to tap all French digital communications to preserve the scientific, economic and industrial interests of France.
de: Wenn Sie nicht möchten, dass der Inhalt der Kommunikation Ihres Servers von Geräten im Netz Ihres Internetanbieters ausspioniert wird, können Sie ein VPN verwenden, um Ihre Kommunikation zu verschlüsseln und Ihr Vertrauen in einen VPN-Anbieter zu setzen. Zur Erinnerung: Seit 2015 hat die Regierung offiziell Blackboxes bei großen Netzbetreibern installiert, um die gesamte digitale Kommunikation in Frankreich abzuhören und so die wissenschaftlichen, wirtschaftlichen und industriellen Interessen Frankreichs zu schützen.
fr: Enfin, si vous ne souhaitez pas que le contenu des communications de votre serveur soit espionnable par des équipements présents sur le réseau de votre fournisseur d'accès à Internet, vous pouvez utiliser un VPN pour chiffrer vos communications et déporter votre confiance sur un fournisseur de VPN. Rappel, depuis 2015, le gouvernement déploie officiellement des boîtes noires chez les gros opérateurs réseau qui ont pour objectif de mettre sur écoute l'ensemble des communications numériques françaises entre autre pour préserver les intérêts scientifiques, économiques et industrielles de la France.
it: Infine, se non volete che la comunicazioni del vostro server possano essere intercettate dall'infrastruttura di rete del vostro ISP potete usare la VPN per cifrare le vostre comunicazioni e spostare la fiducia al provider della VPN. Ricordate che fin dal 2015 il governo (francese) installa ufficialmente delle `black box` nelle sedi dei grandi operatori di rete con l'obbiettivo di intercettare tutte le comunicazioni digitali francesi per controllare gli interessi scientifici, economici e industriali della Francia (non è chiaro cosa succede in Italia).

source: Disadvantages
de: Benachteiligung
fr: Inconvénient
it: Svantaggi

source: Cost
de: Kosten
fr: Coût
it: Costi

source: A neutral VPN has a cost since the operator who provides it must run a server and use bandwidth. The prices of the FFDN's associative VPNs are around 6 € per month.
de: Ein neutrales VPN ist mit Kosten verbunden, da der Betreiber, der es bereitstellt, einen Server betreiben und Bandbreite nutzen muss. Die Preise für die assoziativen VPNs des FFDN liegen bei etwa 6 € pro Monat.
fr: Un VPN neutre a un coût puisque l'opérateur qui le fournit doit faire fonctionner un serveur et utiliser de la bande passante. Les prix des VPN associatifs de la FFDN sont autour de 6 € par mois.
it: Una VPN neutrale presenta dei costi aggiuntivi poiché l'operatore che a fornisce deve gestire un server e consumare banda. Il costo di una VPN di un associato a FFDN (consorzio francese di operatori di rete sociali) si aggira intorno ai 6€ al mese.

source: Packet path
de: Packet Routing
fr: Trajet des paquets

source: When you set up a VPN on your server, if you don't set up any particular configuration, the transfer of a file from a computer on the local network to the server using the VPN, will go through the end of the VPN i.e. through the server of the VPN provider.
de: Wenn Sie ein VPN auf Ihrem Server einrichten, wird die Übertragung einer Datei von einem Computer im lokalen Netzwerk zum Server, der das VPN nutzt, über das Ende des VPN, d.h. über den Server des VPN-Anbieters, laufen, wenn Sie keine besondere Konfiguration einrichten.
fr: Lorsque l'on met en place un VPN sur son serveur, si on ne met pas en place de configuration particulière, le transfert d'un fichier d'un ordinateur du réseau local vers le serveur utilisant le VPN, passera par le bout du VPN c'est-à-dire par le serveur du fournisseur de VPN.
it: Usando una VPN su vostro server, a meno di particolari configurazioni, la strada percorsa dai file da un computer sulla vostra rete locale al server della VPN passerà dal nodo terminale della VPN, cioè dal server del provider.

source: To solve this problem, there are two solutions:
de: Um dies zu vermeiden, gibt es zwei Lösungen :
fr: Pour pallier ce point, il y a deux solutions :
it: Ci sono due possibili soluzioni a questo problema:

source: - transform the server into a router and connect the home equipments to it, these equipments will then benefit from the VPN confidentiality too. - use the YunoHost server as a DNS resolver when you are at home, in order to redirect the server's domain names to the local IP rather than the public IP. This operation can be done either on each equipment or on the router (if the latter allows it).
fr: - transformer son serveur en routeur et connecter les équipements de la maison à ce dernier, ces équipements bénéficieront alors de la confidentialité du VPN également. - utiliser le serveur YunoHost comme résolveur DNS lorsque l'on est chez soi, de façon à rediriger les noms de domaines du serveur l'IP locale plutôt que l'IP publique. Cette opération peut se faire soit sur chaque équipement, soit sur le routeur (si ce dernier le permet).
