Repository: YunoHost/doc
Catalog: i18n/docs/admin/80.advanced__45.certificate_custom/*.po
Languages: fr

source: Custom certificates
fr: Certificats personnalisés

source: Since version 2.5, YunoHost integrates Let's Encrypt certificates automated management. You can easily and freely [install a Let's Encrypt certificate](/admin/domains/certificate). The following document describes the steps for installing a paid certificate from a certification authority (**Gandi**, **RapidSSL**, **StartSSL**, **Cacert**).
fr: Depuis la version 2.5, YunoHost intègre la gestion automatisée des certificats Let's Encrypt. Vous pouvez facilement et librement [installer un certificat Let's Encrypt](/admin/domains/certificate). Le document suivant décrit les étapes à suivre pour installer un certificat payant provenant d'une autorité de certification (**Gandi**, **RapidSSL**, **StartSSL**, **Cacert**).

source: Some changes have taken place which impact the procedures indicated below:
fr: Certaines modifications ont été apportées, qui ont une incidence sur les procédures indiquées ci-dessous :

source: - Metronome group is no longer used directly but ssl-cert. - A `/etc/yunohost/certs/DOMAIN.LTD-history/stamp` directory is used to keep each configuration created and a symlink is created.
fr: - Le groupe Metronome n'est plus utilisé directement, mais ssl-cert. - Un répertoire `/etc/yunohost/certs/DOMAIN.LTD-history/stamp` est utilisé pour conserver chaque configuration créée et un lien symbolique est créé.

source: Adding a signed certificate by an authority (other than Let's Encrypt)
fr: Ajout d'un certificat signé par une autorité (autre que Let's Encrypt)

source: After the certificate creation with your registration authority, you must have a private key, the key file, and a public certificate, the crt file.
fr: Après avoir créé le certificat auprès de votre autorité d'enregistrement, vous devez disposer d'une clé privée, du fichier de clé, et d'un certificat public, du fichier crt.

source: Note that the key file is very sensitive, it is strictly personal and must be very well secured.
fr: Notez que le fichier clé est très sensible, il est strictement personnel et doit être très bien sécurisé.

source: These two files should be copied to the server, if they are not already there.
fr: Ces deux fichiers doivent être copiés sur le serveur, s'ils ne s'y trouvent pas déjà.

source: From Windows, scp can be used with Putty, by downloading the tool [pscp](http://the.earth.li/~sgtatham/putty/latest/x86/pscp.exe)
fr: Sous Windows, scp peut être utilisé avec Putty, en téléchargeant l'outil [pscp](http://the.earth.li/~sgtatham/putty/latest/x86/pscp.exe).

source: As soon as the files are on the server, the rest of the work will be done on it. In [ssh](/admin/command_line) or locally. First, create a folder to store the obtained certificates.
fr: Dès que les fichiers sont sur le serveur, le reste du opérations s'effectuera directement sur le serveur. Dans [ssh](/admin/command_line) ou localement. Commencez par créer un dossier pour stocker les certificats obtenus.

source: Then, go to the parent folder to continue.
fr: Ensuite, allez dans le dossier parent pour continuer.

source: As a caution, back up the certificates of origin from YunoHost.
fr: Par mesure de précaution, sauvegardez les certificats d'origine de YunoHost.

source: Depending on the registration authority, intermediate and root certificates must be obtained.
fr: Selon l'autorité d'enregistrement, des certificats intermédiaires et racine doivent être obtenus.

source: Intermediate and root certificates must be combined with the obtained certificate to create a unified certificate chain.
fr: Les certificats intermédiaires et racine doivent être combinés avec le certificat obtenu afin de créer une chaîne de certificats unifiée.

source: The private key must be converted to `.pem` format.
fr: La clé privée doit être convertie au format `.pem`.

source: To ensure the certificates syntax, check the files contents.
fr: Pour vérifier la syntaxe des certificats, vérifiez le contenu des fichiers.

source: The certificates and private key should look like this:
fr: Les certificats et la clé privée doivent ressembler à ceci :

source: Finally, secure your certificate files.
fr: Enfin, sécurisez vos fichiers de certificats.

source: Now the certificates (two files with the extension `.pem`) must be copied in `/etc/yunohost/certs/DOMAIN.TLD`.
fr: Les certificats (deux fichiers avec l'extension `.pem`) doivent maintenant être copiés dans `/etc/yunohost/certs/DOMAIN.TLD`.

source: Reload NGINX configuration to take into account the new certificate.
fr: Rechargez la configuration NGINX pour prendre en compte le nouveau certificat.

source: Your certificate is ready. However, you can ensure that it is in place by testing the certificate using the [geocerts](https://www.geocerts.com/ssl_checker).
fr: Votre certificat est prêt. Cependant, vous pouvez vous assurer qu'il est en place en le testant à l'aide de [geocerts](https://www.geocerts.com/ssl_checker).
